{
  "title": "CHAPTER IV.",
  "subtitle": "THROUGH THE TS’UNG OR ‘ONION’ MOUNTAINS TO K’EEH-CH’Â;—PROBABLY SKARDO, OR SOME CITY MORE TO THE EAST IN LADAK.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "WHEN the processions of images in the fourth month were over, Săng-shâo, by himself alone, followed a Tartar who was an earnest follower of the Law[1], and proceeded towards Kophene[2].",
          "Fâ-hien and the others went forward to the kingdom of Tsze-hoh, which it took them twenty-five days to reach[3].",
          "Its king was a strenuous follower of our Law[4], and had (around him) more than a thousand monks, mostly students of the mahâyâna.",
          "Here (the travellers) abode fifteen days, and then went south for four days, when they found themselves among the Ts’ung-Iing mountains, and reached the country of Yu-hwuy[5], where they halted and kept their retreat[6].",
          "When this was over, they went on among the hills[7] for twenty-five days, and got to K’eeh-ch’â[8], there rejoining Hwuy-king[9] and his two companions."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "This Tartar is called a 道人, ‘a man of the Tao,’ or faith of Buddha.",
            "It occurs several times in the sequel, and denotes the man who is not a Buddhist outwardly only, but inwardly as well, whose faith is always making itself manifest in his ways.",
            "The name may be used of followers of other systems of faith besides Buddhism."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the account of the kingdom of Kophene, in the 96th Book of the first Han Records, p. 78, where its capital is said to be 12,200 le from Ch’ang-gan.",
            "It was the whole or part of the present Cabulistan.",
            "The name of Cophene is connected with the river Kophes, supposed to be the same as the present Cabul river, which falls into the Indus, from the west, at Attock, after passing Peshâwur.",
            "The city of Cabul, the capital of Afghanistan, may be the Kophene of the text; but we do not know that Săng-shâo and his guide got so far west.",
            "The text only says that they set out from Khoten ‘towards it.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Tsze-hoh has not been identified.",
            "Beal thinks it was Yarkand, which, however, was north-west from Khoten.",
            "Watters (‘China Review,’ p.135) rather approves the suggestion of ‘Tashkurgan in Sirikul’ for it.",
            "As it took Fâ-hien twenty-five days to reach it, it must have been at least 150 miles from Khoten."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The king is described here by a Buddhistic phrase, denoting the possession of vîryabala, ‘the power of energy; persevering exertion—one of the five moral powers’ (E. H., p. 170)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Nor has Yu-hwuy been clearly identified.",
            "Evidently it was directly south from Tsze-hoh, and among the ‘Onion’ mountains.",
            "Watters hazards the conjecture that it was the Aktasch of our present maps."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This was the retreat already twice mentioned as kept by the pilgrims in the summer, the different phraseology, ‘quiet rest,’ without any mention of the season, indicating their approach to India, E. H., p. 168.",
            "Two, if not three, years had elapsed since they left Ch’ang-gan.",
            "Are we now with them in 402?"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This is the Corean reading (山), much preferable to the 止 of the Chinese editions."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See p. 18, note 2.",
            "Watters approves of Klaproth’s determination of K’eeh-ch’a to be Iskardu or Skardo.",
            "There are difficulties in connexion with the view, but it has the advantage, to my mind very great, of bringing the pilgrims across the Indus.",
            "The passage might be accomplished with ease at this point of the river’s course, and therefore is not particularly mentioned."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Who had preceded them from Khoten, p. 18."
          ]
        }
      ]
    }
  ]
}
