{
  "title": "CHAPTER XIII.",
  "subtitle": "NAGÂRA. FESTIVAL OF BUDDHA’S SKULL-BONE. OTHER RELICS, AND HIS SHADOW.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "GOING west for sixteen yojanas[1], he came to the city He-lo[2] in the borders of the country of Nagâra, where there is the flat-bone of Buddha’s skull, deposited in a vihâra[3] adorned all over with gold-leaf and the seven sacred substances.",
          "The king of the country, revering and honouring the bone, and anxious lest it should be stolen away, has selected eight individuals, representing the great families in the kingdom, and committed to each a seal, with which he should seal (its shrine) and guard (the relic).",
          "At early dawn these eight men come, and after each has inspected his seal, they open the door.",
          "This done, they wash their hands with scented water and bring out the bone, which they place outside the vihâra, on a lofty platform, where it is supported on a round pedestal of the seven precious substances, and covered with a bell of lapis lazuli, both adorned with rows of pearls.",
          "Its colour is of a yellowish white, and it forms an imperfect circle twelve inches round[4] curving upwards to the centre.",
          "Every day, after it has been brought forth, the keepers of the vihara ascend a high gallery, where they beat great drums, blow conchs, and clash their copper cymbals.",
          "When the king hears them, he goes to the vihâra, and makes his offerings of flowers and incense.",
          "When he has done this, he (and his attendants) in order, one after another, (raise the bone), place it (for a moment) on the top of their heads[5], and then depart, going out by the door on the west as they had entered by that on the east.",
          "The king every morning makes his offerings and performs his worship, and afterwards gives audience on the business of his government.",
          "The chiefs of the Vaiśyas[6] also make their offerings before they attend to their family affairs.",
          "Every day it is so, and there is no remissness in the observance of the custom.",
          "When all the offerings are over, they replace the bone in the vihâra, where there is a vimoksha tope[7], of the seven precious substances, and rather more than five cubits high, sometimes open, sometimes shut, to contain it.",
          "In front of the door of the vihâra, there are parties who every morning sell flowers and incense[8], and those who wish to make offerings buy some of all kinds.",
          "The kings of various countries are also constantly sending messengers with offerings.",
          "The vihâra stands in a square of thirty paces, and though heaven should shake and earth be rent, this place would not move."
        ]
      },
      {
        "sentences": [
          "Going on, north from this, for a yojana, (Fâ-hien) arrived at the capital of Nagâra, the place where the Bodhisattva once purchased with money five stalks of flowers, as an offering to the Dîpâṅkara Buddha[9].",
          "In the midst of the city there is also the tope of Buddha’s tooth, where offerings are made in the same way as to the flat-bone of his skull."
        ]
      },
      {
        "sentences": [
          "A yojana to the north-east of the city brought him to the mouth of a valley, where there is Buddha’s pewter staff[10]; and a vihâra also has been built at which offerings are made.",
          "The staff is made of Gośîrsha Chandana, and is quite sixteen or seventeen cubits long.",
          "It is contained in a wooden tube, and though a hundred or a thousand men were to (try to) lift it, they could not move it."
        ]
      },
      {
        "sentences": [
          "Entering the mouth of the valley, and going west, he found Buddha's Saṅghâli[11], where also there is reared a vihâra, and offerings are made.",
          "It is a custom of the country when there is a great drought, for the people to collect in crowds, bring out the robe, pay worship to it, and make offerings, on which there is immediately a great rain from the sky."
        ]
      },
      {
        "sentences": [
          "South of the city, half a yojana there is a rock-cavern, in a great hill fronting the south-west; and here it was that Buddha left his shadow.",
          "Looking at it from a distance of more than ten paces, you seem to see Buddha’s real form, with his complexion of gold, and his characteristic marks[12] in their nicety clearly and brightly displayed.",
          "The nearer you approach, however, the fainter it becomes, as if it were only in your fancy.",
          "When the kings from the regions all around have sent skilful artists to take a copy, none of them have been able to do so.",
          "Among the people of the country there is a saying current that ‘the thousand Buddhas[13] must all leave their shadows here.’"
        ]
      },
      {
        "sentences": [
          "Rather more than four hundred paces west from the shadow, when Buddha was at the spot, he shaved off his hair and clips his nails, and proceeded, along with his disciples, to build a tope seventy or eighty cubits high, to be a model for all future topes; and it is still existing.",
          "By the side of it there is a monastery, with more than seven hundred monks in it.",
          "At this place there are as many as a thousand topes[14] of Arhans and Pratyeka Buddhas[15]."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Now in India, Fâ-hien used the Indian measure of distance; but it is not possible to determine exactly what its length then was.",
            "The estimates of it are very different, and vary from four and a half or five miles to seven, and sometimes more.",
            "See the subject exhaustively treated in Davids’ ‘Ceylon Coins and Measures,’ pp. 15-17."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The present Hidda, west of Prshâwur, and five miles south of Jellalabad."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The vihâra,’ says Hardy, ‘is the residence of a recluse or priest;’ and so Davids:—‘the clean little hut where the mendicant lives.’",
            "Our author, however, does not use the Indian name here, but the Chinese characters which express its meaning —tsing shay, ‘a pure dwelling.’",
            "He uses the term occasionally, and evidently in this sense; more frequently it occurs in his narrative in connexion with the Buddhist relic worship; and at first I translated it by ‘shrine’ and ‘shrine-house;’ but I came to the conclusion, at last, to employ always the Indian name.",
            "The first time I saw a shrine-house was, I think, in a monastery near Foo-chow;—a small pyramidal structure, about ten feet high, glittering as if with the precious substances, but all, it seemed to me, of tinsel.",
            "It was in a large apartment of the building, having many images in it.",
            "The monks said it was the most precious thing in their possession, and that if they opened it, as I begged them to do, there would be a convulsion that would destroy the whole establishment.",
            "See E. H., p. 166.",
            "The name of the province of Behar was given to it in consequence of its many vihâras."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "According to the characters, ‘square, round, four inches.’",
            "Hsüan-chwang says it was twelve inches round."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In Williams’ Dictionary, under 項, the characters, used here, are employed in the phrase for ‘to degrade an officer,’ that is, ‘to remove the token of his rank worn on the crown of his head;’ but to place a thing on the crown is a Buddhistic form of religious homage."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Vaiśyas, or bourgeois caste of Hindu society, are described here as ‘resident scholars.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See Eitel’s Handbook under the name vimoksha, which is explained as ‘the act of self-liberation,’ and ‘the dwelling or state of liberty.’",
            "There are eight acts of liberating one's self from all subjective and objective trammels, and as many states of liberty (vimukti) resulting therefrom.",
            "They are eight degrees of self-inanition, and apparently eight stages on the way to nirvâṇa.",
            "The tope in the text would be emblematic in some way of the general idea of the mental progress conducting to the Buddhistic consummation of existence."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This incense would be in long ‘sticks,’ small and large, such as are sold to-day throughout China, as you enter the temples."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The illuminating Buddha,’ the twenty-fourth predecessor of Śâkyamuni, and who, so long before, gave him the assurance that he would by-and-by be Buddha.",
            "See Jâtaka Tales, p. 23."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The staff was, as immediately appears, of Gośîrsha Chandana, or ‘sandal-wood from the Cow’s-head mountain,’ a species of copper-brown sandal-wood, said to be produced most abundantly on a mountain of (the fabulous continent) Ullarakuru, north of mount Meru, which resembles in shape the head of a cow (E. H., pp. 42, 43).",
            "It is called a ‘pewter staff’ from having on it a head and rings of pewter.",
            "See Watters, ‘China Review,’ viii, pp. 227, 228, and Williams’ Dictionary, under 杖."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Or Saṅghâṭi, the double or composite robe, part of a monk’s attire, reaching from the shoulders to the knees, and fastened round the waist (E. H., p. 118)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "These were the ‘marks and beauties’ on the person of a supreme Buddha.",
            "The ṛishi Kalâ Devala saw them on the body of the infant Śâkya prince to the number of 328, those on the teeth, which had not yet come out, being visible to his spirit-like eyes (M. B., pp. 148, 149)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Probably=‘all Buddhas.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The number may appear too great.",
            "But see what is said on the size of topes in note i, page 17."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In Singhalese, Pasê Buddhas; called also Nidâna Buddhas, and Pratyeka Jinas, and explained by ‘individually intelligent,’ ‘completely intelligent,’ ‘intelligent as regards the nidânas.’",
            "This, says Eitel (pp. 96, 97), is ‘a degree of saintship unknown to primitive Buddhism, denoting automats in ascetic life who attain to Buddhaship “individually,” that is, without a teacher, and without being able to save others. As the ideal hermit, the Pratyeka Buddha is compared with the rhinoceros khadga that lives lonely in the wilderness. He is also called Nidâna Buddha, as having mastered the twelve nidânas (the twelve links in the everlasting chain of cause and effect in the whole range of existence, the understanding of which solves the riddle of life, revealing the inanity of all forms of existence, and preparing the mind for nirvâṇa). He is also compared to a horse, which, crossing a river, almost buries its body under the water, without, however, touching the bottom of the river. Thus in crossing saṃsâra he “suppresses the errors of life and thought, and the effects of habit and passion, without attaining to absolute perfection.”’",
            "Whether these Buddhas were unknown, as Eitel says, to primitive Buddhism, may be doubted.",
            "See Davids’ Hibbert Lectures, p. 146."
          ]
        }
      ]
    }
  ]
}
