{
  "title": "CHAPTER X.",
  "subtitle": "GANDHÂRA. LEGENDS OF BUDDHA.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "THE travellers, going downwards from this towards the east, in five days came to the country of Gandhâra[1], the place where Dharma-vivardhana[2], the son of Aśoka[3], ruled.",
          "When Buddha was a Bodhisattva, he gave his eyes also for another man here[4]; and at the spot they have also reared a large tope, adorned with layers of gold and silver plates.",
          "The people of the country were mostly students of the hînayâna."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Eitel says ‘an ancient kingdom, corresponding to the region about Dheri and Banjour.’",
            "But see note 1 on next page."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Dharma-vivardhana is the name in Sanskrit, represented by the Fâ Yî (法益) of the text."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Aśoka is here mentioned for the first time;—the Constantine of the Buddhist society, and famous for the number of vihâras and topes which he erected.",
            "He was the grandson of Chandragupta (i.q. Sandracottus), a rude adventurer, who at one time was a refugee in the camp of Alexander the Great; and within about twenty years afterwards drove the Greeks out of India, having defeated Seleucus, the Greek ruler of the Indus provinces.",
            "He had by that time made himself king of Magadha.",
            "His grandson was converted to Buddhism by the bold and patient demeanour of an Arhat whom he had ordered to be buried alive, and became a most zealous supporter of the new faith.",
            "Dr. Rhys Davids (Sacred Books of the East, vol. xi, p. xlvi) says that ‘Aśoka’s coronation can be fixed with absolute certainty within a year or two either way of 267 B.C.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This also is a Jâtaka story; but Eitel thinks it may be a myth, constructed from the story of the blinding of Dharma-vivardhana."
          ]
        }
      ]
    }
  ]
}
