{
  "title": "CHAPTER XXXVII.",
  "subtitle": "TO CHAMPÂ AND TÂMALIPTÎ. STAY AND LABOURS THERE FOR THREE YEARS. TAKES SHIP TO SINGHALA, OR CEYLON.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FOLLOWING the course of the Ganges, and descending eastwards for eighteen yojanas, he found on the southern bank the great kingdom of Champâ[1], with topes reared at the places where Buddha walked in meditation by his vihâra, and where he and the three Buddhas, his predecessors, sat.",
          "There were monks residing at them all.",
          "Continuing his journey east for nearly fifty yojanas, he came to the country of Tâmaliptî[2], (the capital of which is) a seaport.",
          "In the country there are twenty-two monasteries, at all of which there are monks residing.",
          "The Law of Buddha is also flourishing in it.",
          "Here Fâ-hien stayed two years, writing out his Sûtras[3], and drawing pictures of images."
        ]
      },
      {
        "sentences": [
          "After this he embarked in a large merchant-vessel, and went floating over the sea to the south-west.",
          "It was the beginning of winter, and the wind was favourable; and, after fourteen days, sailing day and night, they came to the country of Singhala[4].",
          "The people said that it was distant (from Tâmaliptî) about 700 yojanas."
        ]
      },
      {
        "sentences": [
          "The kingdom is on a large island, extending from east to west fifty yojanas, and from north to south thirty.",
          "Left and right from it there are as many as 100 small islands, distant from one another ten, twenty, or even 200 le; but all subject to the large island.",
          "Most of them produce pearls and precious stones of various kinds; there is one which produces the pure and brilliant pearl[5],—an island which would form a square of about ten le.",
          "The king employs men to watch and protect it, and requires three out of every ten such pearls, which the collectors find."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Probably the modern Champanagur, three miles west of Baglipoor, lat. 25°14' N., lon. 56° 55' E."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Then the principal emporium for the trade with Ceylon and China; the modern Tam-look, lat. 22° 17' N., lon. 88° 2' E.; near the mouth of the Hoogly."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Perhaps Ching (經) is used here for any portions of the Tripiṭaka which he had obtained."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The Kingdom of the Lion,’ Ceylon.",
            "Singhala was the name of a merchant adventurer from India, to whom the founding of the kingdom was ascribed.",
            "His father was named Singha, ‘the Lion,’ which became the name of the country;—Singhala, or Singha-Kingdom, ‘the Country of the Lion.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Called the maṇi pearl or bead.",
            "Maṇi is explained as meaning ‘free from stain,’ ‘bright and growing purer.’",
            "It is a symbol of Buddha and of his Law.",
            "The most valuable rosaries are made of maṇis."
          ]
        }
      ]
    }
  ]
}
