{
  "title": "CHAPTER XI.",
  "subtitle": "TAKSHAŚILÂ. LEGENDS. THE FOUR GREAT TOPES.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "SEVEN days’ journey from this to the east brought the travellers to the kingdom of Takshaśilâ[1], which means ‘the severed head’ in the language of China.",
          "Here, when Buddha was a Bodhisattva, he gave away his head to a man[2]; and from this circumstance the kingdom got its name."
        ]
      },
      {
        "sentences": [
          "Going on further for two days to the east, they came to the place where the Bodhisattva threw down his body to feed a starving tigress.",
          "In these two places also large topes have been built, both adorned with layers of all the precious substances.",
          "The kings, ministers, and peoples of the kingdoms around vie with one another in making offerings at them.",
          "The trains of those who come to scatter flowers and light lamps at them never cease.",
          "The nations of those quarters call those (and the other two mentioned before) ‘the four great topes.’"
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "See Julien’s ‘Méthode pour déchiffrer et transcrire les Noms Sanscrits,’ p. 206.",
            "Eitel says, ‘The Taxila of the Greeks, the region near Hoosun Abdaul in lat. 35° 48' N., lon. 72° 44' E.",
            "But this identification, I am satisfied, is wrong.",
            "Cunningham, indeed, takes credit (‘Ancient Geography of India,’ pp. 108, 109) for determining this to be the site of Arrian’s Taxila,—in the upper Punjâb, still existing in the ruins of Shahdheri, between the Indus and Hydaspes (the modern Jhelum).",
            "So far he may be correct; but the Takshaśilâ of Fâ-hien was on the other, or western side of the Indus; and between the river and Gandhâra.",
            "It took him, indeed, seven days travelling eastwards to reach it; but we do not know what stoppages he may have made on the way.",
            "We must be wary in reckoning distances from his specifications of days."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Two Jâtaka stories.",
            "See the account of the latter in Spence Hardy’s ‘Manual of Buddhism,’ pp. 91, 92. It took place when Buddha had been born as a Brahman in the village of Daliddi; and from the merit of the act, he was next born in a devaloka."
          ]
        }
      ]
    }
  ]
}
