{
  "title": "CHAPTER II.",
  "subtitle": "ON TO SHEN-SHEN AND THENCE TO KHOTEN.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "AFTER travelling for seventeen days, a distance we may calculate of about 1500 le, (the pilgrims) reached the kingdom of Shen-shen[1], a country rugged and hilly, with a thin and barren soil.",
          "The clothes of the common people are coarse, and like those worn in our land of Han[2], some wearing felt and others coarse serge or cloth of hair;—this was the only difference seen among them.",
          "The king professed (our) Law, and there might be in the country more than four thousand monks[3], who were all students of the hînayâna[4].",
          "The common people of this and other kingdoms (in that region), as well as the śramans[5], all practise the rules of India[6], only that the latter do so more exactly, and the former more loosely.",
          "So (the travellers) found it in all the kingdoms through which they went on their way from this to the west, only that each had its own peculiar barbarous speech[7].",
          "(The monks), however, who had (given up the worldly life) and quitted their families, were all students of Indian books and the Indian language.",
          "Here they stayed for about a month, and then proceeded on their journey, fifteen days walking to the north-west bringing them to the country of Woo-e[8].",
          "In this also there were more than four thousand monks, all students of the hînayâna.",
          "They were very strict in their rules, so that śramans from the territory of Ts’in[9] were all unprepared for their regulations.",
          "Fâ-hien, through the management of Foo Kung-sun, maître d’hôtellerie[10], was able to remain (with his company in the monastery where they were received) for more than two months, and here they were rejoined by Pâo-yun and his friends[11].",
          "(At the end of that time) the people of Woo-e neglected the duties of propriety and righteousness, and treated the strangers in so niggardly a manner that Che-yen, Hwuy-keen, and Hwuy-wei went back towards Kâo-ch’ang[12], hoping to obtain there the means of continuing their journey.",
          "Fâ-hien and the rest, however, through the liberality of Foo Kung-sun, managed to go straight forward in a south-west direction.",
          "They found the country uninhabited as they went along.",
          "The difficulties which they encountered in crossing the streams and on their route, and the sufferings which they endured, were unparalleled in human experience, but in the course of a month and five days they succeeded in reaching Yu-teen[13]."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "An account is given of the kingdom of Shen-shen in the 96th of the Books of the first Han dynasty, down to its becoming a dependency of China, about B.C. 80.",
            "The greater portion of that is now accessible to the English reader in a translation by Mr. Wylie in the ‘Journal of the Anthropological Institute,’ August, 1880.",
            "Mr. Wylie says:—‘Although we may not be able to identify Shen-shen with certainty, yet we have sufficient indications to give an approximate idea of its position, as being south of and not far from lake Lob.’",
            "He then goes into an exhibition of those indications, which I need not transcribe.",
            "It is sufficient for us to know that the capital city was not far from Lob or Lop Nor, into which in lon. 38° E. the Tarim flows.",
            "Fâ-hien estimated its distance to be 1500 le from T’un-hwang.",
            "He and his companions must have gone more than twenty-five miles a day to accomplish the journey in seventeen days."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This is the name which Fâ-hien always uses when he would speak of China, his native country, as a whole, calling it from the great dynasty which had ruled it, first and last, for between four and five centuries.",
            "Occasionally, as we shall immediately see, he speaks of ‘the territory of Ts’in or Ch’in,’ but intending thereby only the kingdom of Ts’in, having its capital, as described in the first note on the last chapter, in Ch’ang-gan."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "So I prefer to translate the character 僧 (săng) rather than by ‘priests.’",
            "Even in Christianity, beyond the priestly privilege which belongs to all believers, I object to the ministers of any denomination or church calling themselves ‘priests;’ and much more is the name inapplicable to the śramaṇas or bhikshus of Buddhism which acknowledges no God in the universe, no soul in man, and has no services of sacrifice or prayer in its worship.",
            "The only difficulty in the use of ‘monks’ is caused by the members of the sect in Japan which, since the middle of the fifteenth century, has abolished the prohibition against marrying on the part of its ministers, and other prohibitions in diet and dress.",
            "Săng and săng-keâ represent the Sanskrit saṅgha, which denotes (E. H., p. 117), first, an assembly of monks, or bhikshu saṅgha, constituted by at least four members, and empowered to hear confession, to grant absolution, to admit persons to holy orders, &c.; secondly, the third constituent of the Buddhistic Trinity, a deification of the communio sanctorum, or the Buddhist order.",
            "The name is used by our author of the monks collectively or individually as belonging to the class, and may be considered as synonymous with the name śramaṇa, which will immediately claim our attention."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Meaning the ‘small vehicle, or conveyance.’",
            "There are in Buddhism the triyâna, or ‘three different means of salvation, i.e. of conveyance across the saṃsâra, or sea of transmigration, to the shores of nirvâṇa. Afterwards the term was used to designate the different phases of development through which the Buddhist dogma passed, known as the mahâyâna, hînayâna, and madhyamayâna.’",
            "‘The hînayâna is the simplest vehicle of salvation, corresponding to the first of the three degrees of saintship. Characteristics of it are the preponderance of active moral asceticism, and the absence of speculative mysticism and quietism.’ E. H., pp. 151-2, 45, and 117."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘Śraman’ may in English take the place of Śramaṇa (Pâli, Samana; in Chinese, Shâ-măn), the name for Buddhist monks, as those who have separated themselves from (left) their families, and quieted their hearts from all intrusion of desire and lust.",
            "‘It is employed, first, as a general name for ascetics of all denominations, and, secondly, as a general designation of Buddhistic monks.’ E.H., pp. 130, 131."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The name for India is here the same as in the former chapter and throughout the book,—T'een-chuh (天竺), the chuh being pronounced, probably, in Fâ-hien's time as tuk.",
            "How the earliest name for India, Shin-tuk or duk=Scinde, came to be changed into Thien-tuk, it would take too much space to explain.",
            "I believe it was done by the Buddhists, wishing to give a good auspicious name to the fatherland of their Law, and calling it ‘the Heavenly Tuk,’ just as the Mohammedans call Arabia ‘the Heavenly region’ (天方), and the court of China itself is called ‘the Celestial’ (天朝)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Tartar or Mongolian."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Woo-e has not been identified. Walters (‘China Review,’ viii. 115) says: ‘We cannot be far wrong if we place it in Kharaschar, or between that and Kutscha.’",
            "It must have been a country of considerable size to have so many monks in it."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This means in one sense China, but Fâ-hien, in his use of the name, was only thinking of the three Ts’in states of which I have spoken in a previous note; perhaps only of that from the capital of which he had himself set out."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This sentence altogether is difficult to construe, and Mr. Watters, in the ‘China Review,’ was the first to disentangle more than one knot in it.",
            "I am obliged to adopt the reading of 行堂 in the Chinese editions, instead of the 行當 in the Corean text.",
            "It seems clear that only one person is spoken of as assisting the travellers, and his name, as appears a few sentences farther on, was Foo Kung-sun.",
            "The 行堂 which immediately follows the surname Foo (符), must be taken as the name of his office, corresponding, as the 行 shows, to that of le maître d’hôtellerie in a Roman Catholic abbey.",
            "I was once indebted myself to the kind help of such an officer at a monastery in Canton province.",
            "The Buddhistic name for him is uddesika,=overseer.",
            "The Kung-sun that follows his surname indicates that he was descended from some feudal lord in the old times of the Chow dynasty.",
            "We know indeed of no ruling house which had the surname of Foo, but its adoption by the grandson of a ruler can be satisfactorily accounted for; and his posterity continued to call themselves Kung-sun, duke or lord’s grandson, and so retain the memory of the rank of their ancestor."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Whom they had left behind them at T’un-hwang."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The country of the Ouighurs, the district around the modern Turfan or Tangut."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Yu-teen is better known as Khoten.",
            "Dr. P. Smith gives (p. 11) the following description of it:—‘A large district on the south-west of the desert of Gobi, embracing all the country south of Oksu and Yarkand, along the northern base of the Kwun-lun mountains, for more than 300 miles from east to west. The town of the same name, now called Ilchî, is in an extensive plain on the Khoten river, in lat. 37° N., and Ion. 80° 35' E. After the Tungâni insurrection against Chinese rule in 1862, the Mufti Hâji Habeeboolla was made governor of Khoten, and held the office till he was murdered by Yakoob Beg, who became for a time the conqueror of all Chinese Turkestan. Khoten produces fine linen and cotton stuffs, jade ornaments, copper, grain, and fruits.’",
            "The name in Sanskrit is Kustana (E. H., p. 60)."
          ]
        }
      ]
    }
  ]
}
