{
  "title": "CHAPTER XIX.",
  "subtitle": "SHÂ-CHE. LEGEND OF BUDDHA’S DANTA-KÂSHṬHA.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "GOING on from this to the south-east for three yojanas, they came to the great kingdom of Shâ-che[1].",
          "As you go out of the city of Shâ-che by the southern gate, on the east of the road (is the place) where Buddha, after he had chewed his willow branch[2], stuck it in the ground, when it forthwith grew up seven cubits, (at which height it remained) neither increasing nor diminishing.",
          "The Brahmans with their contrary doctrines[3] became angry and jealous.",
          "Sometimes they cut the tree down, some- times they plucked it up, and cast it to a distance, but it grew again on the same spot as at first.",
          "Here also is the place where the four Buddhas walked and sat, and at which a tope was built that is still existing."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Shâ-che should probably be Shâ-khe, making Cunningham’s identification of the name with the present Saket still more likely.",
            "The change of 祇 into 祇 is slight [Ed. Note: So slight that I cannot find separate characters in the Unicode database: https://www.unicode.org/cgi-bin/UnihanRSIndex.pl?radical=113&minstrokes=3&maxstrokes=5&useutf8=false. This character also seems to have undergone a significant further shift in how it is rendered. The Unicode character 祇 used here is the modern equivalent of the characters used in the original text. See http://humanum.arts.cuhk.edu.hk/Lexis/lexi-mf/search.php?word=%E7%A5%87 for more information in Chinese]; and, indeed, the Khang-hsî dictionary thinks the two characters should be but one and the same."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This was, no doubt, what was called the danta-kâshṭha, or ‘dental wood,’ mostly a bit of the ficus Indicus or banyan tree, which the monk chews every morning to cleanse his teeth, and for the purpose of health generally.",
            "The Chinese, not having the banyan, have used, or at least Fa-hien used, Yang (楊, the general name for the willow) instead of it."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Are two classes of opponents, or only one, intended here, so that we should read ‘all the unbelievers and Brahmans,’ or ‘heretics and Brahmans?’ I think the Brahmans were also ‘the unbelievers’ and ‘heretics,’ having 外道 views and ways outside of, and opposed to, Buddha’s."
          ]
        }
      ]
    }
  ]
}
