{
  "title": "CHAPTER XVII.",
  "subtitle": "SAṄKÂŚYA. BUDDHA’S ASCENT TO AND DESCENT FROM THE TRAYASTRIṂŚAS HEAVEN, AND OTHER LEGENDS.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FROM this they proceeded south-east for eighteen yojanas, and found themselves in a kingdom called Saṅkâśya[1], at the place where Buddha came down, after ascending to the Trayastriṃśas heaven[2], and there preaching for three months his Law for the benefit of his mother[3].",
          "Buddha had gone up to this heaven by his supernatural power[4], without letting his disciples know; but seven days before the completion (of the three months) he laid aside his invisibility, and Anuruddha[5], with his heavenly eyes, saw the World-honoured one, and immediately said to the honoured one, the great Mugalan, ‘Do you go and salute the World-honoured one.’",
          "Mugalan forthwith went, and with head and face did homage at (Buddha’s) feet.",
          "They then saluted and questioned each other, and when this was over, Buddha said to Mugalan, ‘Seven days after this I will go down to Jambudvîpa;’ and thereupon Mugalan returned.",
          "At this time the great kings of eight countries with their ministers and people, not having seen Buddha for a long time, were all thirstily looking up for him, and had collected in clouds in this kingdom to wait for the World-honoured one."
        ]
      },
      {
        "sentences": [
          "Then the bhikshuṇî Utpala[6] thought in her heart, ‘To-day the kings, with their ministers and people, will all be meeting (and welcoming) Buddha.",
          "I am (but) a woman; how shall I succeed in being the first to see him[7]?’ Buddha immediately, by his spirit-like power, changed her into the appearance of a holy Chakravartti[8] king, and she was the foremost of all in doing reverence to him."
        ]
      },
      {
        "sentences": [
          "As Buddha descended from his position aloft in the Trayastriṃśas heaven, when he was coming down, there were made to appear three flights of precious steps.",
          "Buddha was on the middle flight, the steps of which were composed of the seven precious substances.",
          "The king of Brahma-loka[9] also made a flight of silver steps appear on the right side, (where he was seen) attending with a white chowry in his hand.",
          "Śakra, Ruler of Devas[10], made (a flight of) steps of purple gold on the left side, (where he was seen) attending and holding an umbrella of the seven precious substances.",
          "An innumerable multitude of the devas[11] followed Buddha in his descent.",
          "When he was come down, the three flights all disappeared in the ground, excepting seven steps, which continued to be visible.",
          "Afterwards king Aśoka, wishing to know where their ends rested, sent men to dig and see.",
          "They went down to the yellow springs[12] without reaching the bottom of the steps, and from this the king received an increase to his reverence and faith, and built a vihâra over the steps, with a standing image, sixteen cubits in height, right over the middle flight.",
          "Behind the vihâra he erected a stone pillar, about fifty cubits high[13], with a lion on the top of it[14].",
          "Let into the pillar, on each of its four sides[15], there is an image of Buddha, inside and out[16] shining and transparent, and pure as it were of lapis lazuli.",
          "Some teachers of another doctrine[17] once disputed with the Śramaṇas about (the right to) this as a place of residence, and the latter were having the worst of the argument, when they took an oath on both sides on the condition that, if the place did indeed belong to the Śramaṇas, there should be some marvellous attestation of it.",
          "When these words had been spoken, the lion on the top gave a great roar, thus giving the proof; on which their opponents were frightened, bowed to the decision, and withdrew."
        ]
      },
      {
        "sentences": [
          "Through Buddha having for three months partaken of the food of heaven, his body emitted a heavenly fragrance, unlike that of an ordinary man.",
          "He went immediately and bathed; and afterwards, at the spot where he did so, a bathing-house was built, which is still existing.",
          "At the place where the bhikshuṇî Utpala was the first to do reverence to Buddha, a tope has now been built."
        ]
      },
      {
        "sentences": [
          "At the places where Buddha, when he was in the world, cut his hair and nails[18], topes are erected; and where the three Buddhas[19] that preceded Śâkyamuni Buddha and he himself sat; where they walked[20], and where images of their persons were made.",
          "At all these places topes were made, and are still existing.",
          "At the place where Śakra, Ruler of the Devas, and the king of the Brahma-loka followed Buddha down (from the Trayastriṃśas heaven) they have also raised a tope."
        ]
      },
      {
        "sentences": [
          "At this place the monks and nuns may be a thousand, who all receive their food from the common store, and pursue their studies, some of the mahâyâna and some of the hînayâna.",
          "Where they live, there is a white-eared dragon, which acts the part of danapati[21] to the community of these monks, causing abundant harvests in the country, and the enriching rains to come in season, without the occurrence of any calamities, so that the monks enjoy their repose and ease.",
          "In gratitude for its kindness, they have made for it a dragon-house, with a carpet for it to sit on, and appointed for it a diet of blessing, which they present for its nourishment.",
          "Every day they set apart three of their number to go to its house, and eat there.",
          "Whenever the summer retreat is ended, the dragon straightway changes its form, and appears as a small snake[22], with white spots at the side of its ears.",
          "As soon as the monks recognise it, they fill a copper vessel with cream, into which they put the creature, and then carry it round from the one who has the highest seat (at their tables) to him who has the lowest, when it appears as if saluting them.",
          "When it has been taken round, immediately it disappears; and every year it thus comes forth once.",
          "The country is very productive, and the people are prosperous, and happy beyond comparison.",
          "When people of other countries come to it, they are exceedingly attentive to them all, and supply them with what they need."
        ]
      },
      {
        "sentences": [
          "Fifty yojanas north-west from the monastery there is another, called ‘The Great Heap.’[23]",
          "Great Heap was the name of a wicked demon, who was converted by Buddha, and men subsequently at this place reared a vihâra.",
          "When it was being made over to an Arhat by pouring water on his hands[24], some drops fell on the ground.",
          "They are still on the spot, and however they may be brushed away and removed, they continue to be visible, and cannot be made to disappear."
        ]
      },
      {
        "sentences": [
          "At this place there is also a tope to Buddha, where a good spirit constantly keeps (all about it) swept and watered, without any labour of man being required.",
          "A king of corrupt views once said, ‘Since you are able to do this, I will lead a multitude of troops and reside there till the dirt and filth has increased and accumulated, and (see) whether you can cleanse it away or not.’",
          "The spirit thereupon raised a great wind, which blew (the filth away), and made the place pure."
        ]
      },
      {
        "sentences": [
          "At this place there are a hundred small topes, at which a man may keep counting a whole day without being able to know (their exact number).",
          "If he be firmly bent on knowing it, he will place a man by the side of each tope.",
          "When this is done, proceeding to count the number of the men, whether they be many or few, he will not get to know (the number)[25]."
        ]
      },
      {
        "sentences": [
          "There is a monastery, containing perhaps 600 or 700 monks, in which there is a place where a Pratyeka Buddha[26] used to take his food.",
          "The nirvâṇa ground (where he was burned[27] after death) is as large as a carriage wheel; and while grass grows all around, on this spot there is none.",
          "The ground also where he dried his clothes produces no grass, but the impression of them, where they lay on it, continues to the present day."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "The name is still remaining in Samkassam, a village forty-five miles north-west of Canouge, lat. 27° 3' N., lon. 79° 50' E."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The heaven of Indra or Śakya, meaning ‘the heaven of thirty-three classes,’ a name which has been explained both historically and mythologically.",
            "‘The description of it,’ says Eitel, p. 148, ‘tallies in all respects with the Svarga of Brahmanic mythology.",
            "It is situated between the four peaks of the Meru, and consists of thirty-two cities of devas, eight on each of the four corners of the mountain.",
            "Indra’s capital of Bellevue is in the centre.",
            "There he is enthroned, with a thousand heads and a thousand eyes, and four arms grasping the vajra, with his wife and 119,000 concubines.",
            "There he receives the monthly reports of the four Mahârâjas, concerning the progress of good and evil in the world,’ &c. &c."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Buddha’s mother, Mâyâ and Mahâmâyâ, the mater immaculata of the Buddhists, died seven days after his birth.",
            "Eitel says, ‘Reborn in Tushita, she was visited there by her son and converted.’",
            "The Tushita heaven was a more likely place to find her in than the Trayastriṃśas; but was the former a part of the latter? Hardy gives a long account of Buddha’s visit to the Trayastriṃśas (M. B., pp. 298-302), which he calls Tawutisâ, and speaks of his mother (Mâtru) in it, who had now become a deva by the changing of her sex."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Compare the account of the Arhat’s conveyance of the artist to the Tushita heaven in chap. v.",
            "The first expression here is more comprehensive."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Anuruddha was a first cousin of Śâkyamuni, being the son of his uncle Amṛitodana.",
            "He is often mentioned in the account we have of Buddha’s last moments.",
            "His special gift was the divyachakshus or ‘heavenly eye,’ the first of the six abhijñâs or ‘supernatural talents,’ the faculty of comprehending in one instantaneous view, or by intuition, all beings in all worlds.",
            "‘He could see,’ says Hardy, M. B., p. 232, ‘all things in 100,000 sakvalas as plainly as a mustard seed held in the hand.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Eitel gives the name Utpala with the same Chinese phonetisation as in the text, but not as the name of any bhikshuṇi.",
            "The Sanskrit word, however, is explained by ‘blue lotus flowers;’ and Hsüan-chwang calls her the nun ‘Lotus- flower colour (蓮花色);’—the same as Hardy’s Upulwan and Uppalawarnâ."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Perhaps we should read here ‘to see Buddha,’ and then ascribe the transformation to the nun herself.",
            "It depends on the punctuation which view we adopt and in the structure of the passage, there is nothing to indicate that the stop should be made before or after ‘Buddha.’",
            "And the one view is as reasonable, or rather as unreasonable, as the other."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘A holy king who turns the wheel;’ that is, the military conqueror and monarch of the whole or part of a universe.",
            "‘The symbol’ says Eitel (p. 142), ‘of such a king is the chakra or wheel, for when he ascends the throne, a chakra falls from heaven, indicating by its material (gold, silver, copper, or iron) the extent and character of his reign.",
            "The office, however, of the highest Chakravartti, who hurls his wheel among his enemies, is inferior to the peaceful mission of a Buddha, who meekly turns the wheel of the Law, and conquers every universe by his teaching.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This was Brahma, the first person of the Brahmanical Trimurti, adopted by Buddhism, but placed in an inferior position, and surpassed by every Buddhist saint who attains to bodhi."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, p. 30."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, p. 19."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A common name for the earth below, where, on digging, water is found."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The height is given as thirty chow, the chow being the distance from the elbow to the finger-tip, which is variously estimated."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A note of Mr. Beal says on this:—‘General Cunningham, who visited the spot (1862), found a pillar, evidently of the age of Aśoka, with a well-carved elephant on the top, which, however, was minus trunk and tail.",
            "He supposes this to be the pillar seen by Fâ-hien, who mistook the top of it for a lion.",
            "It is possible such a mistake may have been made, as in the account of one of the pillars at Śrâvâsti, Fâ-hien says an ox formed the capital, whilst Hsüan-chwang calls it an elephant (p. 19, Arch. Survey).’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "That is, in niches on the sides.",
            "The pillar or column must have been square."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Equivalent to ‘all through.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Has always been translated ‘heretical teachers;’ but I eschew the terms heresy and heretical.",
            "The parties would not be Buddhists of any creed or school, but Brahmans or of some other false doctrine, as Fâ-hien deemed it.",
            "The Chinese term means ‘outside’ or ‘foreign;’—in Pâli, añña-titthiyâ,=‘those belonging to another school.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See above, p. 39."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "These three predecessors of Śâkyamuni were the three Buddhas of the present or Mahâ-bhadra Kalpa, of which he was the fourth, and Maitreya is to be the fifth and last.",
            "They were: (1) Krakuchanda (Pâli, Kakusanda), ‘he who readily solves all doubts;’ a scion of the Kaśyapa family.",
            "Human life reached in his time 40,000 years, and so many persons were converted by him.",
            "(2) Kanakamuni (Pâli, Konâgamana), ‘body radiant with the colour of pure gold;’ of the same family.",
            "Human life reached in his time 30,000 years, and so many persons were converted by him.",
            "(3) Kaśyapa (Pâli, Kassapa), ‘swallower of light.’",
            "Human life reached in his time 20,000 years, and so many persons were converted by him.",
            "See Eitel, under the several names; Hardy’s M. B., pp. 95-97; and Davids’ ‘Buddhist Birth Stories,’ p. 51."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "That is, walked in meditation.",
            "Such places are called Chaṅkramaṇa (Pâli, Chankama); promenades or corridors connected with a monastery, made sometimes with costly stones, for the purpose of peripatetic meditation.",
            "The ‘sitting’ would be not because of weariness or for rest, but for meditation. E. H., p. 144."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, p. 11."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The character in my Corean copy is 虵, which must be a mistake for the 蛇 of the Chinese editions.",
            "Otherwise, the meaning would be ‘a small medusa.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The reading here seems to me a great improvement on that of the Chinese editions, which means ‘Fire Limit.’",
            "Buddha, it is said, 本 converted this demon, which Chinese character Beal rendered at first by ‘in one of his incarnations;’ and in his revised version he has ‘himself.’",
            "The difference between Fâ-hien’s usage of 本 and 昔 throughout his narrative is quite marked.",
            "本 always refers to the doings of Śâkyamuni; 昔, ‘formerly,’ is often used of him and others in the sense of ‘in a former age or birth.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See Hardy, M. B., p. 194:—‘As a token of the giving over of the garden, the king poured water upon the hands of Buddha; and from this time it became one of the principal residences of the sage.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This would seem to be absurd; but the writer evidently intended to convey the idea that there was something mysterious about the number of the topes."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, p. 40."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This seems to be the meaning.",
            "The bodies of the monks are all burned.",
            "Hardy’s E. M., pp. 322-324."
          ]
        }
      ]
    }
  ]
}
