{
  "title": "CHAPTER XVIII.",
  "subtitle": "KANYÂKUBJA, OR CANOUGE. BUDDHA’S PREACHING.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FÂ-HIEN Stayed at the Dragon vihâra till after the summer retreat[1], and then, travelling to the south-east for seven yojanas, he arrived at the city of Kanyâkubja[2], lying along the Ganges[3].",
          "There are two monasteries in it, the inmates of which are students of the hînayâna.",
          "At a distance from the city of six or seven le, on the west, on the northern bank of the Ganges, is a place where Buddha preached the Law to his disciples.",
          "It has been handed down that his subjects of discourse were such as ‘The bitterness and vanity (of life) as impermanent and uncertain,’ and that ‘The body is as a bubble or foam on the water.’",
          "At this spot a tope was erected, and still exists."
        ]
      },
      {
        "sentences": [
          "Having crossed the Ganges, and gone south for three yojanas, (the travellers) arrived at a village named Â-le[4], containing places where Buddha preached the Law, where he sat, and where he walked, at all of which topes have been built."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "We are now, probably, in 405."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Canouge, the latitude and longitude of which have been given in a previous note.",
            "The Sanskrit name means ‘the city of humpbacked maidens;’ with reference to the legend of the hundred daughters of king Brahma-datta, who were made deformed by the curse of the ṛishi Mahâ-vṛiksha, whose overtures they had refused. E. H., p. 51."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Gaṅgâ, explained by ‘Blessed water,’ and ‘Come from heaven to earth.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This village (the Chinese editions read ‘forest’) has hardly been clearly identified."
          ]
        }
      ]
    }
  ]
}
