{
  "title": "CHAPTER XXXVIII.",
  "subtitle": "AT CEYLON. RISE OF THE KINGDOM. FEATS OF BUDDHA. TOPES AND MONASTERIES. STATUE OF BUDDHA IN JADE. BO TREE. FESTIVAL OF BUDDHA’S TOOTH.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "THE country originally had no human inhabitants[1], but was occupied only by spirits and nâgas, with which merchants of various countries carried on a trade.",
          "When the trafficking was taking place, the spirits did not show themselves.",
          "They simply set forth their precious commodities, with labels of the price attached to them; while the merchants made their purchases according to the price; and took the things away."
        ]
      },
      {
        "sentences": [
          "Through the coming and going of the merchants (in this way), when they went away, the people of (their) various countries heard how pleasant the land was, and flocked to it in numbers till it became a great nation.",
          "The (climate) is temperate and attractive, without any difference of summer and winter.",
          "The vegetation is always luxuriant.",
          "Cultivation proceeds whenever men think fit: there are no fixed seasons for it."
        ]
      },
      {
        "sentences": [
          "When Buddha came to this country[2], wishing to transform the wicked nâgas, by his supernatural power he planted one foot at the north of the royal city, and the other on the top of a mountain[3], the two being fifteen yojanas apart.",
          "Over the footprint at the north of the city the king built a large tope, 400 cubits high, grandly adorned with gold and silver, and finished with a combination of all the precious substances.",
          "By the side of the tope he further built a monastery, called the Abhayagiri[4], where there are (now) five thousand monks.",
          "There is in it a hall of Buddha, adorned with carved and inlaid work of gold and silver, and rich in the seven precious substances, in which there is an image (of Buddha) in green jade, more than twenty cubits in height, glittering all over with those substances, and having an appearance of solemn dignity which words cannot express.",
          "In the palm of the right hand there is a priceless pearl.",
          "Several years had now elapsed since Fâ-hien left the land of Han; the men with whom he had been in intercourse had all been of regions strange to him; his eyes had not rested on an old and familiar hill or river, plant or tree: his fellow-travellers, moreover, had been separated from him, some by death, and others flowing off in different directions; no face or shadow was now with him but his own, and a constant sadness was in his heart.",
          "Suddenly (one day), when by the side of this image of jade, he saw a merchant presenting as his offering a fan of white silk[5]; and the tears of sorrow involuntarily filled his eyes and fell down."
        ]
      },
      {
        "sentences": [
          "A former king of the country had sent to Central India and got a slip of the patra tree[6], which he planted by the side of the hall of Buddha, where a tree grew up to the height of about 200 cubits.",
          "As it bent on one side towards the south-east, the king, fearing it would fall, propped it with a post eight or nine spans round.",
          "The tree began to grow at the very heart of the prop, where it met (the trunk); (a shoot) pierced through the post, and went down to the ground, where it entered and formed roots, that rose (to the surface) and were about four spans round.",
          "Although the post was split in the middle, the outer portions kept hold (of the shoot), and people did not remove them.",
          "Beneath the tree there has been built a vihâra, in which there is an image (of Buddha) seated, which the monks and commonalty reverence and look up to without ever becoming wearied.",
          "In the city there has been reared also the vihâra of Buddha's tooth, on which, as well as on the other, the seven precious substances have been employed."
        ]
      },
      {
        "sentences": [
          "The king practises the Brahmanical purifications, and the sincerity of the faith and reverence of the population inside the city are also great.",
          "Since the establishment of government in the kingdom there has been no famine or scarcity, no revolution or disorder.",
          "In the treasuries of the monkish communities there are many precious stones, and the priceless maṇis.",
          "One of the kings (once) entered one of those treasuries, and when he looked all round and saw the priceless pearls, his covetous greed was excited, and he wished to take them to himself by force.",
          "In three days, however, he came to himself, and immediately went and bowed his head to the ground in the midst of the monks, to show his repentance of the evil thought.",
          "As a sequel to this, he informed the monks (of what had been in his mind), and desired them to make a regulation that from that day forth the king should not be allowed to enter the treasury and see (what it contained), and that no bhikshu should enter it till after he had been in orders for a period of full forty years[7]."
        ]
      },
      {
        "sentences": [
          "In the city there are many Vaiśya elders and Sabæan[8] merchants, whose houses are stately and beautiful.",
          "The lanes and passages are kept in good order.",
          "At the heads of the four principal streets there have been built preaching halls, where, on the eighth, fourteenth, and fifteenth days of the month, they spread carpets, and set forth a pulpit, while the monks and commonalty from all quarters come together to hear the Law.",
          "The people say that in the kingdom there may be altogether sixty thousand monks, who get their food from their common stores.",
          "The king, besides, prepares elsewhere in the city a common supply of food for five or six thousand more.",
          "When any want, they take their great bowls, and go (to the place of distribution), and take as much as the vessels will hold, all returning with them full."
        ]
      },
      {
        "sentences": [
          "The tooth of Buddha is always brought forth in the middle of the third month.",
          "Ten days before hand the king grandly caparisons a large elephant, on which he mounts a man who can speak distinctly, and is dressed in royal robes, to beat a large drum, and make the following proclamation:—‘The Bodhisattva, during three Asaṅkhyeya-kalpas[9], manifested his activity, and did not spare his own life. He gave up kingdom, city, wife, and son; he plucked out his eyes and gave them to another[10]; he cut off a piece of his flesh to ransom the life of a dove; he cut off his head and gave it as an alms[11]; he gave his body to feed a starving tigress; he grudged not his marrow and brains. In many such ways as these did he undergo pain for the sake of all living. And so it was, that, having become Buddha, he continued in the world for forty-five years, preaching his Law, teaching and transforming, so that those who had no rest found rest, and the unconverted were converted. When his connexion with the living was completed[12], he attained to pari-nirvâṇa (and died). Since that event, for 1497 years, the light of the world has gone out[13], and all living beings have had long-continued sadness. Behold! ten days after this, Buddha’s tooth will be brought forth, and taken to the Abhayagiri-vihâra. Let all and each, whether monks or laics, who wish to amass merit for themselves, make the roads smooth and in good condition, grandly adorn the lanes and by-ways, and provide abundant store of flowers and incense to be used as offerings to it.’"
        ]
      },
      {
        "sentences": [
          "When this proclamation is over, the king exhibits, so as to line both sides of the road, the five hundred different bodily forms in which the Bodhisattva has in the course of his history appeared:—here as Sudâna[14], there as Sâma[15]; now as the king of elephants, and then as a stag or a horse[16].",
          "All these figures are brightly coloured and grandly executed, looking as if they were alive.",
          "After this the tooth of Buddha is brought forth, and is carried along in the middle of the road.",
          "Everywhere on the way offerings are presented to it, and thus it arrives at the hall of Buddha in the Abhayagiri-vihâra.",
          "There monks and laics are collected in crowds.",
          "They burn incense, light lamps, and perform all the prescribed services, day and night without ceasing, till ninety days have been completed, when (the tooth) is returned to the vihâra within the city.",
          "On fast-days the door of that vihâra is opened, and the forms of ceremonial reverence are observed according to the rules."
        ]
      },
      {
        "sentences": [
          "Forty le to the east of the Abhayagiri-vihâra there is a hill, with a vihâra on it, called the Chaitya[17] where there may be 2000 monks.",
          "Among them there is a Śramaṇa of great virtue, named Dharma-gupta[18], honoured and looked up to by all the kingdom.",
          "He has lived for more than forty years in an apartment of stone, constantly showing such gentleness of heart, that he has brought snakes and rats to stop together in the same room, without doing one another any harm."
        ]
      }
    ]
  },
  "footnotes": [
        {
      "paragraphs": [
        {
          "sentences": [
            "It is desirable to translate 人民, for which ‘inhabitants’ or ’people’ is elsewhere sufficient, here by ‘human inhabitants.’",
            "According to other accounts Singhala was originally occupied by Râkshasas or Rakshas, ‘demons who devour men,’ and ‘beings to be feared,’ monstrous cannibals or anthropophagi, the terror of the shipwrecked mariner.",
            "Our author’s ‘spirits’ (鬼神) were of a gentler type.",
            "His dragons or nâgas have come before us again and again."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "That Śâkyamuni ever visited Ceylon is to me more than doubtful.",
            "Hardy, in M, B., pp. 207-213, has brought together the legends of three visits,—in the first, fifth, and eighth years of his Buddhaship.",
            "It is plain, however, from Fâ-hien’s narrative, that in the beginning of our fifth century, Buddhism prevailed throughout the island.",
            "Davids in the last chapter of his ‘Buddhism’ ascribes its introduction to one of Aśoka’s missions, after the Council of Patna, under his son Mahinda, when Tissa, ‘the delight of the gods,’ was king (B.C. 250-230)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This would be what is known as ‘Adam’s peak,’ having, according to Hardy (pp. 211, 212, notes), the three names of Selesumano, Samastakûta, and Samanila.",
            "‘There is an indentation on the top of it,’ a superficial hollow, 5 feet 3¾ inches long, and about 2½ feet wide.",
            "The Hindus regard it as the footprint of Śiva; the Mohammedans, as that of Adam; and the Buddhists, as in the text,—as having been made by Buddha."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Meaning ‘The Fearless Hill.’",
            "There is still the Abhayagiri tope, the highest in Ceylon, according to Davids, 250 feet in height, and built about B.C. 90, by Waṭṭa Gamiṇi, in whose reign, about 160 years after the Council of Patna, and 330 years after the death of Śâkyamuni, the Tripiṭaka was first reduced to writing in Ceylon;—‘Buddhism,’ p. 234."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "We naturally suppose that the merchant-offerer was a Chinese, as indeed the Chinese texts say, and the fan such as Fâ-hien had seen and used in his native land."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This should be the pippala, or bodhidruma, generally spoken of, in connexion with Buddha, as the Bo tree, under which he attained to the Buddhaship.",
            "It is strange our author should have confounded them as he seems to do.",
            "In what we are told of the tree here, we have, no doubt, his account of the planting, growth, and preservation of the famous Bo tree, which still exists in Ceylon.",
            "It has been stated in a previous note that Aśoka’s son, Mahinda, went as the apostle of Buddhism to Ceylon.",
            "By-and-by he sent for his sister Sanghamittâ, who had entered the order at the same time as himself, and whose help was needed, some of the king’s female relations having signified their wish to become nuns.",
            "On leaving India, she took with her a branch of the sacred Bo tree at Buddha Gayâ, under which Šâkyamuni had become Buddha.",
            "Of how the tree has grown and still lives we have an account in Davids’ ‘Buddhism.’",
            "He quotes the words of Sir Emerson Tennent, that it is ‘the oldest historical tree in the world;’ but this must be denied if it be true, as Eitel says, that the tree at Buddha Gayâ, from which the slip that grew to be this tree was taken more than 2000 years ago, is itself still living in its place.",
            "We might conclude that Fâ-hien, when in Ceylon, heard neither of Mahinda nor Sanghamittâ."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Compare what is said in chap. xvi, about the inquiries made at monasteries as to the standing of visitors in the monkhood, and duration of their ministry."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The phonetic values of the two Chinese characters here are in Sanskrit sâ; and vâ, bo or bhâ.",
            "‘Sabæan’ is Mr. Beal’s reading of them, probably correct.",
            "I suppose the merchants were Arabs, forerunners of the so-called Moormen, who still form so important a part of the mercantile community in Ceylon."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A Kalpa, we have seen, denotes a great period of time; a period during which a physical universe is formed and destroyed.",
            "Asaṅkhyeya denotes the highest sum for which a conventional term exists;—according to Chinese calculations equal to one followed by seventeen ciphers; according to Thibetan and Singhalese, equal to one followed by ninety-seven ciphers.",
            "Every Mahâ-kalpa consists of four Asaṅkhyeya-kalpas.",
            "Eitel, p. 15."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See chapter ix."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See chapter xi."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "He had been born in the Śakya house, to do for the world what the character of all his past births required, and he had done it."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "They could no more see him, the World-honoured one.",
            "Compare the Sacred Books of the East, vol. xi, Buddhist Suttas, pp. 89, 121, and note on p. 89."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Sudâna or Sudatta was the name of the Bodhisattva in the birth which preceded his appearance as Śâkyamuni or Gotama, when he became the Supreme Buddha.",
            "This period is known as the Vessantara Jâtaka, of which Hardy, M. B., pp. 1 16-124, gives a long account; see also ‘Buddhist Birth Stories,’ the Nidâna Kathâ, p. 158.",
              "In it, as Sudâna, he fulfilled ‘the Perfections,’ his distinguishing attribute being entire self-renunciation and alms-giving, so that in the Nidâna Kathâ he is made to say (‘Buddhist Birth Stories,’ p. 158):—"
          ]
        },
        {
          "sentences": [
            "‘This earth, unconscious though she be, and ignorant of joy or grief,\nEven she by my free-giving's mighty power was shaken seven times.’"
          ]
        },
        {
          "sentences": [
            "Then, when he passed away, he appeared in the Tushita heaven, to enter in due time the womb of Mahâ-mâyâ, and be born as Śâkyamuni."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "I take the name Sâma from Beal’s revised version.",
            "He says in a note that the Sama Jâtaka, as well as the Vessantara, is represented in the Sâñchi sculptures.",
            "But what the Sâma Jâtaka was I do not yet know.",
            "But adopting this name, the two Chinese characters in the text should be translated ‘the change into Sâma.’",
            "Rémusat gives for them, ‘la transformation en éclair;’ Beal, in his first version, ‘his appearance as a bright flash of light;’ Giles, ‘as a flash of lightning;’ my own first version was ‘as the changing flashes of lightning.’",
            "Julien’s Méthode does not give the phonetic value in Sanskrit of 睒."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In an analysis of the number of times and the different forms in which Śâkyamuni had appeared in his Jâtaka births, given by Hardy (M. B., p. 100), it is said that he had appeared six times as an elephant; ten times as a deer; and four times as a horse."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Chaitya is a general term designating all places and objects of religious worship which have a reference to ancient Buddhas, and including therefore Stûpas and temples as well as sacred relics, pictures, statues, &c.",
            "It is defined as ‘a fane,’ ‘a place for worship and presenting offerings.’",
            "Eitel, p. 141.",
            "The hill referred to is the sacred hill of Mihintale, about eight miles due east of the Bo tree;—Davids’ Buddhism, pp. 230, 231."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Eitel says (p. 31): ‘A famous ascetic, the founder of a school, which flourished in Ceylon, A.D. 400.’",
            "But Fâ-hien gives no intimation of Dharma-gupta’s founding a school."
          ]
        }
      ]
    }
  ]
}
