{
  "title": "CHAPTER XXVII.",
  "subtitle": "PÂṬALIPUTTRA OR PATNA, IN MAGADHA. KING AŚOKA’S SPIRIT-BUILT PALACE AND HALLS. THE BUDDHIST BRAHMAN, RÂDHA-SÂMI. DISPENSARIES AND HOSPITALS.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "HAVING crossed the river, and descended south for a yojana, (the travellers) came to the town of Pâṭaliputtra[1], in the kingdom of Magadha, the city where king Aśoka[2] ruled.",
          "The royal palace and halls in the midst of the city, which exist now as of old, were all made by spirits which he employed, and which piled up the stones, reared the walls and gates, and executed the elegant carving and inlaid sculpture-work,—in a way which no human hands of this world could accomplish."
        ]
      },
      {
        "sentences": [
          "King Aśoka had a younger brother who had attained to be an Arhat, and resided on Gṛidhra-kûṭa[3] hill, finding his delight in solitude and quiet.",
          "The king, who sincerely reverenced him, wished and begged him (to come and live) in his family, where he could supply all his wants.",
          "The other, however, through his delight in the stillness of the mountain, was unwilling to accept the invitation, on which the king said to him, ‘Only accept my invitation, and I will make a hill for you inside the city.’",
          "Accordingly, he provided the materials of a feast, called to him the spirits, and announced to them, ‘To-morrow you will all receive my invitation; but as there are no mats for you to sit on, let each one bring (his own seat).’",
          "Next day the spirits came, each one bringing with him a great rock, (like) a wall, four or five paces square, (for a seat).",
          "When their sitting was over, the king made them form a hill with the large stones piled on one another, and also at the foot of the hill, with five large square stones, to make an apartment, which might be more than thirty cubits long, twenty cubits wide, and more than ten cubits high."
        ]
      },
      {
        "sentences": [
          "In this city there had resided a great Brahman[4], named Râdha-sâmi[5], a professor of the mahâyâna, of clear discernment and much wisdom, who understood everything, living by himself in spotless purity.",
          "The king of the country honoured and reverenced him, and served him as his teacher.",
          "If he went to inquire for and greet him, the king did not presume to sit down alongside of him; and if, in his love and reverence, he took hold of his hand, as soon as he let it go, the Brahman made haste to pour water on it and wash it.",
          "He might be more than fifty years old, and all the kingdom looked up to him.",
          "By means of this one man, the Law of Buddha was widely made known, and the followers of other doctrines did not find it in their power to persecute the body of monks in any way."
        ]
      },
      {
        "sentences": [
          "By the side of the tope of Aśoka, there has been made a mahâyâna monastery, very grand and beautiful; there is also a hînayâna one; the two together containing six hundred or seven hundred monks.",
          "The rules of demeanour and the scholastic arrangements[6] in them are worthy of observation."
        ]
      },
      {
        "sentences": [
          "Shamans of the highest virtue from all quarters, and students, inquirers wishing to find out truth and the grounds of it, all resort to these monasteries.",
          "There also resides in this monastery a Brahman teacher, whose name also is Mañjuśrî[7], whom the Shamans of greatest virtue in the kingdom, and the mahâyâna Bhikshus honour and look up to."
        ]
      },
      {
        "sentences": [
          "The cities and towns of this country are the greatest of all in the Middle Kingdom.",
          "The inhabitants are rich and prosperous, and vie with one another in the practice of benevolence and righteousness.",
          "Every year on the eighth day of the second month they celebrate a procession of images.",
          "They make a four-wheeled car, and on it erect a structure of five storeys by means of bamboos tied together.",
          "This is supported by a king-post, with poles and lances slanting from it, and is rather more than twenty cubits high, having the shape of a tope.",
          "White and silk-like cloth of hair[8] is wrapped all round it, which is then painted in various colours.",
          "They make figures of devas, with gold, silver, and lapis lazuli grandly blended and having silken streamers and canopies hung out over them.",
          "On the four sides are niches, with a Buddha seated in each, and a Bodhisattva standing in attendance on him.",
          "There may be twenty cars, all grand and imposing, but each one different from the others.",
          "On the day mentioned, the monks and laity within the borders all come together; they have singers and skilful musicians; they pay their devotions with flowers and incense.",
          "The Brahmans come and invite the Buddhas to enter the city.",
          "These do so in order, and remain two nights in it.",
          "All through the night they keep lamps burning, have skilful music, and present offerings.",
          "This is the practice in all the other kingdoms as well.",
          "The Heads of the Vaiśya families in them establish in the cities houses for dispensing charity and medicines.",
          "All the poor and destitute in the country, orphans, widowers, and childless men, maimed people and cripples, and all who are diseased, go to those houses, and are provided with every kind of help, and doctors examine their diseases.",
          "They get the food and medicines which their cases require, and are made to feel at ease; and when they are better, they go away of themselves."
        ]
      },
      {
        "sentences": [
          "When king Aśoka destroyed the seven topes, (intending) to make eighty-four thousand[9], the first which he made was the great tope, more than three le to the south of this city.",
          "In front of this there is a footprint of Buddha, where a vihâra has been built.",
          "The door of it faces the north, and on the south of it there is a stone pillar, fourteen or fifteen cubits in circumference, and more than thirty cubits high, on which there is an inscription, saying, ‘Aśoka gave the jambudvîpa to the general body of all the monks, and then redeemed it from them with money. This he did three times[10].’",
          "North from the tope 300 or 400 paces, king Aśoka built the city of Ne-le[11].",
          "In it there is a stone pillar, which also is more than thirty feet high, with a lion on the top of it.",
          "On the pillar there is an inscription recording the things which led to the building of Ne-le, with the number of the year, the day, and the month."
        ]
      }
    }
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "The modern Patna, lat. 25° 28' N., lon. 85° 15' E.",
            "The Sanskrit name means ‘The city of flowers.’",
            "It is the Indian Florence."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 5, page 31.",
            "Aśoka transferred his court from Râjagṛiha to Pâṭaliputtra, and there, in the eighteenth year of his reign, he convoked the third Great Synod,—according, at least, to southern Buddhism.",
            "It must have been held a few years before B.C. 250; Eitel says in 246."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The Vulture-hill;’ so called because Mâra, according to Buddhist tradition, once assumed the form of a vulture on it to interrupt the meditation of Ânanda; or, more probably, because it was a resort of vultures.",
            "It was near Râjagṛiha, the earlier capital of Aśoka, so that Fâ-hien connects a legend of it with his account of Patna.",
            "It abounded in caverns, and was famous as a resort of ascetics."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A Brahman by caste, but a Buddhist in faith."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "So, by the help of Julian’s ‘Méthode,’ I transliterate the Chinese characters 羅太私迷.",
            "Beal gives Râdhasvâmi, his Chinese text having a 婆 between 私 and 迷.",
            "I suppose the name was Râdhasvâmi or Râdhasâmi."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "庠序, the names of two kinds of schools, often occurring in the Lî Kî and Mencius.",
            "Why should there not have been schools in those monasteries in India as there were in China? Fâ-hien himself grew up with other boys in a monastery, and no doubt had to ‘go to school.’",
            "And the next sentence shows us there might be schools for more advanced students as well as for the Śrâmaṇeras."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 1, page 4.",
            "It is perhaps with reference to the famous Bodhisattva that the Brahman here is said to be ‘also’ named Mañjuśrî."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "? Cashmere cloth."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 1, page 69."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "We wish that we had more particulars of this great transaction, and that we knew what value in money Aśoka set on the whole world.",
            "It is to be observed that he gave it to the monks, and did not receive it from them.",
            "Their right was from him, and he bought it back.",
            "He was the only ‘Power’ that was."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "We know nothing more of Ne-le.",
            "It could only have been a small place; an outpost for the defence of Pâṭaliputtra."
          ]
        }
      ]
    }
  ]
}
