{
  "title": "CHAPTER XXXIV.",
  "subtitle": "ON THE WAY BACK TO PATNA. VÂRÂṆASÎ, OR BENÂRES. ŚÂKYAMUNI’S FIRST DOINGS AFTER BECOMING BUDDHA.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FÂ-HIEN[1] returned (from here) towards Pâṭaliputtra[2], keeping along the course of the Ganges and descending in the direction of the west.",
          "After going ten yojanas he found a vihara, named ‘The Wilderness,’—a place where Buddha had dwelt, and where there are monks now."
        ]
      },
      {
        "sentences": [
          "Pursuing the same course, and going still to the west, he arrived, after twelve yojanas, at the city of Vârâṇasî[3] in the kingdom of Kâśî.",
          "Rather more than ten le to the north-east of the city, he found the vihara in the park of ‘The ṛishi’s Deer-wild.’[4]",
          "In this park there formerly resided a Pratyeka Buddha[5], with whom the deer were regularly in the habit of stopping for the night.",
          "When the World-honoured one was about to attain to perfect Wisdom, the devas sang in the sky, ‘The son of king Śuddhodana, having quitted his family and studied the Path (of Wisdom)[6], will now in seven days become Buddha.’",
          "The Pratyeka Buddha heard their words, and immediately attained to nirvâṇa; and hence this place was named ‘The Park of the ṛishi’s Deer-wild.’[7]",
          "After the World-honoured one had attained to perfect Wisdom, men built the vihâra in it."
        ]
      },
      {
        "sentences": [
          "Buddha wished to convert Kauṇḍinya[8] and his four companions; but they, (being aware of his intention), said to one another, ‘This Śramaṇa Gotama[9] for six years continued in the practice of painful austerities, eating daily (only) a single hemp-seed, and one grain of rice, without attaining to the Path (of Wisdom); how much less will he do so now that he has entered (again) among men, and is giving the reins to (the indulgence of) his body, his speech, and his thoughts! What has he to do with the Path (of Wisdom)? To-day, when he comes to us, let us be on our guard not to speak with him.’",
          "At the places where the five men all rose up, and respectfully saluted (Buddha), when he came to them; where, sixty paces north from this, he sat with his face to the east, and first turned the wheel of the Law, converting Kauṇḍinya and the four others; where, twenty paces further to the north, he delivered his prophecy concerning Maitreya[10]; and where, at a distance of fifty paces to the south, the dragon Elâpattra[11] asked him, ‘When shall I get free from this nâga body?’—at all these places topes were reared, and are still existing.",
          "In (the park) there are two monasteries, in both of which there are monks residing."
        ]
      },
      {
        "sentences": [
          "When you go north-west from the vihâra of the Deer-wild park for thirteen yojanas, there is a kingdom named Kauśâmbî[12].",
          "Its vihâra is named Ghochiravana[13]—a place where Buddha formerly resided.",
          "Now, as of old, there is a company of monks there, most of whom are students of the hînayâna."
        ]
      },
      {
        "sentences": [
          "East from (this), when you have travelled eight yojanas, is the place where Buddha converted[14] the evil demon.",
          "There, and where he walked (in meditation) and sat at the place which was his regular abode, there have been topes erected.",
          "There is also a monastery, which may contain more than a hundred monks."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Fâ-hien is here mentioned singly, as in the account of his visit to the cave on Gṛidhra-kûṭa.",
            "I think that Tâo-ching may have remained at Patna after their first visit to it."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 1, p. 77."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The city surrounded by rivers;’ the modern Benâres, lat. 25° 23' N., lon. 83° 5' E."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The ṛishi,’ says Eitel, ‘is a man whose bodily frame has undergone a certain transformation by dint of meditation and asceticism, so that he is, for an indefinite period, exempt from decrepitude, age, and death. As this period is believed to extend far beyond the usual duration of human life, such persons are called, and popularly believed to be, immortals’",
            "Ṛishis are divided into various classes; and ṛishi-ism is spoken of as a seventh path of transrotation, and ṛishis are referred to as the seventh class of sentient beings.",
            "Tâoism, as well as Buddhism, has its Seen jin."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, p. 40."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 4, p. 64."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "For another legend about this park, and the identification with ‘a fine wood’ still existing, see note in Beal's first version, p. 135."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A prince of Magadha and a maternal uncle of Śâkyamuni, who gave him the name of Ajñâta, meaning automat; and hence he often appears as Ajñâta Kauṇḍinya.",
            "He and his four friends had followed Śâkyamuni into the Uruvilvâ desert, sympathising with him in the austerities he endured, and hoping that they would issue in his Buddhaship.",
            "They were not aware that that issue had come; which may show us that all the accounts in the thirty-first chapter are merely descriptions, by means of external imagery, of what had taken place internally.",
            "The kingdom of nirvâṇa had come without observation.",
            "These friends knew it not; and they were offended by what they considered Śâkyamuni’s failure, and the course he was now pursuing.",
            "See the account of their conversion in M. B., p. 186."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This is the only instance in Fâ-hien’s text where the Bodhisattva or Buddha is called by the surname ‘Gotama.’",
            "For the most part our traveller uses Buddha as a proper name, though it properly means ‘The Enlightened.’",
            "He uses also the combinations ‘Śâkya Buddha,’=‘The Buddha of the Śâkya tribe,’ and ‘Śâkyamuni,’ = ‘The Śâkya sage.’",
            "This last is the most common designation of the Buddha in China, and to my mind best combines the characteristics of a descriptive and a proper name.",
            "Among other Buddhistic peoples ‘Gotama’ and ‘Gotama Buddha’ are the more frequent designations.",
            "It is not easy to account for the rise of the surname Gotama in the Śâkya family, as Oldenberg acknowledges.",
            "He says that ‘the Śâkyas, in accordance with the custom of Indian noble families, had borrowed it from one of the ancient Vedic bard families.’",
            "Dr. Davids (‘Buddhism,’ p. 27) says: ‘The family name was certainly Gautama,’ adding in a note, ‘It is a curious fact that Gautama is still the family name of the Rajput chiefs of Nagara, the village which has been identified with Kapilavastu.’",
            "Dr. Eitel says that ‘Gautama was the sacerdotal name of the Śâkya family, which counted the ancient ṛishi Gautama among its ancestors.’",
            "When we proceed, however, to endeavour to trace the connexion of that Brahmanical ṛishi with the Śâkya house, by means of 1323, 1468, 1469, and other historical works in Nanjio’s Catalogue, we soon find that Indian histories have no surer foundation than the shifting sand;—see E. H., on the name Śâkya, pp. 108, 109.",
            "We must be content simply to accept Gotama as one of the surnames of the Buddha with whom we have to do."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, p. 25.",
            "It is there said that the prediction of Maitreya’s succession to the Buddhaship was made to him in the Tushita heaven.",
            "Was there a repetition of it here in the Deer-park, or was a prediction now given concerning something else?"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Nothing seems to be known of this nâga but what we read here."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Identified by some with Kusia, near Kurrah (lat. 25° 41' N., lon. 81° 27' E.); by others with Kosam on the Jumna, thirty miles above Allahabad.",
            "See E. H., p. 55."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Ghochira was the name of a Vaiśya elder, or head, who presented a garden and vihâra to Buddha.",
            "Hardy (M. B., p. 356) quotes a statement from a Singhalese authority that Śâkyamuni resided here during the ninth year of his Buddhaship."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Dr. Davids thinks this may refer to the striking and beautiful story of the conversion of the Yakkha Âḷavaka, as related in the Uragavagga, Âḷavakasutta, pp. 29-31 (Sacred Books of the East, vol. x, part ii)."
          ]
        }
      ]
    }
  ]
}
