{
  "title": "CHAPTER XII.",
  "subtitle": "PURUSHAPURA, OR PESHÂWUR. PROPHECY ABOUT KING KANISHKA AND HIS TOPE. BUDDHA’S ALMS-BOWL. DEATH OF HWUY-YING.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "GOING southwards from Gândhâra, (the travellers) in four days arrived at the kingdom of Purushapura[1].",
          "Formerly, when Buddha was travelling in this country with his disciples, he said to Ânanda[2], ‘After my pari-nirvâṇa[3], there will be a king named Kanishka[4], who shall on this spot build a tope.’",
          "This Kanishka was afterwards born into the world; and (once), when he had gone forth to look about him, Śakra, Ruler of Devas, wishing to excite the idea in his mind, assumed the appearance of a little herd-boy, and was making a tope right in the way (of the king), who asked what sort of a thing he was making.",
          "The boy said, ‘I am making a tope for Buddha.’",
          "The king said, ‘Very good;’ and immediately, right over the boy's tope, he (proceeded to) rear another, which was more than four hundred cubits high, and adorned with layers of all the precious substances.",
          "Of all the topes and temples which (the travellers) saw in their journeyings, there was not one comparable to this in solemn beauty and majestic grandeur.",
          "There is a current saying that this is the finest tope in Jambudvîpa[5].",
          "When the king’s tope was completed, the little tope (of the boy) came out from its side on the south, rather more than three cubits in height."
        ]
      },
      {
        "sentences": [
          "Buddha’s alms-bowl is in this country.",
          "Formerly, a king of Yüeh-she[6] raised a large force and invaded this country, wishing to carry the bowl away.",
          "Having subdued the kingdom, as he and his captains were sincere believers in the Law of Buddha, and wished to carry off the bowl, they proceeded to present their offerings on a great scale.",
          "When they had done so to the Three Precious Ones, he made a large elephant be grandly caparisoned, and placed the bowl upon it.",
          "But the elephant knelt down on the ground, and was unable to go forward.",
          "Again he caused a four-wheeled waggon to be prepared in which the bowl was put to be conveyed away.",
          "Eight elephants were then yoked to it, and dragged it with their united strength; but neither were they able to go forward.",
          "The king knew that the time for an association between himself and the bowl had not yet arrived[7], and was sad and deeply ashamed of himself.",
          "Forthwith he built a tope at the place and a monastery, and left a guard to watch (the bowl), making all sorts of contributions."
        ]
      },
      {
        "sentences": [
          "There may be there more than seven hundred monks.",
          "When it is near midday, they bring out the bowl, and, along with the common people[8], make their various offerings to it, after which they take their midday meal.",
          "In the evening, at the time of incense, they bring the bowl out again[9].",
          "It may contain rather more than two pecks, and is of various colours, black predominating, with the seams that show its fourfold composition distinctly marked[10].",
          "Its thickness is about the fifth of an inch, and it has a bright and glossy lustre.",
          "When poor people throw into it a few flowers, it becomes immediately full, while some very rich people, wishing to make offering of many flowers, might not stop till they had thrown in hundreds, thousands, and myriads of bushels, and yet would not be able to fill it[11]."
        ]
      },
      {
        "sentences": [
          "Pâo-yun and Săng-king here merely made their offerings to the alms-bowl, and (then resolved to) go back.",
          "Hwuy-king, Hwuy-tah, and Tâo-ching had gone on before the rest to Nagâra[12], to make their offerings at (the places of) Buddha’s shadow, tooth, and the flat-bone of his skull.",
          "(There) Hwuy-king fell ill, and Tâo-ching remained to look after him, while Hwuy-tah came alone to Purushapura, and saw the others, and (then) he with Pâo-yun and Săng-king took their way back to the land of Ts’in.",
          "Hwuy-king[13] came to his end[14] in the monastery of Buddha’s alms-bowl, and on this Fâ-hien went forward alone towards the place of the flat-bone of Buddha’s skull."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "The modern Peshâwur, lat. 34° 8' N., lon. 71° 30' E."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A first cousin of Śâkyamuni, and born at the moment when he attained to Buddhaship.",
            "Under Buddha's teaching, Ânanda became an Arhat, and is famous for his strong and accurate memory; and he played an important part at the first council for the formation of the Buddhist canon.",
            "The friendship between Śâkyamuni and Ânanda was very close and tender; and it is impossible to read much of what the dying Buddha said to him and of him, as related in the Mahâ-pari-nirvâṇa Sûtra, without being moved almost to tears.",
            "Ânanda is to reappear on earth as Buddha in another Kalpa.",
            "See E. H., p. 9, and the Sacred Books of the East, vol. xi."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "On his attaining to nirvâṇa, Śâkyamuni became the Buddha, and had no longer to mourn his being within the circle of transmigration, and could rejoice in an absolute freedom from passion, and a perfect purity.",
            "Still he continued to live on for forty-five years, till he attained to pari-nirvâṇa, and had done with all the life of sense and society, and had no more exercise of thought.",
            "He died; but whether he absolutely and entirely ceased to be, in any sense of the word being, it would be difficult to say.",
            "Probably he himself would not and could not have spoken definitely on the point.",
            "So far as our use of language is concerned, apart from any assured faith in and hope of immortality, his pari-nirvâṇa was his death."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Kanishka appeared, and began to reign, early in our first century, about A.D. 10.",
            "He was the last of three brothers, whose original seat was in Yüeh-she, immediately mentioned, or Tukhâra.",
            "Converted by the sudden appearance of a saint, he became a zealous Buddhist, and patronised the system as liberally as Aśoka had done.",
            "The finest topes in the north-west of India are ascribed to him; he was certainly a great man and a magnificent sovereign."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Jambudvîpa is one of the four great continents of the universe, representing the inhabited world as fancied by the Buddhists, and so called because it resembles in shape the leaves of the jambu tree.",
            "It is south of mount Meru, and divided among four fabulous kings (E. H., p. 36).",
            "It is often used, as here perhaps, merely as the Buddhist name for India."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This king was perhaps Kanishka himself, Fâ-hien mixing up, in an inartistic way, different legends about him.",
            "Eitel suggests that a relic of the old name of the country may still exist in that of the Jats or Juts of the present day.",
            "A more common name for it is Tukhâra, and he observes that the people were the Indo-Scythians of the Greeks, and the Tartars of Chinese writers, who, driven on by the Huns (180 B.C.), conquered Transoxiana, destroyed the Bactrian kingdom (126 B.C.), and finally conquered the Punjâb, Cashmere, and great part of India, their greatest king being Kanishka (E. H., p. 152)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Watters, clearly understanding the thought of the author in this sentence, renders—‘his destiny did not extend to a connexion with the bowl;’ but the term ‘destiny’ suggests a controlling or directing power without.",
            "The king thought that his virtue in the past was not yet sufficient to give him possession of the bowl."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The text is simply ‘those in white clothes.’",
            "This may mean ‘the laity,’ or the ‘upâsakas;’ but it is better to take the characters in their common Chinese acceptation, as meaning ‘commoners,’ ‘men who have no rank.’",
            "See in Williams’ Dictionary under 白."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "I do not wonder that Rémusat should give for this—‘et s’en retournent après.’",
            "But Fâ-hien’s use of 儞 in the sense of ‘in the same way’ is uniform throughout the narrative."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Hardy’s M. B., p. 183, says:—‘The alms-bowl, given by Mahâbrahma, having vanished (about the time that Gotama became Buddha), each of the four guardian deities brought him an alms-bowl of emerald, but he did not accept them.",
            "They then brought four bowls made of stone, of the colour of the mung fruit; and when each entreated that his own bowl might be accepted, Buddha caused them to appear as if formed into a single bowl, appearing at the upper rim as if placed one within the other.’",
            "See the account more correctly given in the ‘Buddhist Birth Stories,’ p. 110."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Compare the narrative in Luke’s Gospel, xxi. 1-4."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See chapter viii."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This, no doubt, should be Hwuy-ying.",
            "King was at this time ill in Nagâra, and indeed afterwards he dies in crossing the Little Snowy Mountains; but all the texts make him die twice.",
            "The confounding of the two names has been pointed out by Chinese critics."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘Came to his end;’ i. e., according ‘to the test, proved the impermanence and uncertainty,’ namely, of human life.",
            "See Williams’ Dictionary under 常.",
            "The phraseology is wholly Buddhistic."
          ]
        }
      ]
    }
  ]
}
