{
  "title": "CHAPTER XXIV.",
  "subtitle": "WHERE BUDDHA FINALLY RENOUNCED THE WORLD, AND WHERE HE DIED.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "EAST from here four yojanas, there is the place where the heir-apparent sent back Chaṇḍaka, with his white horse[1]; and there also a tope was erected."
        ]
      },
      {
        "sentences": [
          "Four yojanas to the east from this, (the travellers) came to the Charcoal tope[2], where there is also a monastery."
        ]
      },
      {
        "sentences": [
          "Going on twelve yojanas, still to the east, they came to the city of Kuśanagara[3], on the north of which, between two trees[4], on the bank of the Nairañjana[5] river, is the place where the World-honoured one, with his head to the north, attained to pari-nirvâṇa (and died).",
          "There also are the places where Subhadra[6] the last (of his converts), attained to Wisdom (and became an Arhat); where in his coffin of gold they made offerings to the World-honoured one for seven days[7], where the Vajrapâṇi laid aside his golden club[8], and where the eight kings divided the relics (of the burnt body)[9]:—at all these places were built topes and monasteries, all of which are now existing."
        ]
      },
      {
        "sentences": [
          "In the city the inhabitants are few and far between, comprising only the families belonging to the (different) societies of monks."
        ]
      },
      {
        "sentences": [
          "Going from this to the south-east for twelve yojanas, they came to the place where the Lichchhavis[10] wished to follow Buddha to (the place of) his pari-nirvâṇa, and where, when he would not listen to them and they kept cleaving to him, unwilling to go away, he made to appear a large and deep ditch which they could not cross over, and gave them his alms-bowl, as a pledge of his regard, (thus) sending them back to their families.",
          "There a stone pillar was erected with an account of this event engraved upon it."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "This was on the night when Śâkyamuni finally left his palace and family to fulfil the course to which he felt that he was called.",
            "Chaṇḍaka, in Pâli Channa, was the prince’s charioteer, and in sympathy with him.",
            "So also was the white horse Kanthaka (Kanthakanam Aśvarâja), which neighed his delight till the devas heard him.",
            "See M. B., pp. 158-161, and Davids’ Manual, pp. 32, 33.",
            "According to ‘Buddhist Birth Stories,’ p. 87, the noble horse never returned to the city, but died of grief at being left by his master, to be reborn immediately in the Trayastriṃśas heaven as the deva Kanthaka!"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Beal and Giles call this the ‘Ashes’ tope.",
            "I also would have preferred to call it so; but the Chinese character is 炭, not 灰.",
            "Rémusat has ‘la tour des charbons.’",
            "It was over the place of Buddha’s cremation."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In Pâli Kusinârâ.",
            "It got its name from the Kuśa grass (the poa cynosuroides); and its ruins are still extant, near Kusiah, 180 N.W. from Patna; ‘about,’ says Davids, ‘120 miles N. N. E. of Benâres, and 80 miles due east of Kapilavastu.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Śâla tree, the Shorea robusta, which yields the famous teak wood."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Confounded, according to Eitel, even by Hsüan-chwang, with the Hiraṇyavatî, which flows past the city on the south."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A Brahman of Benâres, said to have been 120 years old, who came to learn from Buddha the very night he died.",
            "Ânanda would have repulsed him; but Buddha ordered him to be introduced; and then putting aside the ingenious but unimportant question which he propounded, preached to him the Law.",
            "The Brahman was converted and attained at once to Arhatship.",
            "Eitel says that he attained to nirvâṇa a few moments before Śâkyamuni; but see the full account of him and his conversion in ‘Buddhist Suttas,’ pp. 103-110."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Thus treating the dead Buddha as if he had been a Chakravartti king.",
            "Hardy’s M. B., p. 347, says:—‘For the place of cremation, the princes (of Kuśinâra) offered their own coronation-hall, which was decorated with the utmost magnificence, and the body was deposited in a golden sarcophagus.’",
            "See the account of a cremation which Fâ-hien witnessed in Ceylon, chap. xxxix."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The name Vajrapâṇi is explained as ‘he who holds in his hand the diamond club (or pestle=sceptre),’ which is one of the many names of Indra or Śakra.",
            "He therefore, that great protector of Buddhism, would seem to be intended here; but the difficulty with me is that neither in Hardy nor Rockhill, nor any other writer, have I met with any manifestation of himself made by Indra on this occasion.",
            "The princes of Kuśanagara were called mallas, ‘strong or mighty heroes;’ so also were those of Pâvâ and Vaiśâlî; and a question arises whether the language may not refer to some story which Fâ-hien had heard,—something which they did on this great occasion.",
            "Vajrapâṇi is also explained as meaning ‘the diamond mighty hero;’ but the epithet of ‘diamond’ is not so applicable to them as to Indra.",
            "The clause may hereafter obtain more elucidation."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Of Kuśanagara, Pâvâ, Vaiśâlî, and other kingdoms.",
            "Kings, princes, brahmans,—each wanted the whole relic; but they agreed to an eightfold division at the suggestion of the brahman Droṇa."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "These ‘strong heroes’ were the chiefs of Vaiśâlî, a kingdom and city, with an oligarchical constitution.",
            "They embraced Buddhism early, and were noted for their peculiar attachment to Buddha.",
            "The second synod was held at Vaiśâlî, as related in the next chapter.",
            "The ruins of the city still exist at Bassahar, north of Patna, the same, I suppose, as Besarh, twenty miles north of Hajipûr.",
            "See Beal’s Revised Version, p. lii."
          ]
        }
      ]
    }
  ]
}
