{
  "title": "CHAPTER I.",
  "subtitle": "FROM CH’ANG-GAN TO THE SANDY DESERT.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          {
            "legge": "FÂ-HIEN had been living in Ch’ang-gan[1].",
            "modern": "FǍXIǍN had been living in Cháng'ān[1]."
          },
          {
	    "legge": "Deploring the mutilated and imperfect state of the collection of the Books of Discipline, in the second year of the period Hwăng-che, being the Ke-hâe year of the cycle[2], he entered into an engagement with Hwuy-king, Tâo-ching, Hwuy-ying, and Hwuy-wei[3], that they should go to India and seek for the Disciplinary Rules[4].",
	    "modern": "Deploring the mutilated and imperfect state of the collection of the Books of Discipline, in the second year of the period Hóng shǐ, being the Ke-hâe year of the cycle[2], he entered into an engagement with Huìjǐng, Tâo-ching, Hwuy-ying, and Hwuy-wei[3], that they should go to India and seek for the Disciplinary Rules[4]."
	  }
        ]
      },
      {
        "sentences": [
          {
            "legge": "After starting from Ch’ang-gan, they passed through Lung[5], and came to the kingdom of K’een-kwei[6], where they stopped for the summer retreat[7].",
            "modern": "After starting from Cháng'ān, they passed through Lǒng[5], and came to the kingdom of Gānguī[6], where they stopped for the summer retreat[7]."
          },
          {
            "legge": "When that was over, they went forward to the kingdom of Now-t’an[8], crossed the mountain of Yang-low, and reached the emporium of Chang-yih[9].",
            "modern": "When that was over, they went forward to the kingdom of Rùtán[8], crossed the mountain of Yǎnglóu, and reached the emporium of Zhāngyè[9]."
          },
          "There they found the country so much disturbed that travelling on the roads was impossible for them.",
          "Its king, however, was very attentive to them, kept them (in his capital), and acted the part of their dânapati[10]."
        ]
      },
      {
        "sentences": [
          "Here they met with Che-yen, Hwuy-keen, Săng-shâo, Pâo-yun, and Săng-king[11]; and in pleasant association with them, as bound on the same journey with themselves, they passed the summer retreat (of that year)[12] together, resuming after it their travelling, and going on to T’un-hwang[13], (the chief town) in the frontier territory of defence extending for about 80 le from east to west, and about 40 from north to south.",
          "Their company, increased as it had been, halted there for some days more than a month, after which Fâ-hien and his four friends started first in the suite of an envoy[14], having separated (for a time) from Pâo-yun and his associates."
        ]
      },
      {
        "sentences": [
          "Le Hâo[15], the prefect of T’un-hwang, had supplied them with the means of crossing the desert (before them), in which there are many evil demons and hot winds.",
          "(Travellers) who encounter them perish all to a man.",
          "There is not a bird to be seen in the air above, nor an animal on the ground below.",
          "Though you look all round most earnestly to find where you can cross, you know not where to make your choice, the only mark and indication being the dry bones of the dead (left upon the sand)[16]."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            {
              "legge": "Ch’ang-gan is still the name of the principal district (and its city) in the department of Se-gan, Shen-se.",
              "modern": "Cháng'ān is still the name of the principal district (and its city) in the department of Se-gan, Shǎnxī."
            },
            "It had been the capital of the first empire of Han (B.C. 202-A.D. 24), as it subsequently was that of Suy (A.D. 589-618).",
            "The repair of the eastern Tsin, towards the close of which Fâ-hien lived, had its capital at or near Nan-king, and Ch’ang-gan was the capital of the principal of the three Ts’in kingdoms, which with many other minor ones, maintained a semi-independence of Tsin, their rulers sometimes even assuming the title of emperor."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The period Hwăng-che embraced from A.D. 399 to 414, being the greater portion of the reign of Yâo Hing of the After Ts’in, a powerful prince.",
            "He adopted Hwăng-che for the style of his reign in 399, and the cyclical name of that year was Kăng-tsze.",
            "It is not possible at this distance of time to explain, if it could be explained, how Fâ-hien came to say that Ke-hâe was the second year of the period.",
            "It seems most reasonable to suppose that he set out on his pilgrimage in A.D. 399, the cycle name of which was Ke-hâe, as 二, the second year, instead of 一, the first, might easily creep into the text.",
            "In ‘Memoirs of Eminent Monks’ it is said that our author started in the third year of the period Lung-gan of the eastern Tsin, which was A.D. 399."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "These, like Fâ-hien itself, are all what we might call ‘clerical’ names, appellations given to the parties as monks or śramaṇas."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Buddhist tripiṭaka or canon consists of three collections, containing, according to Eitel (p. 150), ‘doctrinal aphorisms (or statements, purporting to be from Buddha himself); works on discipline; and works on metaphysics:’—called sûtra, vinaya, and abhidharma; in Chinese, king (經), leŭh (律), and lun (論), or texts, laws or rules, and discussions. Dr. Rhys Davids objects to the designation of ‘metaphysics’ as used of the abhidharma works, saying that ‘they bear much more the relation to “dharma” which “by-law” bears to “law” than that which “metaphysics” bears to “physics” (Hibbert Lectures, p. 49).",
            "However this be, it was about the vinaya works that Fâ-hien was chiefly concerned.",
            "He wanted a good code of the rules for the government of ‘the Order’ in all its internal and external relations."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Lung embraced the western part of Shen-se and the eastern part of Kan-sŭh.",
            "The name remains in Lung Chow, in the extreme west of Shen-se."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "K’een-kwei was the second king of ‘the Western Ts’in.’",
            "His family was of northern or barbarous origin, from the tribe of the Seen-pe, with the surname of K’eih-fuh.",
            "The first king was Kwo-jin, and received his appointment from the sovereign of the chief Ts’in kingdom in 385.",
            "He was succeeded in 388 by his brother, the K’een-kwei of the text, who was very prosperous in 398, and took the title of king of Ts’in.",
            "Fâ-hien would find him at his capital, somewhere in the present department of Lan-chow, Kan-sŭh."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Under varshâs or varshâvasâna (Pâli, vassa; Spence Hardy, vass), Eitel (p. 163) says:—‘One of the most ancient institutions of Buddhist discipline, requiring all ecclesiastics to spend the rainy season in a monastery in devotional exercises.",
            "Chinese Buddhists naturally substituted the hot season for the rainy (from the 16th day of the 5th to the 15th day of the 9th Chinese month).’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "During the troubled period of the Tsin dynasty, there were five (usurping) Leang sovereignties in the western part of the empire (五凉).",
            "The name Leang remains in the department of Leang-chow in the northern part of Kan-sŭh.",
            "The ‘southern Leang’ arose in 397 under a T’ŭh-făh Wû-kû, who was succeeded in 399 by a brother, Le-luh-koo; and he again by his brother, the Now-t’an of the text, in 402, who was not yet king therefore when Fâ-hien and his friends reached his capital.",
            "How he is represented as being so may be accounted for in various ways, of which it is not necessary to write."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Chang-yih is still the name of a district in Kan-chow department, Kan-sŭh.",
            "It is a long way north and west from Lan-chow, and not far from the Great Wall.",
            "Its king at this time was, probably, Twan-yeh of ‘the northern Leang.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Dâna is the name for religious charity, the first of the six pâramitâs, or means of attaining to nirvâṇa; and a dânapati is ‘one who practises dâna and thereby crosses (越) the sea of misery.’",
            "It is given as ‘a title of honour to all who support the cause of Buddhism by acts of charity, especially to founders and patrons of monasteries;’—see Eitel, p. 29."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Of these pilgrims with their clerical names, the most distinguished was Pâo-yun, who translated various Sanskrit works on his return from India, of which only one seems to be now existing.",
            "He died in 449. See Nanjio’s Catalogue of the Tripiṭaka, col. 417."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This was the second summer since the pilgrims left Ch'ang-gan.",
            "We are now therefore, probably, in A.D. 400."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "T’un-hwang (lat. 39° 40' N.; lon. 94° 50' E.) is still the name of one of the two districts constituting the department of Gan-se, the most western of the prefectures of Kan-sŭh; beyond the termination of the Great Wall."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Who this envoy was, and where he was going, we do not know.",
            "The text will not admit of any other translation."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Le Hâo was a native of Lung-se, a man of learning, able and kindly in his government.",
            "He was appointed governor or prefect of T’un-hwang by the king of ‘the northern Leang,’ in 400; and there he sustained himself, becoming by and by ‘duke of western Leang,’ till he died in 417."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The river of sand;’ the great desert of Kobi or Gobi; having various other names.",
            "It was a great task which the pilgrims had now before them,—to cross this desert.",
            "The name of ‘river’ in the Chinese misleads the reader, and he thinks of the crossing it as of crossing a stream; but they had to traverse it from east to west.",
            "In his ‘Vocabulary of Proper Names,’ p. 23, Dr. Porter Smith says:—‘It extends from the eastern frontier of Mongolia, south-westward to the further frontier of Turkestan, to within six miles of Ilchî, the chief town of Khoten.",
            "It thus comprises some twenty-three degrees of longitude in length, and from three to ten degrees of latitude in breadth, being about 2,100 miles in its greatest length.",
            "In some places it is arable.",
            "Some idea may be formed of the terror with which this “Sea of Sand,” with its vast billows of shifting sands, is regarded, from the legend that in one of the storms 360 cities were all buried within the space of twenty-four hours.’",
            "See also Gilmour’s ‘Among the Mongols,’ chap. 5."
          ]
        }
      ]
    }
  ]
}
