{
  "title": "CHAPTER XXXIII.",
  "subtitle": "MOUNT GURUPADA, WHERE KAŚYAPA BUDDHA’S ENTIRE SKELETON IS.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "(THE travellers), going on from this three le to the south, came to a mountain named Gurupada[1], inside which Mahâkaśyapa even now is.",
          "He made a cleft, and went down into it, though the place where he entered would not (now) admit a man.",
          "Having gone down very far, there was a hole on one side, and there the complete body of Kaśyapa (still) abides.",
          "Outside the hole (at which he entered) is the earth with which he had washed his hands[2].",
          "If the people living thereabouts have a sore on their heads, they plaster on it some of the earth from this, and feel immediately easier[3].",
          "On this mountain, now as of old, there are Arhats abiding.",
          "Devotees of our Law from the various countries in that quarter go year by year to the mountain, and present offerings to Kaśyapa; and to those whose hearts are strong in faith there come Arhats at night, and talk with them, discussing and explaining their doubts, and disappearing suddenly afterwards."
        ]
      },
      {
        "sentences": [
          "On this hill hazels grow luxuriantly; and there are many lions, tigers, and wolves, so that people should not travel incautiously."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "‘Fowl’s-foot hill,’ ‘with three peaks, resembling the foot of a chicken.",
            "It lies seven miles south-east of Gayâ, and was the residence of Mahâkaśyapa, who is said to be still living inside this mountain.’",
            "So Eitel says, p. 58; but this chapter does not say that Kaśyapa is in the mountain alive, but that his body entire is in a recess or hole in it.",
            "Hardy (M. B., p. 97) says that after Kaśyapa Buddha’s body was burnt, the bones still remained in their usual position, presenting the appearance of a perfect skeleton.",
            "It is of him that the chapter speaks, and not of the famous disciple of Śâkyamuni, who also is called Mahâkaśyapa.",
            "This will appear also on a comparison of Eitel’s articles on ‘Mahâkaśyapa’ and ‘Kaśyapa Buddha.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Was it a custom to wash the hands with ‘earth,’ as is often done with sand?"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This I conceive to be the meaning here."
          ]
        }
      ]
    }
  ]
}
