{
  "title": "CHAPTER XXIX.",
  "subtitle": "GṚIDHRA-KÛṬA HILL, AND LEGENDS. FÂ-HIEN PASSES A NIGHT ON IT. HIS REFLECTIONS.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "ENTERING the valley, and keeping along the mountains on the south-east, after ascending fifteen le, (the travellers) came to mount Gṛidhra-kûṭa[1].",
          "Three le before you reach the top, there is a cavern in the rocks, facing the south, in which Buddha sat in meditation.",
          "Thirty paces to the north-west there is another, where Ananda was sitting in meditation, when the deva Mâra Piśuna[2], having assumed the form of a large vulture, took his place in front of the cavern, and frightened the disciple.",
          "Then Buddha, by his mysterious, supernatural power, made a cleft in the rock, introduced his hand, and stroked Ânanda’s shoulder, so that his fear immediately passed away.",
          "The footprints of the bird and the cleft for (Buddha’s) hand are still there, and hence comes the name of ‘The Hill of the Vulture Cavern.’"
        ]
      },
      {
        "sentences": [
          "In front of the cavern there are the places where the four Buddhas sat.",
          "There are caverns also of the Arhats, one where each sat and meditated, amounting to several hundred in all.",
          "At the place where in front of his rocky apartment Buddha was walking from east to west (in meditation), and Devadatta, from among the beetling cliffs on the north of the mountain, threw a rock across, and hurt Buddha’s toes[3], the rock is still there[4]."
        ]
      },
      {
        "sentences": [
          "The hall where Buddha preached his Law has been destroyed, and only the foundations of the brick walls remain.",
          "On this hill the peak is beautifully green, and rises grandly up; it is the highest of all the five hills.",
          "In the New City Fâ-hien bought incense-(sticks), flowers, oil and lamps, and hired two bhikshus, long resident (at the place), to carry them (to the peak).",
          "When he himself got to it, he made his offerings with the flowers and incense, and lighted the lamps when the darkness began to come on.",
          "He felt melancholy, but restrained his tears and said, ‘Here Buddha delivered the Śûrâṅgama (Sûtra)[5].",
          "I, Fâ-hien, was born when I could not meet with Buddha; and now I only see the footprints which he has left, and the place where he lived, and nothing more.’",
          "With this, in front of the rock cavern, he chanted the Śûrâṅgama Sûtra, remained there over the night, and then returned towards the New City[6]."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 4, p. 80."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 4, p. 74.",
            "Piśuna is a name given to Mâra, and signifies ‘sinful lust.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See M. B., p. 320.",
            "Hardy says that Devadatta’s attempt was ‘by the help of a machine;’ but the oldest account in the Sacred Books of the East, vol. xx, Vinaya Texts, p. 245, agrees with what Fâ-hien implies that he threw the rock with his own arm."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "And, as described by Hsüan-chwang, fourteen or fifteen cubits high, and thirty paces round."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See Mr. Bunyiu Nanjio’s ‘Catalogue of the Chinese Translation of the Buddhist Tripiṭaka,’ Sûtra Piṭaka, Nos. 399, 446.",
            "It was the former of these that came on this occasion to the thoughts and memory of Fâ-hien."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In a note (p. lx) to his revised version of our author, Mr. Beal says, ‘There is a full account of this perilous visit of Fâ-hien, and how he was attacked by tigers, in the “History of the High Priests.”’",
            "But ‘the high priests’ merely means distinguished monks, ‘eminent monks,’ as Mr. Nanjio exactly renders the adjectival character.",
            "Nor was Fâ-hien ‘attacked by tigers’ on the peak.",
            "No ‘tigers’ appear in the Memoir.",
            "‘Two black lions’ indeed crouched before him for a time this night, ‘licking their lips and waving their tails;’ but their appearance was to ‘try,’ and not to attack him; and when they saw him resolute, they ‘drooped their heads, put down their tails, and prostrated themselves before him.’",
            "This of course is not an historical account, but a legendary tribute to his bold perseverance."
          ]
        }
      ]
    }
  ]
}
