{
  "title": "CHAPTER XXXI.",
  "subtitle": "GAYÂ. ŚÂKYAMUNI’S ATTAINING TO THE BUDDHASHIP; AND OTHER LEGENDS.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FROM this place, after travelling to the west for four yojanas, (the pilgrims) came to the city of Gayâ[1]; but inside the city all was emptiness and desolation.",
          "Going on again to the south for twenty le, they arrived at the place where the Bodhisattva for six years practised with himself painful austerities.",
          "All around was forest."
        ]
      },
      {
        "sentences": [
          "Three le west from here they came to the place where, when Buddha had gone into the water to bathe, a deva bent down the branch of a tree, by means of which he succeeded in getting out of the pool[2]."
        ]
      },
      {
        "sentences": [
          "Two le north from this was the place where the Grâmika girls presented to Buddha the rice-gruel made with milk[3]; and two le north from this (again) was the place where, seated on a rock under a great tree, and facing the east, he ate (the gruel).",
          "The tree and the rock are there at the present day.",
          "The rock may be six cubits in breadth and length, and rather more than two cubits in height.",
          "In Central India the cold and heat are so equally tempered that trees will live in it for several thousand and even for ten thousand years."
        ]
      },
      {
        "sentences": [
          "Half a yojana from this place to the north-east there was a cavern in the rocks, into which the Bodhisattva entered, and sat cross-legged with his face to the west.",
          "(As he did so), he said to himself, ‘If I am to attain to perfect wisdom (and become Buddha), let there be a supernatural attestation of it.’",
          "On the wall of the rock there appeared immediately the shadow of a Buddha, rather more than three feet in length, which is still bright at the present day.",
          "At this moment heaven and earth were greatly moved, and devas in the air spoke plainly, ‘This is not the place where any Buddha of the past, or he that is to come, has attained, or will attain, to perfect Wisdom.",
          "Less than half a yojana from this to the south-west will bring you to the patra[4] tree, where all past Buddhas have attained, and all to come must attain, to perfect Wisdom.’",
          "When they had spoken these words, they immediately led the way forwards to the place, singing as they did so.",
          "As they thus went away, the Bodhisattva arose and walked (after them).",
          "At a distance of thirty paces from the tree, a deva gave him the grass of lucky omen[5], which he received and went on.",
          "After (he had proceeded) fifteen paces, 500 green birds came flying towards him, went round him thrice, and disappeared.",
          "The Bodhisattva went forward to the patra tree, placed the kuśa grass at the foot of it, and sat down with his face to the east.",
          "Then king Mâra sent three beautiful young ladies, who came from the north, to tempt him, while he himself came from the south to do the same.",
          "The Bodhisattva put his toes down on the ground, and the demon soldiers retired and dispersed, and the three young ladies were changed into old (grand-)mothers[6]."
        ]
      },
      {
        "sentences": [
          "At the place mentioned above of the six years’ painful austerities, and at all these other places, men subsequently reared topes and set up images, which all exist at the present day."
        ]
      },
      {
        "sentences": [
          "Where Buddha, after attaining to perfect wisdom, for seven days contemplated the tree, and experienced the joy of vimukti[7]; where, under the patra tree, he walked backwards and forwards from west to east for seven days; where the devas made a hall appear, composed of the seven precious substances, and presented offerings to him for seven days where the blind dragon Muchilinda[8] encircled him for seven days; where he sat under the nyagrodha tree, on a square rock, with his face to the east, and Brahma-deva[9] came and made his request to him; where the four deva kings brought to him their alms-bowls[10]; where the 500 merchants[11] presented to him the roasted flour and honey; and where he converted the brothers Kaśyapa and their thousand disciples[12];—at all these places topes were reared."
        ]
      },
      {
        "sentences": [
          "At the place where Buddha attained to perfect Wisdom, there are three monasteries, in all of which there are monks residing.",
          "The families of their people around supply the societies of these monks with an abundant sufficiency of what they require, so that there is no lack or stint[13].",
          "The disciplinary rules are strictly observed by them.",
          "The laws regulating their demeanour in sitting, rising, and entering when the others are assembled, are those which have been practised by all the saints since Buddha was in the world down to the present day.",
          "The places of the four great topes have been fixed, and handed down without break, since Buddha attained to nirvâṇa.",
          "Those four great topes are those at the places where Buddha was born; where he attained to Wisdom; where he (began to) move the wheel of his Law; and where he attained to pari-nirvâṇa."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Gayâ, a city of Magadha, was north-west of the present Gayah (lat. 24° 47' N., lon. 85° 1' E.).",
            "It was here that Śâkyamuni lived for seven years, after quitting his family, until he attained to Buddhaship.",
            "The place is still frequented by pilgrims. E. H., p. 41."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This is told so as to make us think that he was in danger of being drowned; but this does not appear in the only other account of the incident I have met with,—in ‘The Life of the Buddha,’ p. 31.",
            "And he was not yet Buddha, though he is here called so; unless indeed the narrative is confused, and the incidents do not follow in the order of time."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "An incident similar to this is told, with many additions, in Hardy’s M. B., pp. 166-168; ‘The Life of the Buddha,’ p. 30; and the ‘Buddhist Birth Stories,’ pp. 91, 92; but the name of the ministering girl or girls is different.",
            "I take Grâmika from a note in Beal’s revised version; it seems to me a happy solution of the difficulty caused by the 彌家 of Fâ-hien."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Called ‘the tree of leaves,’ and ‘the tree of reflection;’ a palm tree, the borassus flabellifera, described as a tree which never loses its leaves.",
            "It is often confounded with the pippala. E. H., p. 92."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The kuśa grass, mentioned in a previous note."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the account of this contest with Mâra in M. B., pp. 171-179, and ‘Buddhist Birth Stories,’ pp. 96-101."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, p. 38."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Called also Mahâ, or the Great Muchilinda.",
            "Eitel says: ‘A nâga king, the tutelary deity of a lake near which Śâkyamuni once sat for seven days absorbed in meditation, whilst the king guarded him.’",
            "The account (p. 35) in ‘The Life of the Buddha’ is:—‘Buddha went to where lived the nâga king Muchilinda, and he, wishing to preserve him from the sun and rain, wrapped his body seven times round him, and spread out his hood over his head; and there he remained seven days in thought.’",
            "So also the Nidâna Kathâ, in ‘Buddhist Birth Stories,’ p. 109."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This was Brahmâ himself, though ‘king’ is omitted.",
            "What he requested of the Buddha was that he would beg in the preaching of his Law. Nidâna Kathâ, p. 111."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 4, p. 35."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The other accounts mention only two; but in M. B., p. 182, and the Nidâna Kathâ, p. 110, these two have 500 well-laden waggons with them."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "These must not be confounded with Mahâkaśyapa of note 5, p. 45.",
            "They were three brothers, Uruvilvâ, Gayâ, and Nadî-Kaśyapa, up to this time holders of ‘erroneous’ views, having 500, 300, and 200 disciples respectively.",
            "They became distinguished followers of Śâkyamuni; and are—each of them—to become Buddha by-the-by.",
            "See the Nidâna Kathâ, pp. 114, 115."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This seems to be the meaning; but I do not wonder that some understand the sentence of the benevolence of the monkish population to the travellers."
          ]
        }
      ]
    }
  ]
}
