{
  "title": "CHAPTER XXX.",
  "subtitle": "THE ŚRATAPARṆA CAVE, OR CAVE OF THE FIRST COUNCIL. LEGENDS. SUICIDE OF A BHIKSHU.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "OUT from the old city, after walking over 300 paces, on the west of the road, (the travellers) found the Karaṇḍa Bamboo garden[1], where the (old) vihâra is still in existence, with a company of monks, who keep (the ground about it) swept and watered."
        ]
      },
      {
        "sentences": [
          "North of the vihâra two or three le there was the Śmaśânam, which name means in Chinese ‘the field of graves into which the dead are thrown[2].’"
        ]
      },
      {
        "sentences": [
          "As they kept along the mountain on the south, and went west for 300 paces, they found a dwelling among the rocks, named the Pippala cave[3], in which Buddha regularly sat in meditation after taking his (midday) meal."
        ]
      },
      {
        "sentences": [
          "Going on still to the west for five or six le, on the north of the hill, in the shade, they found the cavern called Śrataparṇa[4], the place where, after the nirvâṇa[5] of Buddha, 500 Arhats collected the Sûtras.",
          "When they brought the Sûtras forth, three lofty seats[6]  had been prepared and grandly ornamented.",
          "Śâriputtra occupied the one on the left, and Maudgalyâyana that on the right.",
          "Of the number of five hundred one was wanting.",
          "Mahâkaśyapa was president (on the middle seat).",
          "Ânanda was then outside the door, and could not get in[7].",
          "At the place there was (subsequently) raised a tope, which is still existing."
        ]
      },
      {
        "sentences": [
          "Along (the sides of) the hill, there are also a very great many cells among the rocks, where the various Arhans sat and meditated.",
          "As you leave the old city on the north, and go down east for three le, there is the rock dwelling of Devadatta, and at a distance of fifty paces from it there is a large, square, black rock.",
          "Formerly there was a bhikshu, who, as he walked backwards and forwards up on it, thought with himself: ‘This body[8] is impermanent, a thing of bitterness and vanity[9], and which cannot be looked on as pure[10].",
          "I am weary of this body, and troubled by it as an evil.’",
          "With this he grasped a knife, and was about to kill himself.",
          "But he thought again:—‘The World-honoured one laid down a prohibition against one’s killing himself[11].’",
          "Further it occurred to him:—‘Yes, he did; but I now only wish to kill three poisonous thieves[12].’",
          "Immediately with the knife he cut his throat.",
          "With the first gash into the flesh he attained the state of a Śrotâpanna[13]; when he had gone half through, he attained to be an Anâgâmin[14]; and when he had cut right through, he was an Arhat, and attained to pari-nirvâṇa[15]; (and died)."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Karaṇḍa Veṇuvana; a park presented to Buddha by king Bimbisâra, who also built a vihâra in it.",
            "See the account of the transaction in M. B., p. 194.",
            "The place was called Karaṇḍa, from a creature so named, which awoke the king just as a snake was about to bite him, and thus saved his life.",
            "In Hardy the creature appears as a squirrel, but Eitel says that the Karaṇḍa is a bird of a sweet voice, resembling a magpie, but herding in flocks; the cuculus melanoleucus.",
            "See ‘Buddhist Birth Stories,’ p. 118."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The language here is rather contemptuous, as if our author had no sympathy with any other mode of disposing of the dead, but by his own Buddhistic method of cremation."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Chinese characters used for the name of this cavern serve also to name the pippala (peepul) tree, the ficus religiosa.",
            "They make us think that there was such a tree overshadowing the cave; but Fâ-hien would hardly have neglected to mention such a circumstance."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A very great place in the annals of Buddhism.",
            "The Council in the Śrataparṇa cave did not come together fortuitously, but appears to have been convoked by the older members to settle the rules and doctrines of the order.",
            "The cave was prepared for the occasion by king Ajâtaśatru.",
            "From the expression about the ‘bringing forth of the King,’ it would seem that the Sûtras or some of them had been already committed to writing.",
            "May not the meaning of King (桱) here be extended to the Vinaya rules, as well as the Sûtras, and mean ‘the standards’ of the system generally?",
            "See Davids’ Manual, chapter ix, and Sacred Books of the East, vol. xx, Vinaya Texts, pp. 370-385."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "So in the text, evidently for pari-nirvâṇa."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Instead of ‘high’ seats, the Chinese texts have ‘vacant.’",
            "The character for ‘prepared’ denotes ‘spread;’—they were carpeted; perhaps, both cushioned and carpeted, being rugs spread on the ground, raised higher than the other places for seats."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Did they not contrive to let him in, with some cachinnation, even in so august an assembly, that so important a member should have been shut out?"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The life of this body’ would, I think, fairly express the idea of the bhikshu."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the account of Buddha’s preaching in chapter xviii."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The sentiment of this clause is not easily caught."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See E. M., p. 152:—‘Buddha made a law forbidding the monks to commit suicide. He prohibited any one from discoursing on the miseries of life in such a manner as to cause desperation.’",
            "See also M. B., pp. 464, 465."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Beal says:—‘Evil desire; hatred; ignorance.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note. 2, p. 57."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Anâgâmin belong to the third degree of Buddhistic saintship, the third class Âryas (note 2, page 57), who are no more liable to be reborn as men, but are to be born once more as devas, when they will forthwith become Arhats, and attain to nirvâṇa.",
            "E. H., pp. 8, 9."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Our author expresses no opinion of his own on the act of this bhikshu.",
            "Must it not have been a good act, when it was attended, in the very act of performance, by such blessed consequences?",
            "But if Buddhism had not something better to show than what appears here, it would not attract the interest which it now does.",
            "The bhikshu was evidently rather out of his mind; and the verdict of a coroner’s inquest of this nineteenth century would have pronounced that he killed himself ‘in a fit of insanity.’"
          ]
        }
      ]
    }
  ]
}
