{
  "title": "CHAPTER VIII.",
  "subtitle": "WOO-CHANG, OR UDYÂNA. MONASTERIES, AND THEIR WAYS. TRACES OF BUDDHA.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "AFTER crossing the river, (the travellers) immediately came to the kingdom of Woo-chang[1], which is indeed (a part) of North India.",
          "The people all use the language of Central India, ‘Central India’ being what we should call the ‘Middle Kingdom.’",
          "The food and clothes of the common people are the same as in that Central Kingdom.",
          "The Law of Buddha is very (flourishing in Woo-chang).",
          "They call the places where the monks stay (for a time) or reside permanently Saṅghârâmas[2]; and of these there are in all 500, the monks being all students of the hînayâna.",
          "When stranger bhikshus[3] arrive at one of them, their wants are supplied for three days, after which they are told to find a resting-place for themselves."
        ]
      },
      {
        "sentences": [
          "There is a tradition that when Buddha came to North India, he came at once to this country, and that here he left a print of his foot, which is long or short according to the ideas of the beholder (on the subject).",
          "It exists, and the same thing is true about it, at the present day.",
          "Here also are still to be seen the rock on which he dried his clothes, and the place where he converted the wicked dragon[4].",
          "The rock is fourteen cubits high, and more than twenty broad, with one side of it smooth."
        ]
      },
      {
        "sentences": [
          "Hwuy-king, Hwuy-tah, and Tâo-ching went on ahead towards (the place of) Buddha’s shadow in the country of Nâgara[5]; but Fâ-hien and the others remained in Woo-chang, and kept the summer retreat[6].",
          "That over, they descended south, and arrived in the country of Soo-ho-to[7]."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Udyâna, meaning ‘the Park;’ just north of the Punjâb, the country along the Subhavastu, now called the Swat; noted for its forests, flowers, and fruits (E. H., p. 153)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, p. 17."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Bhikshu is the name for a monk as ‘living by alms,’ a mendicant.",
            "All bhikshus call themselves Sramans.",
            "Sometimes the two names are used together by our author."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Nâga is the Sanskrit name for the Chinese lung or dragon; often meaning a snake, especially the boa.",
            "‘Chinese Buddhists,’ says Eitel, p. 79, ‘when speaking of nâgas as boa spirits, always represent them as enemies of mankind, but when viewing them as deities of rivers, lakes, or oceans, they describe them as piously inclined.’",
            "The dragon, however, is in China the symbol of the Sovereign and Sage, a use of it unknown in Buddhism, according to which all nâgas need to be converted in order to obtain a higher phase of being.",
            "The use of the character too (度), as here, in the sense of ‘to convert,’ is entirely Buddhistic.",
            "The six pâramitâs are the six virtues which carry men across (度) the great sea of life and death, as the sphere of transmigration to nirvâṇa.",
            "With regard to the particular conversion here, Eitel (p. 11) says the Nâga’s name was Apatâla, the guardian deity of the Subhavastu river, and that he was converted by Śâkyamuni shortly before the death of the latter."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In Chinese Na-k’eeh, an ancient kingdom and city on the southern bank of the Cabul river, about thirty miles west of Jellalabad."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "We would seem now to be in 403."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Soo-ho-to has not been clearly identified.",
            "Beal says that later Buddhist writers include it in Udyâna.",
            "It must have been between the Indus and the Swat.",
            "I suppose it was what we now call Swastene."
          ]
        }
      ]
    }
  ]
}
