{
  "title": "CHAPTER XXVIII.",
  "subtitle": "RAJAGṚIHA, NEW AND OLD. LEGENDS AND INCIDENTS CONNECTED WITH IT.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "(THE travellers) went on from this to the south-east for nine yojanas, and came to a small solitary rocky hill[1], at the head or end of which[2] was an apartment of stone, facing the south,—the place where Buddha sat, when Śakra, Ruler of Devas, brought the deva-musician, Pañcha-(śikha)[3], to give pleasure to him by playing on his lute.",
          "Śakra then asked Buddha about forty-two subjects, tracing (the questions) out with his finger one by one on the rock[4].",
          "The prints of his tracing are still there; and here also there is a monastery."
        ]
      },
      {
        "sentences": [
          "A yojana south-west from this place brought them to the village of Nâla[5], where Śâriputtra[6] was born, and to which also he returned, and attained here his pari-nirvâṇa.",
          "Over the spot (where his body was burned) there was built a tope, which is still in existence."
        ]
      },
      {
        "sentences": [
          "Another yojana to the west brought them to New Râjagṛiha[7],—the new city which was built by king Ajâtaśatru.",
          "There were two monasteries in it.",
          "Three hundred paces outside the west gate, king Ajâtaśatru, having obtained one portion of the relics of Buddha, built (over them) a tope, high, large, grand, and beautiful.",
          "Leaving the city by the south gate, and proceeding south four le, one enters a valley, and comes to a circular space formed by five hills, which stand all round it, and have the appearance of the suburban wall of a city.",
          "Here was the old city of king Bimbisâra[8]; from east to west about five or six le, and from north to south seven or eight.",
          "It was here that Śâriputtra and Maudgalyâyana first saw Upasena[9]; that the Nirgrantha[10] made a pit of fire and poisoned the rice, and then invited Buddha (to eat with him); that king Ajâtaśatru made a black elephant intoxicated with liquor, wishing him to injure Buddha[11]; and that at the north-east corner of the city in a (large) curving (space) Jîvaka built a vihâra in the garden of Âmbapâli[12], and invited Buddha with his 1250 disciples to it, that he might there make his offerings to support them.",
          "(These places) are still there as of old, but inside the city all is emptiness and desolation; no man dwells in it."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Called by Hsüan-chwang Indra-śila-guhâ, or ‘The cavern of Indra.’",
            "It has been identified with a hill near the village of Giryek, on the bank of the Pañchâna river, about thirty-six miles from Gayâ.",
            "The hill terminates in two peaks overhanging the river, and it is the more northern and higher of these which Fâ-hien had in mind.",
            "It bears an oblong terrace covered with the ruins of several buildings, especially of a vihâra."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This does not mean the top or summit of the hill, but its ‘headland,’ where it ended at the river."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the account of this visit of Śakra in M. B., pp. 288-290.",
            "It is from Hardy that we are able to complete here the name of the musician, which appears in Fâ-hien as only Pañcha, or ‘Five.’",
            "His harp or lute, we are told, was ‘twelve miles long.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Hardy (M. B., pp. 288, 289) makes the subjects only thirteen, which are still to be found in one of the Sûtras (‘the Dik-Saṅga, in the Śakra-praśna Sûtra’).",
            "Whether it was Śakra who wrote his questions, or Buddha who wrote the answers, depends on the punctuation.",
            "It seems better to make Śakra the writer."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Or Nâlanda; identified with the present Baragong.",
            "A grand monastery was subsequently built at it, famous by the residence for five years of Hsüan-chwang."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, page 44.",
            "There is some doubt as to the statement that Nâla was his birthplace."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The city of ‘Royal Palaces;’ ‘the residence of Magadha kings from Bimbisâra to Aśoka, the first metropolis of Buddhism, at the foot of the Gṛidhra-kûṭa mountains.",
            "Here the first synod assembled within a year after Śâkyamuni’s death.",
            "Its ruins are still extant at the village of Rajghir, sixteen miles S.W. of Behâr, and form an object of pilgrimage to the Jains (E. H., p. 100).’",
            "It is called New Râjagṛiha to distinguish it from Kuśâgârapura, a few miles from it, the old residence of the kings.",
            "Eitel says it was built by Bimbisâra, while Fâ-hien ascribes it to Ajâtaśatru.",
            "I suppose the son finished what the father had begun."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 5, p. 81."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "One of the five first followers of Śâkyamuni.",
            "He is also called Aśvajit; in Pâli Assaji; but Aśvajit seems to be a military title=‘Master or trainer of horses.’",
            "The two more famous disciples met him, not to lead him, but to be directed by him, to Buddha.",
            "See Sacred Books of the East, vol. xiii, Vinaya Texts, pp. 144-147."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "One of the six Tîrthyas (Tîrthakas=‘erroneous teachers;’ M. B., pp. 290-292, but I have not found the particulars of the attempts on Buddha’s life referred to by Fâ-hien), or Brahmanical opponents of Buddha.",
            "He was an ascetic, one of the Jñâti clan, and is therefore called Nirgranthajñâti.",
            "He taught a system of fatalism, condemned the use of clothes, and thought he could subdue all passions by fasting.",
            "He had a body of followers, who called themselves by his name (Eitel, pp. 84, 85), and were the forerunners of the Jains."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The king was moved to this by Devadatta.",
            "Of course the elephant disappointed them, and did homage to Śâkyamuni.",
            "See Sacred Books of the East, vol. xx, Vinaya Texts, p. 247."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, p. 72.",
            "Jîvaka was Âmbapâli’s son by king Bimbisâra, and devoted himself to the practice of medicine.",
            "See the account of him in the Sacred Books of the East, vol. xvii, Vinaya Texts, pp. 171-194."
          ]
        }
      ]
    }
  ]
}
