{
  "title": "CHAPTER XIV.",
  "subtitle": "DEATH OF HWUY-KING IN THE LITTLE SNOWY MOUNTAINS. LO-E. POHNÂ. CROSSING THE INDUS TO THE EAST.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "HAVING stayed there till the third month of winter, Fâ-hien and the two others[1], proceeding southwards, crossed the Little Snowy mountains[2].",
          "On them the snow lies accumulated both winter and summer.",
          "On the north (side) of the mountains, in the shade, they suddenly encountered a cold wind which made them shiver and become unable to speak.",
          "Hwuy-king could not go any farther.",
          "A white froth came from his mouth, and he said to Fâ-hien, ‘I cannot live any longer. Do you immediately go away, that we do not all die here;’ and with these words died[3].",
          "Fâ-hien stroked the corpse, and cried out piteously, ‘Our original plan has failed;—it is fate[4]. What can we do?’",
          "He then again exerted himself, and they succeeded in crossing to the south of the range, and arrived in the kingdom of Lo-e[5], where there were nearly three thousand monks, students of both the mahâyâna and hînayâna.",
          "Here they stayed for the summer retreat[6], and when that was over, they went on to the south, and ten days’ journey brought them to the kingdom of Poh-nâ[7] where there are also more than three thousand monks, all students of the hînayâna.",
          "Proceeding from this place for three days, they again crossed the Indus, where the country on each side was low and level[8]."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "These must have been Tâo-ching and Hwuy-king."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Probably the Safeid Koh, and on the way to the Kohat pass."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "All the texts have Hwuy-king.",
            "See note 2, page 36."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A very natural exclamation, but out of place and inconsistent from the lips of Fâ-hien.",
            "The Chinese character 命, which he employed, may be rendered rightly by ‘fate’ or ‘destiny;’ but the fate is not unintelligent.",
            "The term implies a factor, or fa-tor, and supposes the ordination of Heaven or God.",
            "A Confucian idea for the moment overcame his Buddhism."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Lo-e, or Rohî, is a name for Afghanistan; but only a portion of it can be here intended."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "We are now therefore in 404."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "No doubt the present district of Bannu, in the Lieutenant-Governorship of the Punjâb, between; 32° 10' and 33° 15' N. lat., and 70° 26' and 72° E. lon.",
            "See Hunter’s Gazetteer of India, i, p. 393."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "They had then crossed the Indus before.",
            "They had done so, indeed, twice: first, from north to south, at Skardo or east of it; and second, as described in chap. vii."
          ]
        }
      ]
    }
  ]
}
