{
  "title": "CHAPTER XXII.",
  "subtitle": "KAPILAVASTU. ITS DESOLATION. LEGENDS OF BUDDHA’S BIRTH, AND OTHER INCIDENTS IN CONNEXION WITH IT.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "LESS than a yojana to the east from this brought them to the city of Kapilavastu[1]; but in it there was neither king nor people.",
          "All was mound and desolation.",
          "Of inhabitants there were only some monks and a score or two of families of the common people.",
          "At the spot where stood the old palace of king Śuddhodana[2] there have been made images of the prince (his eldest son) and his mother[3]; and at the places where that son appeared mounted on a white elephant when he entered his mother’s womb[4], and where he turned his carriage round on seeing the sick man after he had gone out of the city by the eastern gate[5], topes have been erected.",
          "The places (were also pointed out)[6] where (the ṛishi) Â-e[7] inspected the marks[8] (of Buddhaship on the body) of the heir-apparent (when an infant); where, when he was in company with Nanda and others, on the elephant being struck down and drawn on one side, he tossed it away[9]; where he shot an arrow to the south-east, and it went a distance of thirty le, then entering the ground and making a spring to come forth, which men subsequently fashioned into a well from which travellers might drink[10]; where, after he had attained to Wisdom[11], Buddha returned and saw the king, his father[12]; where five hundred Śâkyas quitted their families and did reverence to Upâli[13] while the earth shook and moved in six different ways; where Buddha preached his Law to the devas, and the four deva kings and others kept the four doors (of the hall), so that (even) the king, his father, could not enter[14] where Buddha sat under a nyagrodha tree, which is still standing[15], with his face to the east, and (his aunt) Mahâ-prajâpatî presented him with a Saṅghâli[16]; and (where) king Vaidûrya slew the seed of Śâkya, and they all in dying became Śrotâpannas[17].",
          "A tope was erected at this last place, which is still existing."
        ]
      },
      {
        "sentences": [
          "Several le north-east from the city was the king’s field, where the heir-apparent sat under a tree, and looked at the ploughers[18]."
        ]
      },
      {
        "sentences": [
          "Fifty le east from the city was a garden, named Lumbinî[19], where the queen entered the pond and bathed.",
          "Having come forth from the pond on the northern bank, after (walking) twenty paces, she lifted up her hand, laid hold of a branch of a tree, and, with her face to the east, gave birth to the heir-apparent[20].",
          "When he fell to the ground, he (immediately) walked seven paces.",
          "Two dragon-kings (appeared) and washed his body.",
          "At the place where they did so, there was immediately formed a well, and from it, as well as from the above pond, where (the queen) bathed[21], the monks (even) now constantly take the water, and drink it."
        ]
      },
      {
        "sentences": [
          "There are four places of regular and fixed occurrence (in the history of) all Buddhas:—first, the place where they attained to perfect Wisdom (and became Buddha); second, the place where they turned the wheel of the Law[22]; third, the place where they preached the Law, discoursed of righteousness, and discomfited (the advocates of) erroneous doctrines; and fourth, the place where they came down, after going up to the Trayastriṃśas heaven to preach the Law for the benefit of their mothers.",
          "Other places in connexion with them became remarkable, according to the manifestations which were made at them at particular times."
        ]
      },
      {
        "sentences": [
          "The country of Kapilavastu is a great scene of empty desolation.",
          "The inhabitants are few and far between.",
          "On the roads people have to be on their guard against white elephants[23] and lions, and should not travel incautiously."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Kapilavastu, ‘the city of beautiful virtue,’ was the birthplace of Śâkyamuni, but was destroyed, as intimated in the notes on last chapter, during his lifetime.",
            "It was situated a short distance north-west of the present Goruckpoor, lat. 26° 46' N., lon. 83° 19' E.",
            "Davids says (Manual, p. 25), ‘It was on the banks of the river Rohini, the modern Kohana, about 100 miles north-west of the city of Benâres.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The father, or supposed father, of Śâkyamuni.",
            "He is here called ‘the king white and pure’ (白淨王).",
            "A more common appellation is ‘the king of pure rice (淨飯王); but the character 飯, or ‘rice,’ must be a mistake for 梵, ‘Brahman,’ and the appellation= ‘Pure Brahman king.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The ‘eldest son’ or ‘prince’ was Śâkyamuni, and his mother had no other son.",
            "For ‘his mother,’ see note 2, page 48.",
            "She was a daughter of Añjana or Anuśâkya, king of the neighbouring country of Koli, and Yaśodharâ, an aunt of Śuddhodana.",
            "There appear to have been various intermarriages between the royal houses of Kapila and Koli."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In ‘The Life of the Buddha,’ p. 15, we read that ‘Buddha was now in the Tushita heaven, and knowing that his time was come (the time for his last rebirth in the course of which he would become Buddha), he made the necessary examinations; and having decided that Mahâ-mâyâ was the right mother, in the midnight watch he entered her womb under the appearance of an elephant.’",
            "See M. B., pp. 140-143, and, still better, Rhys Davids’ ‘Birth Stories,’ pp. 58-63."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In Hardy's M. B., pp. 154, 155, we read, ‘As the prince (Siddhârtha, the first name given to Śâkyamuni; see Eitel, under Sarvârthasiddha) was one day passing along, he saw a deva under the appearance of a leper, full of sores, with a body like a water-vessel, and legs like the pestle for pounding rice; and when he learned from his charioteer what it was that he saw, he became agitated, and returned at once to the palace.’",
            "See also Rhys Davids’ ‘Buddhism,’ p. 29."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This is an addition of my own, instead of ‘There are also topes erected at the following spots’ of former translators.",
            "Fâ-hien does not say there were memorial topes at all these places."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Asita; see Eitel, p. 15.",
            "He is called in Pâli Kalâ Devala, and had been a minister of Śuddhodana’s father."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, page 39."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In ‘The Life of the Buddha’ we read that the Lichchhavis of Vaiśâlî had sent to the young prince a very fine elephant; but when it was near Kapilavastu, Devadatta, out of envy, killed it with a blow of his fist.",
            "Nanda (not Ânanda, but a half-brother of Siddhârtha), coming that way, saw the carcase lying on the road, and pulled it on one side; but the Bodhisattva, seeing it there, took it by the tail, and tossed it over seven fences and ditches, when the force of its fall made a great ditch.",
            "I suspect that the characters in the column have been disarranged, and that we should read 樸捅象處, 射箭, 云云.",
            "Buddha, that is Siddhârtha, was at this time only ten years old."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The young Śakyas were shooting when the prince thus surpassed them all.",
            "He was then seventeen."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, page 61."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This was not the night when he finally fled from Kapilavastu, and as he was leaving the palace, perceived his sleeping father, and said, ‘Father, though I love thee, yet a fear possesses me, and I may not stay;’ p. 25.",
            "Most probably it was that related in M. B., pp. 199-204.",
            "See ‘Buddhist Birth Stories,’ pp. 120-127."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "They did this, I suppose, to show their humility, for Upâli was only a Śûdra by birth, and had been a barber; so from the first did Buddhism assert its superiority to the conditions of rank and caste.",
            "Upâli was distinguished by his knowledge of the rules of discipline, and praised on that account by Buddha.",
            "He was one of the three leaders of the first synod, and the principal compiler of the original Vinaya books."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "I have not met with the particulars of this preaching."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Meaning, as explained in Chinese, ’a tree without knots;’ the ficus Indica.",
            "See Rhys Davids’ note. Manual, p. 39, where he says that a branch of one of these trees was taken from Buddha Gayâ to Anurâdhapura in Ceylon in the middle of the third century B.C., and is still growing there, the oldest historical tree in the world."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 1, page 39.",
            "I have not met with the account of this presentation.",
            "See the long account of Prajâpatî in M. B., pp. 306-315."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, page 57.",
            "The Śotâpannas are the first class of saints, who are not to be reborn in a lower sphere, but attain to nirvâṇa after having been reborn seven times consecutively as men or devas.",
            "The Chinese editions state there were ‘1000’ of the Śâkya seed.",
            "The general account is that they were 500, all maidens, who refused to take their place in king Vaidûrya’s harem, and were in consequence taken to a pond, and had their hands and feet cut off.",
            "There Buddha came to them, had their wounds dressed, and preached to them the Law.",
            "They died in the faith, and were reborn in the region of the four Great Kings.",
            "Thence they came back and visited Buddha at Jetavana in the night, and there they obtained the reward of Śrotâpanna.",
            "‘The Life of the Buddha,’ p. 121."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the account of this in M. B., p. 150.",
            "The account of it reminds me of the ploughing by the sovereign, which has been an institution in China from the earliest times.",
            "But there we have no magic and no extravagance."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The place of Liberation’ see note 2, page 38."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the accounts of this event in M. B., pp. 145, 146; ‘The Life of the Buddha,’ pp. 15, 16; and ‘Buddhist Birth Stories,’ p. 66."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "There is difficulty in construing the text of this last statement.",
            "Mr. Beal had, no doubt inadvertently, omitted it in his first translation.",
            "In his revised version he gives for it, I cannot say happily, ‘As well as at the pool, the water of which came down from above for washing (the child).’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, page 49.",
            "See also Davids’ Manual, p. 45.",
            "The latter says, that ‘to turn the wheel of the Law’ means ‘to set rolling the royal chariot wheel of a universal empire of truth and righteousness;’ but he admits that this is more grandiloquent than the phraseology was in the ears of Buddhists.",
            "I prefer the words quoted from Eitel in the note referred to.",
            "‘They turned’ is probably equivalent to ‘They began to turn.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Fâ-hien does not say that he himself saw any of these white elephants, nor does he speak of the lions as of any particular colour.",
            "We shall find by-and-by, in a note further on, that, to make them appear more terrible, they are spoken of as ‘black.’"
          ]
        }
      ]
    }
  ]
}
