{
  "title": "CHAPTER XXV.",
  "subtitle": "VAlŚÂLÎ. THE TOPE CALLED ‘WEAPONS LAID DOWN.’ THE COUNCIL OF VAlŚÂLÎ.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "EAST from this city ten yojanas, (the travellers) came to the kingdom of Vaišâlî.",
          "North of the city so named is a large forest, having in it the double-galleried vihara[1] where Buddha dwelt, and the tope over half the body of Ânanda[2].",
          "Inside the city the woman Âmbapâli[3] built a vihara in honour of Buddha, which is now standing as it was at first.",
          "Three le south of the city, on the west of the road, (is the) garden (which) the same Âmbapâli presented to Buddha, in which he might reside.",
          "When Buddha was about to attain to his pari-nirvâṇa, as he was quitting the city by the west gate, he turned round, and, beholding the city on his right, said to them, ‘Here I have taken my last walk.’[4]",
          "Men subsequently built a tope at this spot."
        ]
      },
      {
        "sentences": [
          "Three le north-west of the city there is a tope called, 'Bows and weapons laid down.’",
          "The reason why It got that name was this:—The inferior wife of a king, whose country lay along the river Ganges, brought forth from her womb a ball of flesh.",
          "The superior wife, jealous of the other, said, ‘You have brought forth a thing of evil omen,’ and immediately it was put into a box of wood and thrown into the river.",
          "Farther down the stream another king was walking and looking about, when he saw the wooden box (floating) in the water.",
          "(He had it brought to him), opened it, and found a thousand little boys, upright and complete, and each one different from the others.",
          "He took them and had them brought up.",
          "They grew tall and large, and very daring and strong, crushing all opposition in every expedition which they undertook.",
          "By and by they attacked the kingdom of their real father, who became in consequence greatly distressed and sad.",
          "His inferior wife asked what it was that made him so, and he replied, ‘That king has a thousand sons, daring and strong beyond compare, and he wishes with them to attack my kingdom; this is what makes me sad.’",
          "The wife said, ‘You need not be sad and sorrowful. Only make a high gallery on the wall of the city on the east; and when the thieves come, I shall be able to make them retire.’",
          "The king did as she said; and when the enemies came, she said to them from the tower, ‘You are my sons; why are you acting so unnaturally and rebelliously?’",
          "They replied, ‘Who are you that say you are our mother.’",
          "‘If you do not believe me,’ she said, ‘look, all of you, towards me, and open your mouths.’",
          "She then pressed her breasts with her two hands, and each sent forth 500 jets of milk, which fell into the mouths of the thousand sons.",
          "The thieves (thus) knew that she was their mother, and laid down their bows and weapons[5].",
          "The two kings, the fathers, hereupon fell into reflection, and both got to be Pratyeka Buddhas[6].",
          "The tope of the two Pratyeka Buddhas is still existing."
        ]
      },
      {
        "sentences": [
          "In a subsequent age, when the World-honoured one had attained to perfect Wisdom (and become Buddha), he said to his disciples, ‘This is the place where I in a former age laid down my bow and weapons[7].’",
          "It was thus that subsequently men got to know (the fact), and raised the tope on this spot, which in this way received its name.",
          "The thousand little boys were the thousand Buddhas of this Bhadra-kalpa[8]."
        ]
      },
      {
        "sentences": [
          "It was by the side of the ‘Weapons-laid-down’ tope that Buddha, having given up the idea of living longer, said to Ânanda, ‘In three months from this I will attain to pari-nirvâṇa;’ and king Mâra[9] had so fascinated and stupefied Ânanda, that he was not able to ask Buddha to remain longer in this world."
        ]
      },
      {
        "sentences": [
          "Three or four le east from this place there is a tope (commemorating the following occurrence):—A hundred years after the pari-nirvâṇa of Buddha, some Bhikshus of Vaiśâlî went wrong in the matter of the disciplinary rules in ten particulars, and appealed for their justification to what they said were the words of Buddha.",
          "Here upon the Arhats and Bhikshus observant of the rules, to the number in all of 700 monks, examined afresh and collated the collection of disciplinary books[10].",
          "Subsequently men built at this place the tope (in question), which is still existing."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "It is difficult to tell what was the peculiar form of this vihâra from which it got its name; something about the construction of its door, or cupboards, or galleries."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the explanation of this in the next chapter."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Âmbapâlî, Âmrapâlî, or Âmradarikâ, ‘the guardian of the Âmra (probably the mango) tree,’ is famous in Buddhist annals.",
            "See the account of her in M. B., pp. 456-8.",
            "She was a courtesan.",
            "She had been in many nârakas or hells, was 100,000 times a female beggar, and 10,000 times a prostitute; but maintaining perfect continence during the period of Kâśyapa Buddha, Śâkyamuni’s predecessor, she had been born a devî, and finally appeared in earth under an Âmra tree in Vaiśâlî.",
            "There again she fell into her old ways, and had a son by king Bimbisâra; but she was won over by Buddha to virtue and chastity, renounced the world, and attained to the state of an Ârhat.",
            "See the earliest account of Âmbapâlî’s presentation of the garden in ‘Buddhist Suttas,’ pp. 30-33, and the note there from Bishop Bigandet on pp. 33, 34."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Beal gives, ‘In this place I have performed the last religious act of my earthly career;’ Giles, ‘This is the last place I shall visit;’ Rémusat, ‘C’est un lie où je reviendrai bien longtemps après ceci.’",
            "Perhaps the ‘walk’ to which Buddha referred has been for meditation."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the account of this legend in the note in M. B., pp. 235, 236, different, but not less absurd.",
            "The first part of Fâ-hien’s narrative will have sent the thoughts of some of my readers to the exposure of the infant Moses, as related in Exodus."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, page 40."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Thus Śâkyamuni had been one of the thousand little boys who floated in the box in the Ganges.",
            "How long back the former age was we cannot tell.",
            "I suppose the tope of the two fathers who became Pratyeka Buddhas had been built like the one commemorating the laying down of weapons after Buddha had told his disciples of the strange events in the past."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Bhadra-kalpa, ‘the Kalpa of worthies or sages.’",
            "‘This,’ says Eitel, p. 22, ‘is a designation for a Kalpa of stability, so called because 1000 Buddhas appear in the course of it.",
            "Our present period is a Bhadra-kalpa, and four Buddhas have already appeared.",
            "It is to last 236 millions of years, but over 151 millions have already elapsed.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The king of demons.’",
            "The name Mâra is explained by ‘the murderer,’ ‘the destroyer of virtue,’ and similar appellations.",
            "‘He is,’ says Eitel, ‘the personification of lust, the god of love, sin, and death, the arch-enemy of goodness, residing in the heaven Paranirmita Vaśavartin on the top of the Kâmadhâtu.",
            "He assumes different forms, especially monstrous ones, to tempt or frighten the saints, or sends his daughters, or inspires wicked men like Devadatta or the Nirgranthas to do his work.",
            "He is often represented with 100 arms, and riding on an elephant.’",
            "The oldest form of the legend in this paragraph is in ‘Buddhist Suttas,’ Sacred Books of the East, vol. xi, pp. 41-55, where Buddha says that, if Ânanda had asked him thrice, he would have postponed his death."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Or the Vinaya-piṭaka.",
            "The meeting referred to was an important one, and is generally spoken of as the second Great Council of the Buddhist Church.",
            "See, on the formation of the Buddhist Canon, Hardy’s E. M., chap, xviii, and the last chapter of Davids’ Manual, on the History of the Order.",
            "The first Council was that held at Râjagṛiha, shortly after Buddha’s death, under the presidency of Kâśyapa;—say about B.C. 410.",
            "The second was that spoken of here;—say about B.C. 300.",
            "In Davids’ Manual (p. 216) we find the ten points of discipline, in which the heretics (I can use that term here) claimed at least indulgence.",
            "Two meetings were held to consider and discuss them.",
            "At the former the orthodox party barely succeeded in carrying their condemnation of the laxer monks; and a second and larger meeting, of which Fâ-hien speaks, was held in consequence, and a more emphatic condemnation passed.",
            "At the same time all the books and subjects of discipline seem to have undergone a careful revision."
          ]
        },
        {
          "sentences": [
            "The Corean text is clearer than the Chinese as to those who composed the Council,—the Arhats and orthodox monks.",
            "The leader among them was a Yaśas, or Yaśada, or Yedśaputtra, who had been a disciple of Ânanda, and must therefore have been a very old man."
          ]
        }
      ]
    }
  ]
}
