{
  "title": "CHAPTER XXIII.",
  "subtitle": "RÂMA, AND ITS TOPE.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "EAST from Buddha’s birthplace, and at a distance of five yojanas, there is a kingdom called Râma[1].",
          "The king of this country, having obtained one portion of the relics of Buddha's body[2], returned with it and built over it a tope, named the Râma tope.",
          "By the side of it there was a pool, and in the pool a dragon, which constantly kept watch over (the tope), and presented offerings at it day and night.",
          "When king Aśoka came forth into the world, he wished to destroy the eight topes (over the relics), and to build (instead of them) 84,000 topes[3].",
          "After he had thrown down the seven (others), he wished next to destroy this tope.",
          "But then the dragon showed itself, took the king into its palace[4]; and when he had seen all the things provided for offerings, it said to him, ‘If you are able with your offerings to exceed these, you can destroy the tope, and take it all away. I will not contend with you.’",
          "The king, however, knew that such appliances for offerings were not to be had anywhere in the world, and thereupon returned (without carrying out his purpose)."
        ]
      },
      {
        "sentences": [
          "(Afterwards), the ground all about became overgrown with vegetation, and there was nobody to sprinkle and sweep (about the tope); but a herd of elephants came regularly, which brought water with their trunks to water the ground, and various kinds of flowers and incense, which they presented at the tope.",
          "(Once) there came from one of the kingdoms a devotee[5] to worship at the tope.",
          "When he encountered the elephants he was greatly alarmed, and screened himself among the trees but when he saw them go through with the offerings in the most proper manner, the thought filled him with great sadness—that there should be no monastery here, (the inmates of which) might serve the tope, but the elephants have to do the watering and sweeping.",
          "Forthwith he gave up the great prohibitions (by which he was bound)[6], and resumed the status of a Śrâmaṇera[7].",
          "With his own hands he cleared away the grass and trees, put the place in good order, and made it pure and clean.",
          "By the power of his exhortations, he prevailed on the king of the country to form a residence for monks; and when that was done, he became head of the monastery.",
          "At the present day there are monks residing in it.",
          "This event is of recent occurrence; but in all the succession from that time till now, there has always been a Śrâmaṇera head of the establishment."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Râma or Râmagrâma, between Kapilavastu and Kuśanagara."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the account of the eightfold division of the relics of Buddha’s body in the Sacred Books of the East, vol. xi, Buddhist Suttas, pp. 133-136."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The bones of the human body are supposed to consist of 84,000 atoms, and hence the legend of Aśoka's wish to build 84,000 topes, one over each atom of Śâkyamuni’s skeleton."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Fâ-hien, it appears to me, intended his readers to understand that the nâga-guardian had a palace of his own, inside or underneath the pool or tank."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "It stands out on the narrative as a whole that we have not here ‘some pilgrims,’ but one devotee."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "What the ‘great prohibitions’ which the devotee now gave up were we cannot tell.",
            "Being what he was, a monk of more than ordinary ascetical habits, he may have undertaken peculiar and difficult vows."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Śrámaṇera, or in Chinese Shâmei.",
            "See note 7, page 45."
          ]
        }
      ]
    }
  ]
}
