{
  "title": "CHAPTER XXXVI.",
  "subtitle": "IN PATNA. FÂ-HIEN’S LABOURS IN TRANSCRIPTION OF MANUSCRIPTS, AND INDIAN STUDIES FOR THREE YEARS.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FROM Varanasi (the travellers) went back east to Pâṭaliputtra.",
          "Fâ-hien’s original object had been to search for (copies of) the Vinaya.",
          "In the various kingdoms of North India, however, he had found one master transmitting orally (the rules) to another, but no written copies which he could transcribe.",
          "He had therefore travelled far and come on to Central India.",
          "Here, in the mahâyâna monastery[1], he found a copy of the Vinaya, containing the Mahâsâṅghika[2] rules,—those which were observed in the first Great Council, while Buddha was still in the world.",
          "The original copy was handed down in the Jetavana vihâra.",
          "As to the other eighteen schools[3], each one has the views and decisions of its own masters."
        ]
      },
      {
        "sentences": [
          "Those agree (with this) in the general meaning, but they have small and trivial differences, as when one opens and another shuts[4].",
          "This copy (of the rules), however, is the most complete, with the fullest explanations[5]."
        ]
      },
      {
        "sentences": [
          "He further got a transcript of the rules in six or seven thousand gâthas[6], being the sarvâstivâdaḥ[7] rules,—those which are observed by the communities of monks in the land of Ts’in; which also have all been handed down orally from master to master without being committed to writing.",
            "In the community here, moreover, he got the Saṃyuktâbhi-dharma-hṛidaya-(śâstra)[8], containing about six or seven thousand gâthas; he also got a Sûtra of 2500 gâthas; one chapter of the Parinirvâṇa-vaipulya Sûtra[9], of about 5000 gâthas; and the Mahâsâṅghikâḥ Abhidharma."
        ]
      },
      {
        "sentences": [
          "In consequence (of this success in his quest) Fâ-hien stayed here for three years, learning Sanskrit books and the Sanskrit speech, and writing out the Vinaya rules.",
          "When Tâo-ching arrived in the Central Kingdom, and saw the rules observed by the Śramaṇas, and the dignified demeanour in their societies which he remarked under all occurring circumstances, he sadly called to mind in what a mutilated and imperfect condition the rules were among the monkish communities in the land of Ts’in, and made the following aspiration:—‘From this time forth till I come to the state of Buddha, let me not be born in a frontier land[10].’",
          "He remained accordingly (in India), and did not return (to the land of Han).",
          "Fâ-hien, however, whose original purpose had been to secure the introduction of the complete Vinaya rules into the land of Han, returned there alone."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Mentioned before in chapter xxvii."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Mahâsâṅghikâḥ simply means ‘the Great Assembly,’ that is, of monks.",
            "When was this first assembly in the time of Śâkyamuni held? It does not appear that the rules observed at it were written down at the time.",
            "The document found by Fâ-hien would be a record of those rules; or rather a copy of that record.",
            "We must suppose that the original record had disappeared from the Jetavana vihâra, or Fâ-hien would probably have spoken of it when he was there, and copied it, if he had been allowed to do so."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The eighteen pû (部).",
            "Four times in this chapter the character called pû occurs, and in the first and two last instances it can only have the meaning, often belonging to it, of ‘copy.’",
            "The second instance, however, is different.",
            "How should there be eighteen copies, all different from the original, and from one another, in minor matters?",
            "We are compelled to translate—‘the eighteen schools,’ an expression well known in all Buddhist writings.",
            "See Rhys Davids’ Manual, p. 218, and the authorities there quoted."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This is equivalent to the ‘binding’ and ‘loosing,’ ‘opening’ and ‘shutting,’ which found their way into the New Testament, and the Christian Church, from the schools of the Jewish Rabbins."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "It was afterwards translated by Fâ-hien into Chinese.",
            "See Nanjio’s Catalogue of the Chinese Tripiṭaka, columns 400 and 401, and Nos. 1119 and 1150, columns 247 and 253."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A gâthâ is a stanza, generally consisting, it has seemed to me, of a few, commonly of two, lines somewhat metrically arranged; but I do not know that its length is strictly defined."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘A branch,’ says Eitel, ‘of the great vaibhâshika school, asserting the reality of all visible phenomena, and claiming the authority of Râhula.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See Nanjio’s Catalogue, No. 1287.",
            "He does not mention it in his account of Fâ-hien, who, he says, translated the Saṃyukta-piṭaka Sûtra."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Probably Nanjio’s Catalogue, No. 120: at any rate, connected with it."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This then would be the consummation of the Śramaṇa’s being,—to get to be Buddha, the Buddha of his time in his Kalpa; and Tâo-ching thought that he could attain to this consummation by a succession of births; and was likely to attain to it sooner by living only in India.",
            "If all this was not in his mind, he yet felt that each of his successive lives would be happier, if lived in India."
          ]
        }
      ]
    }
  ]
}
