{
  "title": "CHAPTER XXI.",
  "subtitle": "THE THREE PREDECESSORS OF ŚÂKYAMUNI IN THE BUDDHASHIP.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FIFTY le to the west of the city bring (the traveller) to a town named Too-wei[1], the birthplace of Kâśyapa Buddha.",
          "At the place where he and his father met[2], and at that where he attained to pari-nirvâṇa, topes were erected.",
          "Over the entire relic of the whole body of him, the Kâśyapa Tathâgata[3], a great tope was also erected."
        ]
      },
      {
        "sentences": [
          "Going on south-east from the city of Śrâvasti for twelve yojanas, (the travellers) came to a town named Na-pei-keâ[4], the birthplace of Krakuchanda Buddha[5].",
          "At the place where he and his father met, and at that where he attained to pari-nirvâṇa, topes were erected.",
          "Going north from here less than a yojana, they came to a town which had been the birthplace of Kanakamuni Buddha.",
          "At the place where he and his father met, and where he attained to pari-nirvâṇa, topes were erected."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Identified, as Beal says, by Cunningham with Tadwa, a village nine miles to the west of Sâhara-mahat.",
            "The birthplace of Kâśyapa Buddha is generally thought to have been Benâres.",
            "According to a calculation of Rémusat, from his birth to A.D. 1832 there were 1,992,859 years!"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "It seems to be necessary to have a meeting between every Buddha and his father.",
            "One at least is ascribed to Śákyamuni and his father (real or supposed) Šuddhodana."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This is the highest epithet given to every supreme Buddha; in Chinese 如夾, meaning, as Eitel, p. 147, says, ‘Sic profectus sum.’",
            "It is equivalent to ‘Rightful Buddha, the true successor in the Supreme Buddha Line.’",
            "Hardy concludes his account of the Kâśyapa Buddha (M. B., p. 97) with the following sentence:—‘After his body was burnt, the bones still remained in their usual position, presenting the appearance of a perfect skeleton; and the whole of the inhabitants of Jambudvîpa, assembling together, erected a dagoba over his relics one yojana in height!’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Na-pei-keâ or Nabhiga is not mentioned elsewhere.",
            "Eitel says this Buddha was born at the city of Gân-ho (安如城), and Hardy gives his birthplace, as Mekhala.",
            "It may be possible, by means of Sanskrit, to reconcile these statements."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, p. 51."
          ]
        }
      ]
    }
  ]
}
