{
  "title": "CHAPTER IX.",
  "subtitle": "SOO-HO-TO. LEGEND OF BUDDHA.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "IN that country also Buddhism[1] is flourishing.",
          "There is in it the place where Śakra[2], Ruler of Devas, in a former age[3], tried the Bodhisattva, by producing[4] a hawk (in pursuit of a) dove, when (the Bodhisattva) cut off a piece of his own flesh, and (with it) ransomed the dove.",
          "After Buddha had attained to perfect wisdom[5], and in travelling about with his disciples (arrived at this spot), he informed them that this was the place where he ransomed the dove with a piece of his own flesh.",
          "In this way the people of the country became aware of the fact, and on the spot reared a tope, adorned with layers[6] of gold and silver plates."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Buddhism stands for the two Chinese characters 佛法, ‘the Law of Buddha,’ and to that rendering of the phrase, which is of frequent occurrence, I will in general adhere.",
            "Buddhism is not an adequate rendering of them any more than Christianity would be of τὸ εὐαγγέλιον Χριστοῦ.",
            "The Fâ or Law is the equivalent of dharma comprehending all in the first Basket of the Buddhist teaching,—as Dr. Davids says (Hibbert Lectures, p. 44), ‘its ethics and philosophy, and its system of self-culture;’ with the theory of karma, it seems to me, especially underlying it.",
            "It has been pointed out (Cunningham’s ‘Bhilsa Topes,’ p. 102) that dharma is the keystone of all king Priyadarśi or Aśoka’s edicts.",
            "The whole of them are dedicated to the attainment of one object, ‘the advancement of dharma, or of the Law of Buddha.’",
            "His native Chinese afforded no better character than 法 or Law, by which our author could express concisely his idea of the Buddhistic system, as ‘a law of life,’ a directory or system of Rules, by which men could attain to the consummation of their being."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Śakra is a common name for the Brahmanic Indra, adopted by Buddhism into the circle of its own great adherents;—it has been said, ‘because of his popularity.’",
            "He is generally styled, as here, T’een Ti, ‘God or Ruler of Devas.’",
            "He is now the representative of the secular power, the valiant protector of the Buddhist body, but is looked upon as inferior to Śâkyamuni, and every Buddhist saint.",
            "He appears several times in Fâ-hien’s narrative. E. H., pp. 108 and 46."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Chinese character is 昔, ‘formerly,’ and is often, as in the first sentence of the narrative, simply equivalent to that adverb.",
            "At other times it means, as here, ‘in a former age,’ some pre-existent state in the time of a former birth.",
            "The incident related is ‘a Jâtaka story.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "It occurs at once to a translator to render the characters 化作 by ‘changed himself to.’",
            "Such is often their meaning in the sequel, but their use in chapter xxiv may be considered as a crucial test of the meaning which I have given to them here."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "That is, had become Buddha, or completed his course (放道)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This seems to be the contribution of 校 (or 挍), to the force of the binomial 校飾, which is continually occurring."
          ]
        }
      ]
    }
  ]
}
