{
  "title": "CHAPTER XVI.",
  "subtitle": "ON TO MATHURÂ OR MUTTRA. CONDITION AND CUSTOMS OF CENTRAL INDIA; OF THE MONKS, VIHÂRAS, AND MONASTERIES.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FROM this place they travelled south-east, passing by a succession of very many monasteries, with a multitude of monks, who might be counted by myriads.",
          "After passing all these places, they came to a country named Ma-t’âou-lo[1].",
          "They still followed the course of the P’oo-na[2] river, on the banks of which, left and right, there were twenty monasteries, which might contain three thousand monks; and (here) the Law of Buddha was still more flourishing.",
          "Everywhere, from the Sandy Desert, in all the countries of India, the kings had been firm believers in that Law.",
          "When they make their offerings to a community of monks, they take off their royal caps, and along with their relatives and ministers, supply them with food with their own hands.",
          "That done, (the king) has a carpet spread for himself on the ground, and sits down on it in front of the chairman;—they dare not presume to sit on couches in front of the community.",
          "The laws and ways, according to which the kings presented their offerings when Buddha was in the world, have been handed down to the present day."
        ]
      },
      {
        "sentences": [
          "All south from this is named the Middle Kingdom[3].",
          "In it the cold and heat are finely tempered, and there is neither hoarfrost nor snow.",
          "The people are numerous and happy; they have not to register their households, or attend to any magistrates and their rules; only those who cultivate the royal land have to pay (a portion of) the gain from it.",
          "If they want to go, they go; if they want to stay on, they stay.",
          "The king governs without decapitation or (other) corporal punishments.",
          "Criminals are simply fined, lightly or heavily, according to the circumstances (of each case).",
          "Even in cases of repeated attempts at wicked rebellion, they only have their right hands cutoff.",
          "The king’s body-guards and attendants all have salaries.",
          "Throughout the whole country the people do not kill any living creature, nor drink intoxicating liquor, nor eat onions or garlic.",
          "The only exception is that of the Chaṇḍâlas[4].",
          "That is the name for those who are (held to be) wicked men, and live apart from others.",
          "When they enter the gate of a city or a market-place, they strike a piece of wood to make themselves known, so that men know and avoid them, and do not come into contact with them.",
          "In that country they do not keep pigs and fowls, and do not sell live cattle; in the markets there are no butchers’ shops and no dealers in intoxicating drink.",
          "In buying and selling commodities they use cowries[5].",
          "Only the Chaṇḍâlas are fishermen and hunters, and sell flesh meat."
        ]
      },
      {
        "sentences": [
          "After Buddha attained to pari-nirvâṇa[6] the kings of the various countries and the heads of the Vaiśyas[7] built vihâras for the priests, and endowed them with fields, houses, gardens, and orchards, along with the resident populations and their cattle, the grants being engraved on plates of metal[8], so that afterwards they were handed down from king to king, without any one daring to annul them, and they remain even to the present time."
        ]
      },
      {
        "sentences": [
          "The regular business of the monks is to perform acts of meritorious virtue, and to recite their Sûtras and sit wrapt in meditation.",
          "When stranger monks arrive (at any monastery), the old residents meet and receive them, carry for them their clothes and alms-bowl, give them water to wash their feet, oil with which to anoint them, and the liquid food permitted out of the regular hours[9].",
          "When (the stranger) has enjoyed a very brief rest, they further ask the number of years that he has been a monk, after which he receives a sleeping apartment with its appurtenances, according to his regular order, and everything is done for him which the rules prescribe[10]."
        ]
      },
      {
        "sentences": [
          "Where a community of monks resides, they erect topes to Śàriputtra[11], to Mahâ-maudgalyâyana[12], and to Ânanda[13], and also topes (in honour) of the Abhidharma, the Vinaya, and the Sûtras[14] A month after the (annual season of) rest, the families which are looking out for blessing stimulate one another[15] to make offerings to the monks, and send round to them the liquid food which may be taken out of the ordinary hours.",
          "All the monks come together in a great assembly, and preach the Law[16]; after which offerings are presented at the tope of Śâriputtra, with all kinds of flowers and incense.",
          "All through the night lamps are kept burning, and skilful musicians are employed to perform.[17]"
        ]
      },
      {
        "sentences": [
          "When Śâriputtra was a great Brahman, he went to Buddha, and begged (to be permitted) to quit his family (and become a monk).",
          "The great Mugalan and the great Kaśyapa[18] also did the same.",
          "The bhikshuṇîs[19] for the most part make their offerings at the tope of Ânanda, because it was he who requested the World-honoured one to allow females to quit their families (and become nuns).",
          "The Śrâmaṇeras[20] mostly make their offerings to Râhula[21].",
          "The professors of the Abhidharma make their offerings to it; those of the Vinaya[22] to it.",
          "Every year there is one such offering, and each class has its own day for it.",
          "Students of the mahâyâna present offerings to the Prajñâ-pâramitâ[23], to Mañjuśrî[24], and to Kwan-she-yin[25].",
          "When the monks have done receiving their annual tribute (from the harvests)[26], the Heads of the Vaiśyas and all the Brahmans bring clothes and such other articles as the monks require for use, and distribute among them.",
          "The monks, having received them, also proceed to give portions to one another.",
          "From the nirvâṇa of Buddha[27], the forms of ceremony, laws, and rules, practised by the sacred communities, have been handed down from one generation to another without interruption."
        ]
      },
      {
        "sentences": [
          "From the place where (the travellers) crossed the Indus to South India, and on to the Southern Sea, a distance of forty or fifty thousand le, all is level plain.",
          "There are no large hills with streams (among them) there are simply the waters of the rivers."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Muttra, ‘the peacock city;’ lat. 27° 30' N., lon. 77° 43' E. (Hunter); the birthplace of Kṛishṇa, whose emblem is the peacock."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This must be the Jumna, or Yamunâ.",
            "Why it is called, as here, the P’oo-na has yet to be explained."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In Pâli, Majjhima-desa, ‘the Middle Country.’",
            "See Davids’ ‘Buddhist Birth Stories,’ page 6r, note."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Eitel (pp. 145, 6) says, ‘The name Chaṇḍâlas is explained by “butchers,” “wicked men,” and those who carry “the awful flag,” to warn off their betters;—the lowest and most despised caste of India, members of which, however, when converted, were admitted even into the ranks of the priesthood.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘Cowries;’ 貝齒, not ‘shells and ivory,’ as one might suppose; but cowries alone, the second term entering into the name from the marks inside the edge of the shell, resembling ‘the teeth of fishes.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, page 33, Buddha’s pari-nirvâṇa is equivalent to Buddha’s death."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 1, page 38.",
            "The order of the characters is different here, but with the same meaning."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the preparation of such a deed of grant in a special case, as related in chap, xxxix.",
            "No doubt in Fâ-hien’s time, and long before and after it, it was the custom to engrave such deeds on plates of metal."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘No monk can eat solid food except between sunrise and noon,’ and total abstinence from intoxicating drinks is obligatory (Davids’ Manual, p. 163).",
            "Food eaten at any other part of the day is called vikâla, and forbidden; but a weary traveller might receive unseasonable refreshment, consisting, as Watters has shown (Ch. Rev. viii. 282), of honey, butter, treacle, and sesamum oil."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The expression here is somewhat perplexing; but it occurs again in chap, xxxviii and the meaning is clear.",
            "See Watters, Ch. Rev. viii. 282, 3.",
            "The rules are given at length in the Sacred Books of the East, vol. xx, p. 272 and foll., and p. 279 and foll."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Śâriputtra (Singh. Seriyut) was one of the principal disciples of Buddha, and indeed the most learned and ingenious of them all, so that he obtained the title of 智慧, ‘knowledge and wisdom.’",
            "He is also called Buddha’s ‘right-hand attendant.’",
            "His name is derived from that of his mother Śârikâ, the wife of Tishya, a native of Nalanda.",
            "In Spence Hardy, he often appears under the name of Upatissa (Upa-tishya), derived from his father.",
            "Several Śâstras are ascribed to him, and indeed the followers of the Abhidharma look on him as their founder.",
            "He died before Śâkyamuni; but is to reappear as a future Buddha.",
            "Eitel, pp. 123, 124."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Mugalan, the Singhalese name of this disciple, is more pronounceable.",
            "He also was one of the principal disciples, called Buddha’s ‘left-hand attendant.’",
            "He was distinguished for his power of vision, and his magic powers.",
            "The name in the text is derived from the former attribute, and it was by the latter that he took up an artist to Tushita to get a view of Śâkyamuni, and so make a statue of him.",
            "(Compare the similar story in chap, vi.)",
            "He went to hell, and released his mother.",
            "He also died before Śâkyamuni, and is to reappear as Buddha.",
            "Eitel, p. 65."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 2, page 33."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The different parts of the tripiṭaka.",
            "See note 2, page 10."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A passage rather difficult to construe.",
            "The ‘families’ would be those more devout than their neighbours."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "One rarely hears this preaching in China.",
            "It struck me most as I once heard it at Osaka in Japan.",
            "There was a pulpit in a large hall of the temple, and the audience sat around on the matted floor.",
            "One priest took the pulpit after another; and the hearers nodded their heads occasionally, and indicated their sympathy with a sentiment now and then by an audible ‘h’m,’ which reminded me of Carlyle’s description of meetings of ‘The Ironsides’ of Cromwell."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This last statement is wanting in the Chinese editions."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "There was a Kaśyapa Buddha, anterior to Śâkyamuni.",
            "But this Mahâkaśyapa was a Brahman of Magadha, who was converted by Buddha, and became one of his disciples.",
            "He took the lead after Śâkyamuni’s death, convoked and directed the first synod, from which his title of Arya-sthavira is derived.",
            "As the first compiler of the Canon, he is considered the fountain of Chinese orthodoxy, and counted as the first patriarch.",
            "He also is to be reborn as a Buddha.",
            "Eitel, p. 64."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The bhikshuṇîs are the female monks or nuns, subject to the same rules as the bhikshus, and also to special ordinances of restraint.",
            "See Hardy’s E. M., chap. 17.",
            "See also Sacred Books of the East, vol. xx, p. 321."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Śrâmaṇeras are the novices, male or female, who have vowed to observe the Shikshâpada, or ten commandments.",
            "Fâ-hien was himself one of them from his childhood.",
            "Having heard the Trîsharaṇa, or threefold formula of Refuge,—‘I take refuge in Buddha; the Law; the Church,—the novice undertakes to observe the ten precepts that forbid—(1) destroying life; (2) stealing; (3) impurity; (4) lying; (5) intoxicating drinks; (6) eating after midday; (7) dancing, singing, music, and stage-plays; (8) garlands, scents, unguents, and ornaments; (9) high or broad couches; (10) receiving gold or silver.’",
            "Davids’ Manual, p. 160; Hardy’s E. M., pp. 23, 24."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The eldest son of Śakyamuni by Yaśodharâ.",
            "Converted to Buddhism, he followed his father as an attendant; and after Buddha’s death became the founder of a philosophical realistic school (vaibhâshika).",
            "He is now revered as the patron saint of all novices, and is to be reborn as the eldest son of every future Buddha.",
            "Eitel, p. 101.",
            "His mother also is to be reborn as Buddha."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Note 1, page 45."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "There are six (sometimes increased to ten) pâramitâs, ‘means of passing to nirvâṇa:—Charity; morality; energy; tranquil contemplation; wisdom (prajñâ); made up to ten by use of the proper means; science; pious vows; and force of purpose.",
            "But it is only prajñâ which carries men across the saṃsâra to the shores of nirvâṇa.’ Eitel, p. 90."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "According to Eitel (pp. 71, 72), ‘A famous Bodhisattva, now specially worshipped in Shan-se, whose antecedents are a hopeless jumble of history and fable.",
            "Fâ-hien found him here worshipped by followers of the mahâyâna school; but Hsüan-chwang connects his worship with the yogachara or tantra-magic school.",
            "The mahâyâna school regard him as the apotheosis of perfect wisdom.",
            "His most common titles are Mahâmati, “Great wisdom,” and Kumâra-râja, “King of teaching, with a thousand arms and a hundred alms-bowls.”’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Kwan-she-yin and the dogmas about him or her are as great a mystery as Mañjuśrî.",
            "The Chinese name is a mistranslation of the Sanskrit name Avalokiteśvara, ‘On-looking Sovereign,’ or even ‘On-looking Self-Existent,’ and means ‘Regarding or Looking on the sounds of the world,’=‘Hearer of Prayer.’",
            "Originally, and still in Thibet, Avalokiteśvara had only male attributes, but in China and Japan (Kwannon), this deity (such popularly she is) is represented as a woman, ‘Kwan-yin, the greatly gentle, with a thousand arms and a thousand eyes;’ and has her principal seat in the island of P’oo-t’oo, on the China coast, which is a regular place of pilgrimage.",
            "To the worshippers of whom Fâ-hien speaks, Kwan-she-yin would only be Avalokiteśvara.",
            "How he was converted into the ‘goddess of mercy,’ and her worship took the place which it now has in China, is a difficult inquiry which would take much time and space, and not be brought after all, so far as I see, to a satisfactory conclusion.",
            "See Eitel’s Handbook, pp. 18-20, and his Three Lectures on Buddhism (third edition), pp. 1 24-131.",
            "I was talking on the subject once with an intelligent Chinese gentleman, when he remarked, ‘Have you not much the same thing in Europe in the worship of Mary?’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Compare what is said in chap. v."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This nirvâṇa of Buddha must be—not his death, but his attaining to Buddhaship."
          ]
        }
      ]
    }
  ]
}
