{
  "title": "CHAPTER XXXIX.",
  "subtitle": "CREMATION OF AN ARHAT. SERMON OF A DEVOTEE.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "SOUTH of the city seven le there is a vihâra, called the Mahâ-vihâra, where 3000 monks reside.",
          "There had been among them a Śramaṇa, of such lofty virtue, and so holy and pure in his observance of the disciplinary rules, that the people all surmised that he was an Arhat.",
          "When he drew near his end, the king came to examine into the point; and having assembled the monks according to rule, asked whether the bhikshu had attained to the full degree of Wisdom[1].",
          "They answered in the affirmative, saying that he was an Arhat.",
          "The king accordingly, when he died, buried him after the fashion of an Arhat, as the regular rules prescribed."
        ]
      },
      {
        "sentences": [
          "Four or five le east from the vihâra there was reared a great pile of firewood, which might be more than thirty cubits square, and the same in height.",
          "Near the top were laid sandal, aloe, and other kinds of fragrant wood."
        ]
      },
      {
        "sentences": [
          "On the four sides (of the pile) they made steps by which to ascend it.",
          "With clean white hair-cloth, almost like silk, they wrapped (the body) round and round[2].",
          "They made a large carriage-frame, in form like our funeral car, but without the dragons and fishes[3]."
        ]
      },
      {
        "sentences": [
          "At the time of the cremation, the king and the people, in multitudes from all quarters, collected together, and presented offerings of flowers and incense.",
          "While they were following the car to the burial-ground[4], the king himself presented flowers and incense.",
          "When this was finished, the car was lifted on the pile, all over which oil of sweet basil was poured, and then a light was applied.",
          "While the fire was blazing, every one, with a reverent heart, pulled off his upper garment, and threw it, with his feather-fan and umbrella, from a distance into the midst of the flames, to assist the burning.",
          "When the cremation was over, they collected and preserved the bones, and proceeded to erect a tope.",
          "Fâ-hien had not arrived in time (to see the distinguished Shaman) alive, and only saw his burial."
        ]
      },
      {
        "sentences": [
          "At that time the king[5], who was a sincere believer in the Law of Buddha and wished to build a new vihâra for the monks, first convoked a great assembly.",
          "After giving the monks a meal of rice, and presenting his offerings (on the occasion), he selected a pair of first-rate oxen, the horns of which were grandly decorated with gold, silver, and the precious substances.",
          "A golden plough had been provided, and the king himself turned up a furrow on the four sides of the ground within which the building was to be.",
          "He then endowed the community of the monks with the population, fields, and houses, writing the grant on plates of metal, (to the effect) that from that time onwards, from generation to generation, no one should venture to annul or alter it."
        ]
      },
      {
        "sentences": [
          "In this country Fâ-hien heard an Indian devotee, who was reciting a Sûtra from the pulpit, say: —‘Buddha’s alms-bowl was at first in Vaiśâlî, and now it is in Gandhâra[6]. After so many hundred years’ (he gave, when Fâ-hien heard him, the exact number of years, but he has forgotten it), ‘it will go to Western Tukhâra[7]; after so many hundred years, to Khoten; after so many hundred years, to Kharachar[8]; after so many hundred years, to the land of Han; after so many hundred years, it will come to Siṉhala; and after so many hundred years, it will return to Central India. After that, it will ascend to the Tushita heaven; and when the Bodhisattva Maitreya sees it, he will say with a sigh, “The alms-bowl of Śâkyamuni Buddha is come;” and with all the devas he will present to it flowers and incense for seven days. When these have expired, it will return to Jambudvîpa, where it will be received by the king of the sea nâgas, and taken into his nâga palace. When Maitreya shall be about to attain to perfect Wisdom (and become Buddha), it will again separate into four bowls[9], which will return to the top of mount Anna, whence they came. After Maitreya has become Buddha, the four deva kings will again think of the Buddha (with their bowls as they did in the case of the previous Buddha). The thousand Buddhas of this Bhadra-kalpa, indeed, will all use the same alms-bowl; and when the bowl has disappeared, the Law of Buddha will go on gradually to be extinguished. After that extinction has taken place, the life of man will be shortened, till it is only a period of five years. During this period of a five years’ life, rice, butter, and oil will all vanish away, and men will become exceedingly wicked. The grass and trees which they lay hold of will change into swords and clubs, with which they will hurt, cut, and kill one another. Those among them on whom there is blessing will withdraw from society among the hills; and when the wicked have exterminated one another, they will again come forth, and say among themselves, “The men of former times enjoyed a very great longevity; but through becoming exceedingly wicked, and doing all lawless things, the length of our life has been shortened and reduced even to five years. Let us now unite together in the practice of what is good, cherishing a gentle and sympathising heart, and carefully cultivating good faith and righteousness. When each one in this way practises that faith and righteousness, life will go on to double its length till it reaches 80,000 years. When Maitreya appears in the world, and begins to turn the wheel of his Law, he will in the first place save those among the disciples of the Law left by the Śakya who have quitted their families, and those who have accepted the three Refuges, undertaken the five Prohibitions and the eight Abstinences, and given offerings to the three Precious Ones; secondly and thirdly, he will save those between whom and conversion there is a connexion transmitted from the past[10].”’"
        ]
      },
      {
        "sentences": [
          "(Such was the discourse), and Fâ-hien wished to write it down as a portion of doctrine; but the man said, ‘This is taken from no Sûtra, it is only the utterance of my own mind.’"
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Possibly, ‘and asked the bhikshu,’ &c.",
            "I prefer the other way of construing, however."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "It seems strange that this should have been understood as a wrapping of the immense pyre with the cloth.",
            "There is nothing in the text to necessitate such a version, but the contrary.",
            "Compare ‘Buddhist Suttas,’ pp. 92, 93."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the description of a funeral car and its decorations in the Sacred Books of the East, vol. xxviii, the Lî Kî, Book XIX.",
            "Fâ-hien’s 此間, ‘in this (country),’ which I have expressed by ‘our,’ shows that whatever notes of this cremation he had taken at the time, the account in the text was composed after his return to China, and when he had the usages there in his mind and perhaps before his eyes.",
            "This disposes of all difficulty occasioned by the ‘dragons’ and ‘fishes.’",
            "The 耳 at the end is merely the concluding particle."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The pyre served the purpose of a burial-ground or grave, and hence our author writes of it as such."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This king must have been Mahâ-nâna (A. D. 410-432).",
            "In the time of his predecessor, Upatissa (A.D. 368-410), the piṭakas were first translated into Singhalese.",
            "Under Mahâ-nâna, Buddhaghosha wrote his commentaries.",
            "Both were great builders of vihâras.",
            "See the Mahâvaṉśa, pp. 247, foll."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See chapter xii.",
            "Fâ-hien had seen it at Purushapura, which Eitel says was ‘the ancient capital of Gandhâra.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Western Tukhâra (西月支) same probably as the Tukhâra (月支) of chapter xii, a king of which is there described as trying to carry off the bowl from Purushapura."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "North of the Bosteng lake at the foot of the Thien-shan range (E. H., p. 56)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, p. 35.",
            "Instead of ‘Anna’ the Chinese recensions have Vîna; but Vîna or Vînataka, and Ana for Sudarśana are names of one or other of the concentric circles of rocks surrounding mount Meru, the fabled home of the deva guardians of the bowl."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "That is, those whose Karma in the past should be rewarded by such conversion in the present."
          ]
        }
      ]
    }
  ]
}
