{
  "title": "CHAPTER XXXII.",
  "subtitle": "LEGEND OF KING AŚOKA IN A FORMER BIRTH, AND HIS NARAKA.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "WHEN king Aśoka, in a former birth[1], was a little boy and playing on the road, he met Kaśyapa Buddha walking.",
          "(The stranger) begged food, and the boy pleasantly took a handful of earth and gave it to him.",
          "The Buddha took the earth, and returned it to the ground on which he was walking; but because of this (the boy) received the recompense of becoming a king of the iron wheel[2], to rule over Jambudvîpa.",
          "(Once) when he was making a judicial tour of inspection through Jambudvîpa, he saw, between the iron circuit of the two hills, a naraka[3] for the punishment of wicked men.",
          "Having there upon asked his ministers what sort of a thing it was, they replied, ‘It belongs to Yama[4], king of demons, for punishing wicked people.’",
          "The king thought within himself:—‘(Even) the king of demons is able to make a naraka in which to deal with wicked men; why should not I, who am the lord of men, make a naraka in which to deal with wicked men?’ He forthwith asked his ministers who could make for him a naraka and preside over the punishment of wicked people in it.",
          "They replied that it was only a man of extreme wickedness who could make it; and the king thereupon sent officers to seek everywhere for (such) a bad man; and they saw by the side of a pond a man tall and strong, with a black countenance, yellow hair, and green eyes, hooking up the fish with his feet, while he called to him birds and beasts, and, when they came, then shot and killed them, so that not one escaped.",
          "Having got this man, they took him to the king, who secretly charged him, ‘You must make a square enclosure with high walls.",
          "Plant in it all kinds of flowers and fruits; make good ponds in it for bathing; make it grand and imposing in every way, so that men shall look to it with thirsting desire; make its gates strong and sure; and when any one enters, instantly seize him and punish him as a sinner, not allowing him to get out.",
          "Even if I should enter, punish me as a sinner in the same way, and do not let me go.",
          "I now appoint you master of that naraka.’"
        ]
      },
      {
        "sentences": [
          "Soon after this a bhikshu, pursuing his regular course of begging his food, entered the gate (of the place).",
          "When the lictors of the naraka saw him, they were about to subject him to their tortures; but he, frightened, begged them to allow him a moment in which to eat his midday meal.",
          "Immediately after, there came in another man, whom they thrust into a mortar and pounded till a red froth overflowed.",
          "As the bhikshu looked on, there came to him the thought of the impermanence, the painful suffering and inanity of this body, and how it is but as a bubble and as foam; and instantly he attained to Arhatship.",
          "Immediately after, the lictors seized him, and threw him into a caldron of boiling water.",
          "There was a look of joyful satisfaction, however, in the bhikshu’s countenance.",
          "The fire was extinguished, and the water became cold.",
          "In the middle (of the caldron) there rose up a lotus flower, with the bhikshu seated on it.",
          "The lictors at once went and reported to the king that there was a marvellous occurrence in the naraka, and wished him to go and see it; but the king said, ‘I formerly- made such an agreement that now I dare not go (to the place).’",
          "The lictors said, ‘This is not a small matter. Your majesty ought to go quickly. Let your former agreement be altered.’",
          "The king thereupon followed them, and entered (the naraka), when the bhikshu preached the Law to him, and he believed, and was made free[5].",
          "Forthwith he demolished the naraka, and repented of all the evil which he had formerly done.",
          "From this time he believed in and honoured the Three Precious Ones, and constantly went to a patra tree, repenting under it, with self-reproach, of his errors, and accepting the eight rules of abstinence[6]."
        ]
      },
      {
        "sentences": [
          "The queen asked where the king was constantly going to, and the ministers replied that he was constantly to be seen under (such and such) a patra tree.",
          "She watched for a time when the king was not there, and then sent men to cut the tree down.",
          "When the king came, and saw what had been done, he swooned away with sorrow, and fell to the ground.",
          "His ministers sprinkled water on his face, and after a considerable time he revived.",
          "He then built all round (the stump) with bricks, and poured a hundred pitchers of cows’ milk on the roots; and as he lay with his four limbs spread out on the ground, he took this oath, ‘If the tree do not live, I will never rise from this.’",
          "When he had uttered this oath, the tree immediately began to grow from the roots, and it has continued to grow till now, when it is nearly 100 cubits in height."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Here is an instance of 昔 used, as was pointed out in note 3, page 30, for a former age; and not merely a former time.",
            "Perhaps ‘a former birth’ is the best translation.",
            "The Corean reading of Kaśyapa Buddha is certainly preferable to the Chinese ‘Śâkya Buddha.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 3, p. 49."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "I prefer to retain the Sanskrit term here, instead of translating the Chinese text by ‘Earth’s prison (地獄),’ or ‘a prison in the earth;’ the name which has been adopted generally by Christian missionaries in China for gehenna and hell."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Eitel (p. 173) says:—‘Yama was originally the Âryan god of the dead, living in a heaven above the world, the regent of the south; but Brahmanism transferred his abode to hell. Both views have been retained by Buddhism.’",
            "The Yama of the text is the ‘regent of the narakas, residing south of Jambudvîpa, outside the Chakravâlas (the double circuit of mountains above), in a palace built of brass and iron, He has a sister who controls all the female culprits, as he exclusively deals with the male sex. Three times, however, in every twenty- four hours, a demon pours boiling copper into Yama’s mouth, and squeezes it down his throat, causing him unspeakable pain.’",
            "Such, however, is the wonderful ‘transrotation of births,’ that when Yama’s sins have been expiated, he is to be reborn as Buddha, under the name of ‘The Universal King.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Or, ‘was loosed;’ from the bonds, I suppose, of various illusions."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "I have not met with this particular numerical category."
          ]
        }
      ]
    }
  ]
}
