{
  "title": "CHAPTER XL.",
  "subtitle": "AFTER TWO YEARS TAKES SHIP FOR CHINA. DISASTROUS PASSAGE TO JAVA; AND THENCE TO CHINA; ARRIVES AT SHAN-TUNG; AND GOES TO NANKING. CONCLUSION OR L’ENVOI BY ANOTHER WRITER.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FÂ-HIEN abode in this country two years; and, in addition (to his acquisitions in Patna), succeeded in getting a copy of the Vinaya-piṭaka of the Mahîśâsakâḥ (school)[1]; the Dîrghâgama and Saṃyuktâgama[2] (Sûtras); and also the Saṃyukta-sañchaya-piṭaka[3];—all being works unknown in the land of Han.",
          "Having obtained these Sanskrit works, he took passage in a large merchantman, on board of which there were more than 200 men, and to which was attached by a rope a smaller vessel, as a provision against damage or injury to the large one from the perils of the navigation.",
          "With a favourable wind, they proceeded eastwards for three days, and then they encountered a great wind.",
          "The vessel sprang a leak and the water came in.",
          "The merchants wished to go to the smaller vessel; but the men on board it, fearing that too many would come, cut the connecting rope.",
          "The merchants were greatly alarmed, feeling their risk of instant death.",
          "Afraid that the vessel would fill, they took their bulky goods and threw them into the water.",
          "Fâ-hien also took his pitcher[4] and washing-basin, with some other articles, and cast them into the sea; but fearing that the merchants would cast overboard his books and images, he could only think with all his heart of Kwan-she-yin[5], and commit his life to (the protection of) the church of the land of Han[6], (saying in effect), ‘I have travelled far in search of our Law. Let me, by your dread and supernatural (power), return from my wanderings, and reach my resting-place!’"
        ]
      },
      {
        "sentences": [
          "In this way the tempest[7] continued day and night, till on the thirteenth day the ship was carried to the side of an island, where, on the ebbing of the tide, the place of the leak was discovered, and it was stopped, on which the voyage was resumed.",
          "On the sea (hereabouts) there are many pirates, to meet with whom is speedy death.",
          "The great ocean spreads out, a boundless expanse.",
          "There is no knowing east or west; only by observing the sun, moon, and stars was it possible to go forward.",
          "If the weather were dark and rainy, (the ship) went as she was carried by the wind, without any definite course.",
          "In the darkness of the night, only the great waves were to be seen, breaking on one another, and emitting a brightness like that of fire, with huge turtles and other monsters of the deep (all about).",
          "The merchants were full of terror, not knowing where they were going.",
          "The sea was deep and bottomless, and there was no place where they could drop anchor and stop.",
          "But when the sky became clear, they could tell east and west, and (the ship) again went forward in the right direction.",
          "If she had come on any hidden rock, there would have been no way of escape."
        ]
      },
      {
        "sentences": [
          "After proceeding in this way for rather more than ninety days, they arrived at a country called Java-dvîpa, where various forms of error and Brahmanism are flourishing, while Buddhism in it is not worth speaking of.",
          "After staying there for five months, (Fâ-hien) again embarked in another large merchantman, which also had on board more than 200 men.",
          "They carried provisions for fifty days, and commenced the voyage on the sixteenth day of the fourth month."
        ]
      },
      {
        "sentences": [
          "Fâ-hien kept his retreat on board the ship.",
          "They took a course to the north-east, intending to fetch Kwang-chow.",
          "After more than a month, when the night-drum had sounded the second watch, they encountered a black wind and tempestuous rain, which threw the merchants and passengers into consternation.",
          "Fâ-hien again with all his heart directed his thoughts to Kwan-she-yin and the monkish communities of the land of Han; and, through their dread and mysterious protection, was preserved to day-break.",
          "After day-break, the Brahmans deliberated together and said, ‘It is having this Śraṃana on board which has occasioned our misfortune and brought us this great and bitter suffering. Let us land the bhikshu and place him on some island-shore. We must not for the sake of one man allow ourselves to be exposed to such imminent peril.’",
          "A patron of Fâ-hien, however, said to them, ‘If you land the bhikshu, you must at the same time land me; and if you do not, then you must kill me. If you land this Śraṃana, when I get to the land of Han, I will go to the king, and inform against you. The king also reveres and believes the Law of Buddha, and honours the bhikshus.’",
          "The merchants here upon were perplexed, and did not dare immediately to land (Fâ-hien)."
        ]
      },
      {
        "sentences": [
          "At this time the sky continued very dark and gloomy, and the sailing-masters looked at one another and made mistakes.",
          "More than seventy days passed (from their leaving Java), and the provisions and water were nearly exhausted.",
          "They used the salt-water of the sea for cooking, and carefully divided the (fresh) water, each man getting two pints.",
          "Soon the whole was nearly gone, and the merchants took counsel and said, ‘At the ordinary rate of sailing we ought to have reached Kwang-chow, and now the time is passed by many days;—must we not have held a wrong course?’ Immediately they directed the ship to the north-west, looking out for land; and after sailing day and night for twelve days, they reached the shore on the south of mount Lâo, on the borders of the prefecture of Ch’ang-kwang[8], and immediately got good water and vegetables.",
          "They had passed through many perils and hardships, and had been in a state of anxious apprehension for many days together; and now suddenly arriving at this shore, and seeing those (well-known) vegetables, the lei and kwoh[9], they knew indeed that it was the land of Han.",
          "Not seeing, however, any inhabitants nor any traces of them, they did not know whereabouts they were.",
          "Some said that they had not yet got to Kwang-chow, and others that they had passed it.",
          "Unable to come to a definite conclusion, (some of them) got into a small boat and entered a creek, to look for some one of whom they might ask what the place was.",
          "They found two hunters, whom they brought back with them, and then called on Fâ-hien to act as interpreter and question them.",
          "Fâ-hien first spoke assuringly to them, and then slowly and distinctly asked them, ‘Who are you?’",
          "They replied, ‘We are disciples of Buddha?’",
          "He then asked, ‘What are you looking for among these hills?’",
          "They began to lie[10], and said, ‘To-morrow is the fifteenth day of the seventh month. We wanted to get some peaches to present[11] to Buddha.’",
          "He asked further, ‘What country is this?’",
          "They replied, ‘This is the border of the prefecture of Ch’ang-kwang, a part of Ts’ing-chow under the (ruling) House of Tsin.’",
          "When they heard this, the merchants were glad, immediately asked for (a portion of) their money and goods, and sent men to Ch’ang-kwang city."
        ]
      },
      {
        "sentences": [
          "The prefect Le E was a reverent believer in the Law of Buddha.",
          "When he heard that a Śraṃana had arrived in a ship across the sea, bringing with him books and images, he immediately came to the sea-shore with an escort to meet (the traveller), and receive the books and images, and took them back with him to the seat of his government.",
          "On this the merchants went back in the direction of Yang-chow[12]; (but) when (Fâ-hien) arrived at Ts’ing-chow, (the prefect there)[13] begged him (to remain with him) for a winter and a summer.",
          "After the summer retreat was ended, Fâ-hien, having been separated for a long time from his (fellow-)masters, wished- to hurry to Ch’ang-gan; but as the business which he had in hand was important, he went south to the Capital[14]; and at an interview with the masters (there) exhibited the Sûtras and the collection of the Vinaya (which he had procured)."
        ]
      },
      {
        "sentences": [
          "After Fâ-hien set out from Ch’ang-gan, it took him six years to reach Central India[15]; stoppages there extended over (other) six years; and on his return it took him three years to reach Ts’ing-chow.",
          "The countries through which he passed were a few under thirty.",
          "From the sandy desert westwards on to India, the beauty of the dignified demeanour of the monkhood and of the transforming influence of the Law was beyond the power of language fully to describe; and reflecting how our masters had not heard any complete account of them, he therefore (went on) without regarding his own poor life, or (the dangers to be encountered) on the sea upon his return, thus incurring hardships and difficulties in a double form.",
          "He was fortunate enough, through the dread power of the three Honoured Ones, to receive help and protection in his perils; and therefore he wrote out an account of his experiences, that worthy readers might share with him in what he had heard and said."
        ]
      },
      {
        "sentences": [
          "It was in the year Keah-yin[16], the twelfth year of the period E-he of the (Eastern) Tsin dynasty, the year-star being in Virgo-Libra, in the summer, at the close of the period of retreat, that I met the devotee Fâ-hien.",
          "On his arrival I lodged him with myself in the winter study[17], and there, in our meetings for conversation, I asked him again and again about his travels.",
          "The man was modest and complaisant, and answered readily according to the truth.",
          "I thereupon advised him to enter into details where he had at first only given a summary, and he proceeded to relate all things in order from the beginning to the end.",
          "He said himself, ‘When I look back on what I have gone through, my heart is involuntarily moved, and the perspiration flows forth. That I encountered danger and trod the most perilous places, without thinking of or sparing myself, was because I had a definite aim, and thought of nothing but to do my best in my simplicity and straightforwardness. Thus it was that I exposed my life where death seemed inevitable, if I might accomplish but a ten-thousandth part of what I hoped.’",
          "These words affected me in turn, and I thought:—‘This man who have seldom been seen from ancient times to the present.",
          "Since the Great Doctrine flowed on to the East there has been no one to be compared with Hien in his forgetfulness of self and search for the Law.",
          "Henceforth I know that the influence of sincerity finds no obstacle, however great, which it does not overcome, and that force of will does not fail to accomplish whatever service it undertakes.",
          "Does not the accomplishing of such service arise from forgetting (and disregarding) what is (generally) considered as important, and attaching importance to what is (generally) forgotten?"
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "No. 1122 in Nanjio’s Catalogue, translated into Chinese by Buddhajîva and a Chinese Śramaṇa about A.D. 425.",
            "Mahîśâsakâḥ means ‘the school of the transformed earth,’ or ‘the sphere within which the Law of Buddha is influential.’",
            "The school is one of the subdivisions of the Sarvâstivâdâḥ."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Nanjio’s 545 and 504.",
            "The Âgamas are Sûtras of the hînayâna, divided, according to Eitel, pp. 4, 5, into four classes, the first or Dîrghâgamas (long Âgamas) being treatises on right conduct, while the third class contains the Saṃyuktâgamas (mixed Âgamas)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Meaning ‘Miscellaneous Collections;’ a sort of fourth Piṭaka.",
            "See Nanjio’s fourth division of the Canon, containing Indian and Chinese miscellaneous works.",
            "But Dr. Davids says that no work of this name is known either in Sanskrit or Pâli literature."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "We have in the text a phonetisation of the Sanskrit Kuṇḍikâ, which is explained in Eitel by the two characters that follow, as=‘washing basin,’ but two things evidently are intended."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See note 5, p. 46."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "At his novitiate Fâ-hien had sought the refuge of the ‘three Precious Ones’ (the three Refuges [三歸] of last chapter), of which the congregation or body of the monks was one; and here his thoughts turn naturally to the branch of it in China.",
            "His words in his heart were not exactly words of prayer, but very nearly so."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In the text 大風, tâ-fung, ‘the great wind,’=the typhoon."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "They had got to the south of the Shan-tung promontory, and the foot of mount Lâo, which still rises under the same name on the extreme south of the peninsula, east from Keâo Chow, and having the district of Tseih-mih on the east of it.",
            "All the country there is included in the present Phing-too Chow of the department Lâe-chow.",
            "The name Phing-too dates from the Han dynasty, but under the dynasty of the After Ch’e (後齊), (A.D. 479-501), it was changed into Ch’ang-kwang.",
            "Fâ-hien may have lived, and composed the narrative of his travels, after the change of name was adopted.",
            "See the Topographical Tables of the different Dynasties (歷代沿革表), published in 1815."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "What these vegetables difficult say and there are different readings of the characters for them. Williams’ Dictionary, under kwoh, brings the two names together in a phrase, but the rendering of it is simply ‘a soup of simples.’",
            "For two or three columns here, however, the text appears to me confused and imperfect."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "I suppose these men were really hunters ; and, when brought before Fâ-hien, because he was a Śraṃana, they thought they would please him by saying they were disciples of Buddha.",
            "But what had disciples of Buddha to do with hunting and taking life? They were caught in their own trap, and said they were looking for peaches."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Chinese character here has occurred twice before, but in a different meaning and connexion.",
            "Rémusat, Beal, and Giles take it as equivalent to ‘to sacrifice.’",
            "But his followers do not ‘sacrifice’ to Buddha.",
            "That is a priestly term, and should not be employed of anything done at Buddhistic services."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Probably the present department of Yang-chow in Keang-soo; but as I have said in a previous note, the narrative does not go on so clearly as it generally does."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Was, or could, this prefect be Le E?"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Probably not Ch’ang-gan, but Nan-king, which was the capital of the Eastern Tsin dynasty under another name."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The whole of this paragraph is probably Fâ-hien’s own conclusion of his narrative.",
            "The second half of the second sentence, both in sentiment and style in the Chinese text, seems to necessitate our ascribing it to him, writing on the impulse of his own thoughts, in the same indirect form which he adopted for his whole narrative.",
            "There are, however, two peculiar phraseologies in it which might suggest the work of another hand.",
            "For the name India, where the first 1 is placed, a character is employed which is similarly applied nowhere else; and again, ‘the three Honoured Ones,’ at which the second 1 is placed, must be the same as ‘the three Precious Ones,’ which we have met with so often unless we suppose that 三尊 is printed in all the revisions for 世尊, ‘the World-honoured one,’ which has often occurred.",
            "On the whole, while I accept this paragraph as Fâ-hien’s own, I do it with some hesitation.",
            "That the following and concluding paragraph is from another hand, there can be no doubt.",
            "And it is as different as possible in style from the simple and straightforward narrative of Fâ-hien."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "There is an error of date here, for which it is difficult to account.",
            "The year Keah-yin was A.D. 414; but that was the tenth year of the period E-he, and not the twelfth, the cyclical designation of which was Ping-shin.",
            "According to the preceding paragraph, Fâ-hien’s travels had occupied him fifteen years, so that counting from A.D. 399, the year Ke-hâe, as that in which he set out, the year of his getting to Ts’ing-chow would have been Kwei-chow, the ninth year of the period E-he; and we might join on ‘This year Keah-yin’ to that paragraph, as the date at which the narrative was written out for the bamboo-tablets and the silk, and then begins the Envoy, ‘In the twelfth year of E-he.’",
            "This would remove the error as it stands at present, but unfortunately there is a particle at the end of the second date (矣), which seems to tie the twelfth year of E-he to Keah-yin, as another designation of it.",
            "The ‘year-star’ is the planet Jupiter, the revolution of which, in twelve years, constitutes ‘a great year.’",
            "Whether it would be possible to fix exactly by mathematical calculation in what year Jupiter was in the Chinese zodiacal sign embracing part of both Virgo and Scorpio, and thereby help to solve the difficulty of the passage, I do not know, and in the meantime must leave that difficulty as I have found it."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "We do not know who the writer of the Envoy was.",
            "‘The winter study or library’ would be the name of the apartment in his monastery or house, where he sat and talked with Fâ-hien."
          ]
        }
      ]
    }
  ]
}
