{
  "title": "CHAPTER XXVI.",
  "subtitle": "REMARKABLE DEATH OF ÂNANDA.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FOUR yojanas on from this place to the east brought the travellers to the confluence of the five rivers[1].",
          "When Ânanda was going from Magadha[2] to Vaiśâlî, wishing his pari-nirvâṇa to take place (there), the devas informed king Ajâtaśatru[3] of it, and the king immediately pursued him, in his own grand carriage, with a body of soldiers, and had reached the river.",
          "(On the other hand), the Lichchhavis of Vaiśâlî had heard that Ânanda was coming (to their city), and they on their part came to meet him.",
          "(In this way), they all arrived together at the river, and Ânanda considered that, if he went forward, king Ajâtaśatru would be very angry, while, if he went back, the Lichchhavis would resent his conduct.",
          "He thereupon in the very middle of the river burnt his body in a fiery ecstasy of Samâdhi[4], and his pari-nirvâṇa was attained.",
          "He divided his body (also) into two, (leaving) the half of it on each bank; so that each of the two kings got one half as a (sacred) relic, and took it back (to his own capital), and there raised a tope over it."
        ]
      }
    }
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "This spot does not appear to have been identified.",
            "It could not be far from Patna."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Magadha was for some time the headquarters of Buddhism; the holy land, covered with vihâras; a fact perpetuated, as has been observed in a previous note, in the name of the present Behâr, the southern portion of which corresponds to the ancient kingdom of Magadha."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In Singhalese, Ajasat.",
            "See the account of his conversion in M. B., pp. 321-326.",
            "He was the son of king Bimbisâra, who was one of the first royal converts to Buddhism.",
            "Ajasat murdered his father, or at least wrought his death; and was at first opposed to Śâkyamuni, and a favourer of Devadatta.",
            "When converted, he became famous for his liberality in almsgiving."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Eitel has a long article (pp. 114, 115) on the meaning of Samâdhi, which is one of the seven sections of wisdom (bodhyanga).",
            "Hardy defines it as meaning ‘perfect tranquillity;’ Turnour, as ‘meditative abstraction;’ Burnouf, as ‘self-control;’ and Edkins, as ‘ecstatic reverie.’",
            "‘Samâdhi,’ says Eitel, ‘signifies the highest pitch of abstract, ecstatic meditation; a state of absolute indifference to all influences from within or without; a state of torpor of both the material and spiritual forces of vitality; a sort of terrestrial nirvâṇa, consistently culminating in total destruction of life.’",
            "He then quotes apparently the language of the text, ‘He consumed his body by Agni (the fire of) Samadhi,’ and says it is ‘a common expression for the effects of such ecstatic, ultra-mystic self-annihilation.’",
            "All this is simply ‘a darkening of counsel by words without knowledge.’",
            "Some facts concerning the death of Ânanda are hidden beneath the darkness of the phraseology, which it is impossible for us to ascertain.",
            "By or in Samâdhi he burns his body in the very middle of the river, and then he divides the relic of the burnt body into two parts (for so evdently Fâ-hien intended his narration to be taken), and leaves one half on each bank.",
            "The account of Ânanda's death in Nien-ch’ang’s ‘History of Buddha and the Patriarchs’ is much more extravagant.",
            "Crowds of men and devas are brought together to witness it.",
            "The body is divided into four parts.",
            "One is conveyed to the Tushita heaven; a second, to the palace of a certain Nâga king; a third is given to Ajâtaśatru; and the fourth to the Lichchhavis.",
            "What it all really means I cannot tell."
          ]
        }
      ]
    }
  ]
}
