{
  "title": "CHAPTER II.",
  "subtitle": "KHOTEN. PROCESSIONS OF IMAGES. THE KING’S NEW MONASTERY.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "YU-TEEN is a pleasant and prosperous kingdom, with a numerous and flourishing population.",
          "The inhabitants all profess our Law, and join together in its religious music for their enjoyment[1].",
          "The monks amount to several myriads, most of whom are students of the mahâyâna[2].",
          "They all receive their food from the common store[3].",
          "Throughout the country the houses of the people stand apart like (separate) stars, and each family has a small tope[4] reared in front of its door.",
          "The smallest of these may be twenty cubits high, or rather more.",
          "They make (in the monasteries) rooms for monks from all quarters[5], the use of which is given to travelling monks who may arrive, and who are provided with whatever else they require."
        ]
      },
      {
        "sentences": [
          "The lord of the country lodged Fâ-hien and the others comfortably, and supplied their wants, in a monastery called Gomati[6], of the mahâyâna school.",
          "Attached to it there are three thousand monks, who are called to their meals by the sound of a bell.",
          "When they enter the refectory, their demeanour is marked by a reverent gravity, and they take their seats in regular order, all maintaining a perfect silence.",
          "No sound is heard from their alms-bowls and other utensils.",
          "When any of these pure men[7] require food, they are not allowed to call out (to the attendants) for it, but only make signs with their hands."
        ]
      },
      {
        "sentences": [
          "Hwuy-king, Tâo-ching, and Hwuy-tah set out in advance towards the country of K’eeh-ch’â[8]; but Fâ-hien and the others, wishing to see the procession of images, remained behind for three months.",
          "There are in this country four[9] great monasteries, not counting the smaller ones.",
          "Beginning on the first day of the fourth month, they sweep and water the streets inside the city, making a grand display in the lanes and byways.",
          "Over the city gate they pitch a large tent, grandly adorned in all possible ways, in which the king and queen, with their ladies brilliantly arrayed[10], take up their residence (for the time)."
        ]
      },
      {
        "sentences": [
          "The monks of the Gomati monastery, being mahâyâna students, and held in greatest reverence by the king, took precedence of all the others in the procession.",
          "At a distance of three or four le from the city, they made a four-wheeled image car, more than thirty cubits high, which looked like the great hall (of a monastery) moving along.",
          "The seven precious substances[11] were grandly displayed about it, with silken streamers and canopies hanging all around.",
          "The (chief) image[12] stood in the middle of the car, with two Bodhisattvas[13] in attendance on it, while devas[14] were made to follow in waiting, all brilliantly carved in gold and silver, and hanging in the air.",
          "When (the car) was a hundred paces from the gate, the king put off his crown of state, changed his dress for a fresh suit, and with bare feet, carrying in his hands flowers and incense, and with two rows of attending followers, went out at the gate to meet the image; and, with his head and face (bowed to the ground), he did homage at its feet, and then scattered the flowers and burnt the incense.",
          "When the image was entering the gate, the queen and the brilliant ladies with her in the gallery above scattered far and wide all kinds of flowers, which floated about and fell promiscuously to the ground.",
          "In this way everything was done to promote the dignity of the occasion.",
          "The carriages of the monasteries were all different, and each one had its own day for the procession.",
          "(The ceremony) began on the first day of the fourth month, and ended on the fourteenth, after which the king and queen returned to the palace."
        ]
      },
      {
        "sentences": [
          "Seven or eight le to the west of the city there is what is called the King’s New monastery, the building of which took eighty years, and extended over three reigns.",
          "It may be 250 cubits in height, rich in elegant carving and inlaid work, covered above with gold and silver, and finished throughout with a combination of all the precious substances.",
          "Behind the tope there has been built a Hall of Buddha[15] of the utmost magnificence and beauty, the beams, pillars, venetianed doors, and windows being all overlaid with gold-leaf.",
          "Besides this, the apartments for the monks are imposingly and elegantly decorated, beyond the power of words to express.",
          "Of whatever things of highest value and preciousness the kings in the six countries on the east of the (Ts’ung) range of mountains[16] are possessed, they contribute the greater portion (to this monastery), using but a small portion of them themselves[17]."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "This fondness for music among the Khoteners is mentioned by Hsüan Ch’wang and others."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Mahâyâna; see note 1 on p. 14.",
            "It is a later form of the Buddhist doctrine, the second phase of its development corresponding to the state of a Bodhisattva, who, being able to transport himself and all mankind to nirvâṇa, may be compared to a huge vehicle.",
            "See Davids on the ‘Key-note of the “Great Vehicle,”’ Hibbert Lectures, p. 254."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Fâ-hien supplies sufficient information of how the common store or funds of the monasteries were provided, farther on in chapters xvi and xxxix, as well as in other passages.",
            "As the point is important, I will give here, from Davids’ fifth Hibbert Lecture (p. 178), some of the words of the dying Buddha, taken from ‘The Book of the Great Decease,’ as illustrating the statement in this text:—‘So long as the brethren shall persevere in kindness of action, speech, and thought among the saints, both in public and private; so long as they shall divide without partiality, and share in common with the upright and holy, all such things as they receive in accordance with the just provisions of the order, down even to the mere contents of a begging bowl; .... so long may the brethren be expected not to decline, but to prosper.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Chinese 塔 (t’ah; in Cantonese, t’ap), as used by Fâ-hien, is, no doubt, a phonetisation of the Sanskrit stûpa or Pâli thûpa; and it is well in translating to use for the structures described by him the name of topes,—made familiar by Cunningham and other Indian antiquarians.",
            "In the thirteenth chapter there is an account of one built under the superintendence of Buddha himself, ‘as a model for all topes in future.’",
            "They were usually in the form of bell-shaped domes, and were solid, surmounted by a long tapering pinnacle formed with a series of rings, varying in number.",
            "But their form, I suppose, was often varied; just as we have in China pagodas of different shapes.",
            "There are several topes now in the Indian Institute at Oxford, brought from Buddha Gâyâ, but the largest of them is much smaller than ‘the smallest’ of those of Khoten.",
            "They were intended chiefly to contain relics of Buddha and famous masters of his Law; but what relics could there be in the Triratna topes of chapter xvi?"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The meaning here is much disputed.",
            "The author does not mean to say that the monk's apartments were made ‘square,’ but that the monasteries were made with many guest-chambers or spare rooms."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Sanskrit term for a monastery is used here,—Saṅghârâma, ‘gardens of the assembly,’ originally denoting only ‘the surrounding park, but afterwards transferred to the whole of the premises’ (E. H., p. 118). Gomati, the name of this monastery, means ‘rich in cows.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A denomination for the monks as vimala, ‘undefiled’ or ‘pure.’",
            "Giles makes it ‘the menials that attend on the monks,’ but I have not met with it in that application."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "K’eeh-ch’â has not been clearly identified, Rémusat made it Cashmere; Klaproth, Iskardu; Beal makes it Kartchou; and Eitel, Khas’a, ‘an ancient tribe on the Paropamisus, the Kasioi of Ptolemy.’",
            "I think it was Ladak, or some well-known place in it.",
            "Hwuy-tah, unless that name be an alias, appears here for the first time."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Instead of ‘four,’ the Chinese copies of the text have ‘fourteen;’ but the Corean reading is, probably, more correct."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "There may have been, as Giles says, ‘maids of honour;’ but the character does not say so."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Sapta-ratna, gold, silver, lapis lazuli, rock crystal, rubies, diamonds or emeralds, and agate.",
            "See Sacred Books of the East (Davids’ Buddhist Suttas), volb. xi, p. 249."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "No doubt that of Śâkyamuni himself."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "A Bodhisattva is one whose essence has become intelligence; a Being who will in some future birth as a man (not necessarily or usually the next) attain to Buddhahood.",
            "The name does not include those Buddhas who have not yet attained to parinirvâṇa.",
            "The symbol of the state is an elephant fording a river.",
            "Popularly, its abbreviated form P’û-sâ is used in China for any idol or image; here the name has its proper signification."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "諸天, ‘all the thien,’ or simply ‘the thien’ taken as plural.",
            "But in Chinese the character called thien (天) denotes heaven, or Heaven, and is interchanged with Tî and Shang Tî, meaning God.",
            "With the Buddhists it denotes the devas or Brahmanic gods, or all the inhabitants of the six devalokas.",
            "The usage shows the antagonism between Buddhism and Brahmanism, and still more that between it and Confucianism."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Giles and Williams call this ‘the oratory of Buddha.’",
            "But ‘oratory’ gives the idea of a small apartment, whereas the name here leads the mind to think of a large ‘hall.’",
            "I once accompanied the monks of a large monastery from their refectory to the Hall of Buddha, which was a lofty and spacious apartment splendidly fitted up."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Ts’ung, or ‘Onion’ range, called also the Belurtagh mountains, including the Karakorum, and forming together the connecting links between the more northern T’een-shan and the Kwun-lun mountains on the north of Thibet.",
            "It would be difficult to name the six countries which Fâ-hien had in mind."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This seems to be the meaning here.",
            "My first impression of it was that the author meant to say that the contributions which they received were spent by the monks mainly on the buildings, and only to a small extent for themselves; and I still hesitate between that view and the one in the version."
          ]
        },
        {
          "sentences": [
            "There occurs here the binomial phrase kung-yang (供養), which is one of the most common throughout the narrative, and is used not only of support in the way of substantial contributions given to monks, monasteries, and Buddhism, but generally of all Buddhistic worship, if I may use that term in the connexion.",
            "Let me here quote two or three sentences from Davids’ Manual (pp. 168-170):—‘The members of the order are secured from want.",
            "There is no place in the Buddhist scheme for churches; the offering of flowers before the sacred tree or image of the Buddha takes the place of worship.",
            "Buddhism does not acknowledge the efficacy of prayers; and in the warm countries where Buddhists live, the occasional reading of the law, or preaching of the word, in public, can take place best in the open air, by moonlight, under a simple roof of trees or palms.",
            "There are five principal kinds of meditation, which in Buddhism takes the place of prayer.’"
          ]
        }
      ]
    }
  ]
}
