{
  "title": "CHAPTER V.",
  "subtitle": "GREAT QUINQUENNIAL ASSEMBLY OF MONKS. RELICS OF BUDDHA. PRODUCTIONS OF THE COUNTRY.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "IT happened that the king of the country was then holding the pañcha parishad, that is, in Chinese, the great quinquennial assembly[1].",
          "When this is to be held, the king requests the presence of the Śramans from all quarters (of his kingdom).",
          "They come (as if) in clouds; and when they are all assembled, their place of session is grandly decorated.",
          "Silken streamers and canopies are hung out in it, and water-lilies in gold and silver are made and fixed up behind the places where (the chief of them) are to sit.",
          "When clean mats have been spread, and they are all seated, the king and his ministers present their offerings according to rule and law.",
          "(The assembly takes place), in the first, second, or third month, for the most part in the spring."
        ]
      },
      {
        "sentences": [
          "After the king has held the assembly, he further exhorts the ministers to make other and special offerings.",
          "The doing of this extends over one, two, three, five, or even seven days; and when all is finished, he takes his own riding-horse, saddles, bridles, and waits on him himself[2], while he makes the noblest and most important minister of the kingdom mount him.",
          "Then, taking fine white woollen cloth, all sorts of precious things, and articles which the Śramans require, he distributes them among them, uttering vows at the same time along with all his ministers; and when this distribution has taken place, he again redeems (whatever he wishes) from the monks[3]."
        ]
      },
      {
        "sentences": [
          "The country, being among the hills and cold, does not produce the other cereals, and only the wheat gets ripe.",
          "After the monks have received their annual (portion of this), the mornings suddenly show the hoar-frost, and on this account the king always begs the monks to make the wheat ripen[4] before they receive their portion.",
          "There is in the country a spittoon which belonged to Buddha, made of stone, and in colour like his alms-bowl.",
          "There is also a tooth of Buddha, for which the people have reared a tope, connected with which there are more than a thousand monks and their disciples[5], all students of the hînayâna.",
          "To the east of these hills the dress of the common people is of coarse materials, as in our country of Ts’in, but here also[6] there were among them the differences of fine woollen cloth and of serge or haircloth.",
          "The rules observed by the Śramans are remarkable, and too numerous to be mentioned in detail.",
          "The country is in the midst of the Onion range."
        ]
      },
      {
        "sentences": [
          "As you go forward from these mountains, the plants, trees, and fruits are all different from those of the land of Han, excepting only the bamboo, pomegranate[7], and sugar-cane."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "See Eitel, p. 89.",
            "He describes the assembly as ‘an ecclesiastical conference, first instituted by king Aśoka for general confession of sins and inculcation of morality.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The text of this sentence is perplexing; and all translators, including myself, have been puzzled by it."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See what we are told of king Aśoka’s grant of all the Jambudvîpa to the monks in chapter xxvii.",
            "There are several other instances of similar gifts in the Mahâvaṉśa."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Watters calls attention to this as showing that the monks of K’eeh-ch’â had the credit of possessing weather-controlling powers."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The text here has 僧徒, not 僧 alone.",
            "I often found in monasteries boys and lads who looked up to certain of the monks as their preceptors."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Compare what is said in chapter ii of the dress of the people of Shen-shen."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Giles thinks the fruit here was the guava, because the ordinary name for ‘pomegranate’ is preceded by gan (安); but the pomegranate was called at first Gan Shih-lâu, as having been introduced into China from Gan-seih by Chang K’een, who is referred to in chapter vii."
          ]
        }
      ]
    }
  ]
}
