{
  "title": "CHAPTER VI.",
  "subtitle": "ON TOWARDS NORTH INDIA. DARADA. IMAGE OF MAITREYA BODHISATTVA.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "FROM this (the travellers) went westwards towards North India, and after being on the way for a month, they succeeded in getting across and through the range of the Onion mountains.",
          "The snow rests on them both winter and summer.",
          "There are also among them venomous dragons, which, when provoked, spit forth poisonous winds, and cause showers of snow and storms of sand and gravel.",
          "Not one in ten thousand of those who encounter these dangers escapes with his life.",
          "The people of the country call the range by the name of ‘The Snow mountains.’",
          "When (the travellers) had got through them, they were in North India, and immediately on entering its borders, found themselves in a small kingdom called T’o-Ieih[1], where also there were many monks, all students of the hînayâna."
        ]
      },
      {
        "sentences": [
          "In this kingdom there was formerly an Arhan[2], who by his supernatural power[3] took a clever artificer up to the Tushita[4] heaven, to see the height, complexion, and appearance of Maitreya Bodhisattva[5], and then return and make an image of him in wood.",
          "First and last, this was done three times, and then the image was completed, eighty cubits in height, and eight cubits at the base from knee to knee of the crossed legs.",
          "On fast-days it emits an effulgent light.",
          "The kings of the (surrounding) countries vie with one another in presenting offerings to it. Here it is,—to be seen now as of old[6]."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Eitel and others identify this with Darada, the country of the ancient Dardae, the region near Dardus; lat. 30° 11' N., lon. 73° 54' E.",
            "See E. H., p. 30.",
            "I am myself in more than doubt on the point.",
            "Cunningham (‘Ancient Geography of India,’ p. 82) says, ‘Darel is a valley on the right or western bank of the Indus, now occupied by Dardus or Dards, from whom it received its name.’",
            "But as I read our narrative, Fâ-hien is here on the eastern bank of the Indus, and only crosses to the western bank as described in the next chapter."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Lo-han, Arhat, Arahat are all designations of the perfected Ârya, the disciple who has passed the different stages of the Noble Path, or eightfold excellent way, who has conquered all passions, and is not to be reborn again.",
            "Arhatship implies possession of certain supernatural powers, and is not to be succeeded by Buddhaship, but implies the fact of the saint having already attained nirvâṇa.",
            "Popularly, the Chinese designate by this name the wider circle of Buddha’s disciples, as well as the smaller ones of 500 and 18.",
            "No temple in Canton is better worth a visit than that of the 500 Lo-han."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Ṛiddhi-sâkshâtkriyâ, ‘the power of supernatural footsteps,’=‘a body flexible at pleasure,’ or unlimited power over the body. E. H., p. 104."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Tushita is the fourth Devaloka, where all Bodhisattvas are reborn before finally appearing on earth as Buddha.",
            "Life lasts in Tushita 4000 years, but twenty-four hours there are equal to 400 years on earth. E. H., p. 152."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Maitreya (Spence Hardy, Maitri), often styled Ajita, ‘the Invincible,’ was a Bodhisattva, the principal one, indeed, of Śâkyamuni’s retinue, but is not counted among the ordinary (historical) disciples, nor is anything told of his antecedents.",
            "It was in the Tushita heaven that Śâkyamuni met him and appointed him as his successor, to appear as Buddha after the lapse of 5000 years.",
            "Maitreya is therefore the expected Messiah of the Buddhists, residing at present in Tushita, and, according to the account of him in Eitel (H., p. 70), ‘already controlling the propagation of the Buddhistic faith.’",
            "The name means ‘gentleness’ or ‘kindness;’ and this will be the character of his dispensation."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The combination of 今故 in the text of this concluding sentence, and so frequently occurring throughout the narrative, has occasioned no little dispute among previous translators.",
              "In the imperial thesaurus of phraseology (P’ei-wăn Yun-foo), under 故, an example of it is given from Chwang-tsze, and a note subjoined that 今故 is equivalent to 古今, ‘anciently and now.’"
          ]
        }
      ]
    }
  ]
}
