{
  "title": "",
  "subtitle": "",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "THE travellers went on to the south-west for fifteen days (at the foot of the mountains, and) following the course of their range.",
          "The way was difficult and rugged, (running along) a bank exceedingly precipitous, which rose up there, a hill-like wall of rock, 10,000 cubits from the base.",
          "When one approached the edge of it, his eyes became unsteady; and if he wished to go forward in the same direction, there was no place on which he could place his foot; and beneath were the waters of the river called the Indus[1].",
          "In former times men had chiselled paths along the rocks, and distributed ladders on the face of them, to the number altogether of 700) at the bottom of which there was a suspension bridge of ropes, by which the river was crossed, its banks being there eighty paces apart[2].",
          "The (place and arrangements) are to be found in the Records of the Nine Interpreters[3], but neither Chang K’een[4] nor Kan Ying[5] had reached the spot."
        ]
      },
      {
        "sentences": [
          "The monks[6] asked Fâ-hien if it could be known when the Law of Buddha first went to the east.",
          "He replied, ‘When I asked the people of those countries about it, they all said that it had been handed down by their fathers from of old that, after the setting up of the image of Maitreya Bodhisattva, there were Śramans of India who crossed this river, carrying with them Sûtras and Books of Discipline. Now the image was set up rather more than 300 years after the nirvâṇa[7] of Buddha, which may be referred to the reign of king P’ing of the Chow dynasty[8]. According to this account we may say that the diffusion of our great doctrines (in the east) began from (the setting up of) this image. If it had not been through that Maitreya[9] the great spiritual master[10] (who is to be) the successor of the Śâkya, who could have caused the “Three Precious Ones”[11] to be proclaimed so far, and the people of those border lands to know our Law? We know of a truth that the opening of (the way for such) a mysterious propagation is not the work of man; and so the dream of the emperor Ming of Han[12] had its proper cause.’"
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "The Sindhu.",
            "We saw in a former note (2, p. 14), that the earliest name in China for India was Shin-tuh.",
            "So, here, the river Indus is called by a name approaching that in sound."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Both Beal and Watters quote from Cunningham (Ladak, pp. 88, 89) the following description of the course of the Indus in these parts, in striking accordance with our author's account:—‘From Skardo to Rongdo, and from Rongdo to Makpou-i-shang-rong, for upwards of 100 miles, the Indus sweeps sullen and dark through a mighty gorge in the mountains, which for wild sublimity is perhaps unequalled. Rongdo means the country of defiles .... Between these points the Indus raves from side to side of the gloomy chasm, foaming and chafing with ungovernable fury. Yet even in these inaccessible places has daring and ingenious man triumphed over opposing nature. The yawning abyss is spanned by frail rope bridges, and the narrow ledges of rocks are connected by ladders to form a giddy pathway overhanging the seething caldron below.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Japanese edition has a different reading here from the Chinese copies,—one which Rémusat (with true critical instinct) conjectured should take the place of the more difficult text with which alone he was acquainted.",
            "The ‘Nine Interpreters’ would be a general name for the official interpreters attached to the invading armies of Han in their attempts to penetrate and subdue the regions of the west.",
            "The phrase occurs in the memoir of Chang K’een, referred to in the next note."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Chang K’een, a minister of the emperor Woo of Han (B.C. 140-87), is celebrated as the first Chinese who ‘pierced the void,’ and penetrated to ‘the regions of the west,’ corresponding very much to the present Turkestan.",
            "Through him, by B.C. 115, a regular intercourse was established between China and the thirty-six kingdoms or states of that quarter;—see Mayers’ Chinese Reader’s Manual, p. 5.",
              "The memoir of Chang K’een, translated by Mr. Wylie from the Books of the first Han dynasty, appears in the Journal of the Anthropological Institute, referred to already (note 3, p. 12)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Less is known of Kan Ying than of Chang K’een.",
            "Being sent in A.D. 88 by his patron Pan Châo on an embassy to the Roman empire, he only got as far as the Caspian sea, and returned to China.",
            "He extended, however, the knowledge of his countrymen with regard to the western regions;—see the memoir of Pan Châo in the Books of the second Han, and Mayers’ Manual, pp. 167, 168."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Where and when?",
            "Probably at his first resting-place after crossing the Indus."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This may refer to Śâkyamuni's becoming Buddha on attaining to nirvâṇa, or more probably to his pari-nirvâṇa and death."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "As king P’ing’s reign lasted from B.C. 750 to 719, this would place the death of Buddha in the eleventh century B.C., whereas recent inquirers place it between B.C. 480 and 470, a year or two, or a few years, after that of Confucius, so that the tno great ‘Masters’ of the east were really contemporaries.",
            "But if Rhys Davids be correct, as I think he is, in fixing the date of Buddha's death within a few years of 412 B.C. (see Manual, p. 213), not to speak of Westergaard’s still lower date, then the Buddha was very considerably the junior of Confucius."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This confirms the words of Eitel (note 3, p. 23), that Maitreya is already controlling the propagation of the Faith."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Chinese characters for this simply mean ‘the great scholar or officer;’ but see Eitel’s Handbook, p. 99, on the term purusha."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘The precious Buddha,’ ‘the precious Law,’ and ‘the precious Monkhood;’ Buddha, Dharma, and Saṅgha; the whole being equivalent to Buddhism."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Fâ-hien thus endorses the view that Buddhism was introduced into China in this reign, A.D. 58-75.",
            "The emperor had his dream in A.D. 61."
          ]
        }
      ]
    }
  ]
}
