{
  "title": "CHAPTER XXXV.",
  "subtitle": "DAKSHIṆA, AND THE PIGEON MONASTERY.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "SOUTH from this 200 yojanas, there is a country named Dakshiṇa[1], where there is a monastery (dedicated to) the bygone Kaśyapa Buddha, and which has been hewn out from a large hill of rock.",
          "It consists in all of five storeys;—the lowest, having the form of an elephant, with 500 apartments in the rock; the second, having the form of a lion, with 400 apartments; the third, having the form of a horse, with 300 apartments; the fourth, having the form of an ox, with 200 apartments; and the fifth, having the form of a pigeon, with 100 apartments.",
          "At the very top there is a spring, the water of which, always in front of the apartments in the rock, goes round among the rooms, now circling, now curving, till in this way it arrives at the lowest storey, having followed the shape of the structure, and flows out there at the door.",
          "Everywhere in the apartments of the monks, the rock has been pierced so as to form windows for the admission of light, so that they are all bright, without any being left in darkness.",
          "At the four comers of the (tiers of) apartments, the rock has been hewn so as to form steps for ascending to the top (of each).",
          "The men of the present day, being of small size, and going up step by step, manage to get to the top; but in a former age they did so at one step[2].",
          "Because of this, the monastery is called Paravata, that being the Indian name for a pigeon.",
          "There are always Arhats residing in it."
        ]
      },
      {
        "sentences": [
          "The country about is (a tract of) uncultivated hillocks[3], without inhabitants.",
          "At a very long distance from the hill there are villages, where the people all have bad and erroneous views, and do not know the Śramaṇas of the Law of Buddha, Brâhmaṇas, or (devotees of) any of the other and different schools.",
          "The people of that country are constantly seeing men on the wing, who come and enter this monastery.",
          "On one occasion, when devotees of various countries came to perform their worship at it, the people of those villages said to them, ‘Why do you not fly? The devotees whom we have seen hereabouts all fly;’ and the strangers answered, on the spur of the moment, ‘Our wings are not yet fully formed.’"
        ]
      },
      {
        "sentences": [
          "The kingdom of Dakshiṇa is out of the way, and perilous to traverse.",
          "There are difficulties in connexion with the roads; but those who know how to manage such difficulties and wish to proceed should bring with them money and various articles, and give them to the king.",
          "He will then send men to escort them.",
          "These will (at different stages) pass them over to others, who will show them the shortest routes.",
          "Fâ-hien, however, was after all unable to go there; but having received the (above) accounts from men of the country, he has narrated them."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "Said to be the ancient name for the Deccan.",
            "As to the various marvels in the chapter, it must be borne in mind that our author, as he tells us at the end, only gives them from hearsay.",
            "See ‘Buddhist Records of the Western World,’ vol. ii, pp. 214, 215, where the description, however, is very different."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Compare the account of Buddha’s great stride of fifteen yojanas in Ceylon, as related in chapter xxxviii."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See the same phrase in the Books of the Later Han dynasty, the twenty-fourth Book of Biographies, p. 9 b."
          ]
        }
      ]
    }
  ]
}
