{
  "title": "CHAPTER XX.",
  "subtitle": "KOŚALA AND ŚRÂVASTÎ. THE JETAVANA VIHÂRA AND OTHER MEMORIALS AND LEGENDS OF BUDDHA. SYMPATHY OF THE MONKS WITH THE PILGRIMS.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "GOING on from this to the south, for eight yojanas, (the travellers) came to the city of Śrâvastî[1] in the kingdom of Kośala[2], in which the inhabitants were few and far between, amounting in all (only) to a few more than two hundred families; the city where king Prasenajit[3] ruled, and the place of the old vihâra of Mahâ-prajâpatî[4]; of the well and walls of (the house of) the (Vaiśya) head Sudatta[5]; and where the Aṅgulimâlya[6] became an Arhat, and his body was (afterwards) burned on his attaining to pari-nirvâṇa.",
          "At all these places topes were subsequently erected, which are still existing in the city.",
          "The Brahmans, with their contrary doctrine, became full of hatred and envy in their hearts, and wished to destroy them, but there came from the heavens such a storm of crashing thunder and flashing lightning that they were not able in the end to effect their purpose."
        ]
      },
      {
        "sentences": [
          "As you go out from the city by the south gate, and 1,200 paces from it, the (Vaiśya) head Sudatta built a vihâra, facing the south; and when the door was open, on each side of it there was a stone pillar, with the figure of a wheel on the top of that on the left, and the figure of an ox on the top of that on the right.",
          "On the left and right of the building the ponds of water clear and pure, the thickets of trees always luxuriant, and the numerous flowers of various hues, constituted a lovely scene, the whole forming what is called the Jetavana vihâra[7]."
        ]
      },
      {
        "sentences": [
          "When Buddha went up to the Trayastriṃśas heaven[8], and preached the Law for the benefit of his mother, (after he had been absent for) ninety days, Prasenajit, longing to see him, caused an image of him to be carved in Gośirsha Chandana wood[9], and put in the place where he usually sat.",
          "When Buddha on his return entered the vihâra, this image immediately left its place, and came forth to meet him.",
          "Buddha said to it, ‘Return to your seat.",
          "After I have attained to pari-nirvâṇa, you will serve as a pattern to the four classes of my disciples[10],’ and on this the image returned to its seat.",
          "This was the very first of all the images (of Buddha), and that which men subsequently copied.",
          "Buddha then removed, and dwelt in a small vihâra on the south side (of the other), a different place from that containing the image, and twenty paces distant from it."
        ]
      },
      {
        "sentences": [
          "The Jetavana vihâra was originally of seven storeys.",
          "The kings and people of the countries around vied with one another in their offerings, hanging up about it silken streamers and canopies, scattering flowers, burning incense, and lighting lamps, so as to make the night as bright as the day.",
          "This they did day after day without ceasing.",
          "(It happened that) a rat, carrying in its mouth the wick of a lamp, set one of the streamers or canopies on fire, which caught the vihâra, and the seven storeys were all consumed.",
          "The kings, with their officers and people, were all very sad and distressed, supposing that the sandal-wood image had been burned; but lo! after four or five days, when the door of a small vihâra on the east was opened, there was immediately seen the original image.",
          "They were all greatly rejoiced, and co-operated in restoring the vihâra.",
          "When they had succeeded in completing two storeys, they removed the image back to its former place."
        ]
      },
      {
        "sentences": [
          "When Fâ-hien and Tâo-ching first arrived at the Jetavana monastery, and thought how the World-honoured one had formerly resided there for twenty-five years, painful reflections arose in their minds.",
          "Born in a border-land, along with their like-minded friends, they had travelled through so many kingdoms; some of those friends had returned (to their own land), and some had (died), proving the impermanence and uncertainty of life; and to-day they saw the place where Buddha had lived now unoccupied by him.",
          "They were melancholy through their pain of heart, and the crowd of monks came out, and asked them from what kingdom they were come.",
          "‘We are come,’ they replied, ‘from the land of Han.’",
          "‘Strange,’ said the monks with a sigh, ‘that men of a border country should be able to come here in search of our Law!’ Then they said to one another, ‘During all the time that we, preceptors and monks[11], have succeeded to one another, we have never seen men of Han, followers of our system, arrive here.’"
        ]
      },
      {
        "sentences": [
          "Four le to the north-west of the vihâra there is a grove called ‘The Getting of Eyes.’",
          "Formerly there were five hundred blind men, who lived here in order that they might be near the vihâra[12].",
          "Buddha preached his Law to them, and they all got back their eyesight.",
          "Full of joy, they stuck their staves in the earth, and with their heads and faces on the ground, did reverence.",
          "The staves immediately began to grow, and they grew to be great.",
          "People made much of them, and no one dared to cut them down, so that they came to form a grove.",
          "It was in this way that it got its name, and most of the Jetavana monks, after they had taken their midday meal, went to the grove, and sat there in meditation."
        ]
      },
      {
        "sentences": [
          "Six or seven le north-east from the Jetavana, mother Vaiśakha[13] built another vihâra, to which she invited Buddha and his monks, and which is still existing."
        ]
      },
      {
        "sentences": [
          "To each of the great residences for the monks at the Jetavana vihâra there were two gates, one facing the east and the other facing the north.",
          "The park (containing the whole) was the space of ground which the (Vaiśya) head Sudatta purchased by covering it with gold coins.",
          "The vihâra was exactly in the centre.",
          "Here Buddha lived for a longer time than at any other place, preaching his Law and converting men.",
          "At the places where he walked and sat they also (subsequently) reared topes, each having its particular name; and here was the place where Sundari[14] murdered a person and then falsely charged Buddha (with the crime).",
          "Outside the east gate of the Jetavana, at a distance of seventy paces to the north, on the west of the road, Buddha held a discussion with the (advocates of the) ninety-six schemes of erroneous doctrine, when the king and his great officers, the householders, and people were all assembled in crowds to hear it.",
          "Then a woman belonging to one of the erroneous systems, by name Chañchamana[15], prompted by the envious hatred in her heart, and having put on (extra) clothes in front of her person, so as to give her the appearance of being with child, falsely accused Buddha before all the assembly of having acted unlawfully (towards her).",
          "On this, Śakra, Ruler of Devas, changed himself and some devas into white mice, which bit through the strings about her waist; and when this was done, the (extra) clothes which she wore dropt down on the ground.",
          "The earth at the same time was rent, and she went (down) alive into hell[16].",
          "(This) also is the place where Devadatta[17], trying with empoisoned claws to injure Buddha, went down alive into hell.",
          "Men subsequently set up marks to distinguish where both these events took place."
        ]
      },
      {
        "sentences": [
          "Further, at the place where the discussion took place, they reared a vihâra rather more than sixty cubits high, having in it an image of Buddha in a sitting posture.",
          "On the east of the road there was a devâlaya[18] of (one of) the contrary systems, called ‘The Shadow Covered,’ right opposite the vihâra on the place of discussion, with (only) the road between them, and also rather more than sixty cubits high.",
          "The reason why it was called ‘The Shadow Covered’ was this:—When the sun was in the west, the shadow of the vihâra of the World-honoured one fell on the devâlaya of a contrary system; but when the sun was in the east, the shadow of that devâlaya was diverted to the north, and never fell on the vihâra of Buddha.",
          "The mal-believers regularly employed men to watch their devâlaya, to sweep and water (all about it), to burn incense, light the lamps, and present offerings; but in the morning the lamps were found to have been suddenly removed, and in the vihâra of Buddha.",
          "The Brahmans were indignant, and said, ‘Those Śramaṇas take our lamps and use them for their own service of Buddha, but we will not stop our service for you[19]!’ On that night the Brahmans themselves kept watch, when they saw the deva spirits which they served take the lamps and go three times round the vihâra of Buddha and present offerings.",
          "After this ministration to Buddha they suddenly disappeared.",
          "The Brahmans thereupon knowing how great was the spiritual power of Buddha, forthwith left their families, and became monks[20].",
          "It has been handed down, that, near the time when these things occurred, around the Jetavana vihâra there were ninety-eight monasteries, in all of which there were monks residing, excepting only in one place which was vacant.",
          "In this Middle Kingdom[21] there are ninety-six sorts of views, erroneous and different from our system, all of which recognise this world and the future world[22] (and the connexion between them).",
          "Each has its multitude of followers, and they all beg their food: only they do not carry the alms-bowl.",
          "They also, moreover, seek (to acquire) the blessing (of good deeds) on unfrequented ways, setting up on the road-side houses of charity, where rooms, couches, beds, and food and drink are supplied to travellers, and also to monks, coming and going as guests, the only difference being in the time (for which those parties remain)."
        ]
      },
      {
        "sentences": [
          "There are also companies of the followers of Devadatta still existing.",
          "They regularly make offerings to the three previous Buddhas, but not to Śâkyamuni Buddha[23]."
        ]
      },
      {
        "sentences": [
          "Four le south-east from the city of Śrâvastî, a tope has been erected at the place where the World-honoured one encountered king Virûdhaha[24], when he wished to attack the kingdom of Shay-e and took his stand before him at the side of the road[25]."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "In Singhalese, Sewet; here evidently the capital of Kośala.",
            "It is placed by Cunningham (Archæological Survey) on the south bank of the Rapti, about fifty-eight miles north of Ayodyâ or Oude.",
            "There are still the ruins of a great town, the name being Sâhet Mâhat.",
            "It was in this town, or in its neighbourhood, that Śâkyamuni spent many years of his life after he became Buddha."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "There were two Indian kingdoms of this name, a southern and northern.",
            "This was the northern, a part of the present Oudh."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "In Singhalese, Pase-naḍi, meaning ‘leader of the victorious army.’",
            "He was one of the earliest converts and chief patrons of Śâkyamuni.",
            "Eitel calls him (p. 95) one of the originators of Buddhist idolatry, because of the statue which is mentioned in this chapter.",
            "See Hardy’s M. B., pp. 283, 284, et al."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Explained by ‘Path of Love,’ and ‘Lord of Life.’",
            "Prajâpati was aunt and nurse of Śâkyamuni, the first woman admitted to the monkhood, and the first superior of the first Buddhistic convent.",
            "She is yet to become a Buddha."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Sudatta, meaning ‘almsgiver,’ was the original name of Anâtha-piṇḍika (or Piṇḍada), a wealthy householder, or Vaiśya head, of Śrâvastí, famous for his liberality (Hardy, Anepidu).",
            "Of his old house, only the well and walls remained at the time of Fâ-hien's visit to Śrâvastí."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The Aṅgulimâlya were a sect or set of Śivaitic fanatics, who made assassination a religious act.",
            "The one of them here mentioned had joined them by the force of circumstances.",
            "Being converted by Buddha, he became a monk; but when it is said in the text that he ‘got the Tâo,’ or doctrine, I think that expression implies more than his conversion, and is equivalent to his becoming an Arhat.",
            "His name in Pâli is Aṅgulimâla.",
            "That he did become an Arhat is clear from his autobiographical poem in the ‘Songs of the Theras.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Eitel (p. 37) says:—‘A noted vihâra in the suburbs of Śrâvastí, erected in a park which Anâtha-piṇḍika bought of prince Jeta, the son of Prasenajit.",
            "Śâkyamuni made this place his favourite residence for many years.",
            "Most of the Sûtras (authentic and supposititious) date from this spot.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See chapter xvii."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See chapter xiii."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Ârya, meaning ‘honourable,’ ‘venerable,’ is a title given only to those who have mastered the four spiritual truths:—(1) that ‘misery’ is a necessary condition of all sentient existence; this is duḥkha: (2) that the ‘accumulation’ of misery is caused by the passions; this is samudaya: (3) that the ‘extinction’ of passion is possible; this is nirodha: and (4) the the ‘path’ leads to the extinction of passion; which is mârga.",
            "According to their attainment of these truths, the Âryas, or followers of Buddha, are distinguished into four classes,—Śrotâpannas, Śakṛidâgâmins, Anâgâmins, and Ârhats.",
            "E. H., p. 14."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This is the first time that Fâ-hien employs the name Ho-shang (和尙), Which is now popularly used in China for all Buddhist monks without distinction of rank or office.",
            "It is the representative of the Sanskrit term Upadhyâya, ‘explained,’ says Eitel (p. 155), by ‘a self-taught teacher,’ or by ‘he who knows what is sinful and what is not sinful,’ with the note, ‘In India the vernacular of this term is 殞社 [Ed. Note: The Unicode character 社 used here is the modern equivalent of the character used in the original text. See http://humanum.arts.cuhk.edu.hk/Lexis/lexi-mf/search.php?word=%E7%A4%BE for more information in Chinese] (?munshee [? Bonze]); in Kustana and Kashgar they say 鶻社 (hwa-shay); and from the latter term are derived the Chinese synonyms, 和闍 (ho-shay) and 和尙 (ho-shang).’",
            "The Indian term was originally a designation for those who teach only a part of the Vedas, the Vedâṅgas.",
            "Adopted by Buddhists of Central Asia, it was made to signify the priests of the older ritual, in distinction from the Lamas.",
            "In China it has been used first as a synonym for 法師, monks engaged in popular teaching (teachers of the Law), in distinction from 律師, disciplinists, and 禪師 [Ed. Note: The Unicode character used here is the modern equivalent of the character used in the original text. See http://humanum.arts.cuhk.edu.hk/Lexis/lexi-mf/search.php?word=%E7%A6%AA for more information in Chinese], contemplative philosophers (meditationists); then it was used to designate the abbots of monasteries.",
            "But it is now popularly applied to all Buddhist monks.",
            "In the text there seems to be implied some distinction between the ‘teachers’ and the ‘ho-shang;’—probably, the Pâli Âkariya and Upagghâya; see Sacred Books of the East, vol. xiii, Vinaya Texts, pp. 178, 179."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "It might be added, ‘as depending on it,’ in order to bring out the full meaning of the 依 in the text.",
            "If I recollect aright, the help of the police had to be called in at Hongkong in its early years, to keep the approaches to the Cathedral free from the number of beggars, who squatted down there during service, hoping that the hearers would come out with softened hearts, and disposed to be charitable.",
            "I found the popular tutelary temples in Peking and other places, and the path up Mount T’âi in Shan-lung similarly frequented."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "The wife of Anâtha-piṇḍika in note 1, p. 56, and who became ‘mother- superior’ of many nunneries.",
            "See her history in M. B., pp. 220-227.",
            "I am surprised it does not end with the statement that she is to become a Buddha."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See E. H., p. 136.",
            "Hsüan-chwang does not give the name of this murderer; see in Julien’s ‘Vie et Voyages de Hiouen-thsang,’ p. 125,—‘a heretical Brahman killed a woman and calumniated Buddha.’",
            "See also the fuller account in Beal’s ‘Records of Western Countries,’ pp. 7, 8, where the murder is committed by several Brahmachârins.",
            "In this passage Beal makes Sundari to be the name of the murdered person (a harlot).",
            "But the text cannot be so construed."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Eitel (p. 144) calls her Chañcha; in Singhalese, Chinchi.",
            "See the story about her, M. B., pp. 275-277."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘Earth’s prison,’ or ‘one of Earth’s prisons.’",
            "It was the Avîchi nâraka to which she went, the last of the eight hot prisons, where the culprits die, and are born again in uninterrupted succession (such being the meaning of Avîchi), though not with out hope of final redemption.",
            "E. H., p 21."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Devadatta was brother of Ânanda, and a near relative therefore of Śâkyamuni.",
            "He was the deadly enemy, however, of the latter.",
            "He had become so in an earlier state of existence, and the hatred continued in every successive birth, through which they reappeared in the world.",
            "See the accounts of him, and of his various devices against Buddha, and his own destruction at the last, in M. B., pp. 315-321, 326-330; and still better, in the Sacred Books of the East, vol. xx, Vinaya Texts, pp. 233-265.",
            "For the particular attempt referred to in the text, see ‘The Life of the Buddha,’ p. 107.",
            "When he was engulphed, and the flames were around him, he cried out to Buddha to save him, and we are told that he is expected yet to appear as a Buddha under the name of Devarâja, in a universe called Deva-soppana.",
            "E. H., p. 39."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘A devâlaya (天寺 or 天祠 [Ed. Note: The Unicode character 祠 used here is the modern equivalent of the character used in the original text. See http://humanum.arts.cuhk.edu.hk/Lexis/lexi-mf/search.php?word=%E7%A5%A0 for more information in Chinese]), a place in which a deva is worshipped,—a general name for all Brahmanical temples’ (Eitel, p. 30).",
            "We read in the Khang-hsî dictionary under 寺, that when Kaśyapa Mataṅga came to the capital in the time of the emperor Ming of the second Han dynasty, from the Western Regions, with his Classics or Sûtras, he was lodged in the Court of State-Ceremonial, and that afterwards there was built for him ‘The Court of the White-horse’ (白馬寺), and in consequence the name of Sze (寺) came to be given to all Buddhistic temples.",
            "Fâ-hien, however, applies this term only to Brahmanical temples."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Their speech was somewhat unconnected, but natural enough in the circumstances.",
            "Compare the whole account with the narrative in 1 Samuel v. about the Ark and Dagon, that ‘twice-battered god of Palestine.’"
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "‘Entered the doctrine or path.’",
            "Three stages in the Buddhistic life are indicated by Fâ-hien:— ‘entering it,’ as here, by becoming monks (入道); ‘getting it,’ by becoming Arhats (得道); and ‘completing it,’ by becoming Buddha (成道)."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "It is not quite clear whether the author had in mind here Central India as a whole, which I think he had, or only Kośala, the part of it where he then was.",
            "In the older teaching, there were only thirty-two sects, but there may have been three subdivisions of each.",
            "See Rhys Davids’ ‘Buddhism,’ pp. 98, 99."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This mention of ‘the future world’ is an important difference between the Corean and Chinese texts.",
            "The want of it in the latter has been a stumbling-block in the way of all previous translators.",
            "Rémusat says in a note that ‘the heretics limited themselves to speak of the duties of man in his actual life without connecting it by the notion of the metempsychosis with the anterior periods of existence through which he had passed.’",
            "But this is just the opposite of what Fâ-hien’s meaning was, according to our Corean text.",
            "The notion of ‘the metempsychosis’ was just that in which all the ninety-six erroneous systems agreed among themselves and with Buddhism.",
            "If he had wished to say what the French sinologue thinks he does say, moreover, he would probably have written 皆和今世耳.",
            "Let me add, however, that the connexion which Buddhism holds between the past world (including the present) and the future is not that of a metempsychosis, or transmigration of souls, for it does not appear to admit any separate existence of the soul.",
            "Adhering to its own phraseology of ‘the wheel,’ I would call its doctrine that of ‘The Transrotation of Births.’",
            "See Rhys Davids’ third Hibbert Lecture."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "See p. 60, note 3; and p. 51, note 2."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "Or, more according to the phonetisation of the text, Vaidûrya.",
            "He was king of Kośala, the son and successor of Prasenajit, and the destroyer of Kapilavastu, the city of the Śâkya family.",
            "His hostility to the Śâkyas is sufficiently established, and it may be considered as certain that the name Shay-e, which, according to Julien’s ‘Méthode,’ p. 89, may be read Chiâ-e, is the same as Kiâ-e (迦夷), phonetisations of Kapilavastu, as given by Eitel."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "This would be the interview in the ‘Life of the Buddha’ in Trübner’s Oriental Series, p. 116, when Virûdhaha on his march found Buddha under an old sakotato tree.",
            "It afforded him no shade; but he told the king that the thought of the danger of ‘his relatives and kindred made it shady.’",
            "The king was moved to sympathy for the time, and went back to Śrâvastî; but the destruction of Kapilavastu was only postponed for a short space, and Buddha himself acknowledged it to be inevitable in the connexion of cause and effect."
          ]
        }
      ]
    }
  ]
}
