{
  "title": "INTRODUCTION.",
  "subtitle": "LIFE OF FÂ-HIEN; GENUINENESS AND INTEGRITY OF THE TEXT OF HIS NARRATIVE; NUMBER OF THE ADHERENTS OF BUDDHISM.",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "1. Nothing of great importance is known about Fâ-hien in addition to what may be gathered from his own record of his travels.",
          "I have read the accounts of him in the ‘Memoirs of Eminent Monks,’ compiled in A.D. 519, and a later work, the ‘Memoirs of Marvellous Monks,’ by the third emperor of the Ming dynasty (A.D. 1403-1424), which, however, is nearly all borrowed from the other; and all in them that has an appearance of verisimilitude can be brought within brief compass."
        ]
      },
      {
        "sentences": [
          "His surname, they tell us, was Kung[1] and he was a native of Wû-yang in P’ing-yang[2], which is still the name of a large department in Shan-hsî.",
          "He had three brothers older than himself; but when they all died before shedding their first teeth, his father devoted him to the service of the Buddhist society, and had him entered as a Śrâmaṇera, still keeping him at home in the family.",
          "The little fellow fell dangerously ill, and the father sent him to the monastery, where he soon got well and refused to return to his parents."
        ]
      },
      {
        "sentences": [
          "When he was ten years old, his father died; and an uncle, considering the widowed solitariness and helplessness of the mother, urged him to renounce the monastic life, and return to her, but the boy replied, ‘I did not quit the family in compliance with my father’s wishes, but because I wished to be far from the dust and vulgar ways of life. This is why I choose monkhood.’",
          "The uncle approved of his words and gave over urging him.",
          "When his mother also died, it appeared how great had been the affection for her of his fine nature; but after her burial he returned to the monastery."
        ]
      },
      {
        "sentences": [
          "On one occasion he was cutting rice with a score or two of his fellow disciples, when some hungry thieves came upon them to take away their grain by force.",
          "The other Śrâmaṇeras all fled, but our young hero stood his ground, and said to the thieves, ‘If you must have the grain, take what you please. But, Sirs, it was your former neglect of charity which brought you to your present state of destitution; and now, again, you wish to rob others. I am afraid that in the coming ages you will have still greater poverty and distress;—I am sorry for you beforehand.’",
          "With these words he followed his companions to the monastery, while the thieves left the grain and went away, all the monks, of whom there were several hundred, doing homage to his conduct and courage."
        ]
      },
      {
        "sentences": [
          "When he had finished his noviciate and taken on him the obligations of the full Buddhist orders, his earnest courage, clear intelligence, and strict regulation of his demeanour were conspicuous; and soon after, he undertook his journey to India in search of complete copies of the Vinaya-piṭaka.",
          "What follows this is merely an account of his travels in India and return to China by sea, condensed from his own narrative, with the addition of some marvellous incidents that happened to him, on his visit to the Vulture Peak near Râjagṛiha."
        ]
      },
      {
        "sentences": [
          "It is said in the end that after his return to China, he went to the capital (evidently Nanking), and there, along with the Indian Śramaṇa Buddha-bhadra, executed translations of some of the works which he had obtained in India; and that before he had done all that he wished to do in this way, he removed to King-chow[3] (in the present Hoo-pih), and died in the monastery of Sin, at the age of eighty-eight, to the great sorrow of all who knew him.",
          "It is added that there is another larger work giving an account of his travels in various countries."
        ]
      },
      {
        "sentences": [
          "Such is all the information given about our author, beyond what he has himself told us.",
          "Fâ-hien was his clerical name, and means ‘Illustrious in the Law,’ or ‘Illustrious master of the Law.’",
          "The Shih which often precedes it is an abbreviation of the name of Buddha as Śâkyamuni, ‘the Śâkya, mighty in Love, dwelling in Seclusion and Silence,’ and may be taken as equivalent to Buddhist.",
          "He is sometimes said to have belonged to ‘the eastern Tsin dynasty’ (A.D. 317-419), and sometimes to ‘the Sung,’ that is, the Sung dynasty of the House of Liû (A.D. 420-478).",
          "If he became a full monk at the age of twenty, and went to India when he was twenty-five, his long life may have been divided pretty equally between the two dynasties."
        ]
      },
      {
        "sentences": [
          "2. If there were ever another and larger account of Fâ-hien’s travels than the narrative of which a translation is now given, it has long ceased to be in existence."
        ]
      },
      {
        "sentences": [
          "In the Catalogue of the imperial library of the Suy dynasty (A.D. 589-618), the name Fâ-hien occurs four times.",
          "Towards the end of the last section of it (page 22), after a reference to his travels, his labours in translation at Kin-ling (another name for Nanking), in conjunction with Buddha-bhadra, are described.",
          "In the second section, page 15, we find ‘A Record of Buddhistic Kingdoms;’—with a note, saying that it was the work of ‘the Śramaṇa, Fâ-hien;’ and again, on page 13, we have ‘Narrative of Fâ-hien in two Books,’ and ‘Narrative of Fâ-hien’s Travels in one Book.’",
          "But all these three entries may possibly belong to different copies of the same work, the first and the other two being in separate subdivisions of the Catalogue."
        ]
      },
      {
        "sentences": [
          "In the two Chinese copies of the narrative in my possession the title is ‘Record of Buddhistic Kingdoms.’",
          "In the Japanese or Corean recension subjoined to this translation, the title is twofold; first, ‘Narrative of the Distinguished Monk, Fâ-hien;’ and then, more at large, ‘Incidents of Travels in India, by the Śramaṇa of the Eastern Tsin, Fâ-hien, recorded by himself.’"
        ]
      },
      {
        "sentences": [
          "There is still earlier attestation of the existence of our little work than the Suy Catalogue.",
          "The Catalogue Raisonné of the imperial library of the present dynasty (chap. 71) mentions two quotations from it by Le Tâo-yüen, a geographical writer of the dynasty of the Northern Wei (A.D. 386-584), one of them containing 89 characters, and the other 276; both of them given as from the ‘Narrative of Fâ-hien.’"
        ]
      },
      {
        "sentences": [
          "In all catalogues subsequent to that of Suy our work appears.",
          "The evidence for its authenticity and genuineness is all that could be required.",
          "It is clear to myself that the ‘Record of Buddhistic Kingdoms’ and the ‘Narrative of his Travels by Fâ-hien’ were designations of one and the same work, and that it is doubtful whether any larger work on the same subject was ever current.",
          "With regard to the text subjoined to my translation, it was published in Japan in 1779.",
          "The editor had before him four recensions of the narrative; those of the Sung and Ming dynasties, with appendixes on the names of certain characters in them; that of Japan; and that of Corea.",
          "He wisely adopted the Corean text, published in accordance with a royal rescript in 1726, so far as I can make out; but the different readings of the other texts are all given in top-notes, instead of foot-notes as with us, this being one of the points in which customs in the east and west go by contraries.",
          "Very occasionally, the editor indicates by a single character, equivalent to ‘right’ or ‘wrong,’ which reading in his opinion is to be preferred.",
          "In the notes to the present republication of the Corean text, S stands for Sung, M for Ming, and J for Japanese; R for right, and W for wrong.",
          "I have taken the trouble to give all the various readings (amounting to more than 300), partly as a curiosity and to make my text complete, and partly to show how, in the transcription of writings in whatever language, such variations are sure to occur,\n‘maculae, quas aut incuria fudit,\nAut humana parum cavit natura,’\nwhile on the whole they very slightly affect the meaning of the document.",
          "The editors of the Catalogue Raisonné intimate their doubts of the good taste and reliability of all Fâ-hien’s statements.",
          "It offends them that he should call central India the ‘Middle Kingdom,’ and China, which to them was the true and only Middle Kingdom, but ‘a Border land;’—it offends them as the vaunting language of a Buddhist writer, whereas the reader will see in the expressions only an instance of what Fâ-hien calls his ‘simple straightforwardness.’"
        ]
      },
      {
        "sentences": [
          "As an instance of his unreliability they refer to his account of the Buddhism of Khoten, whereas it is well known, they say, that the Khoteners from ancient times till now have been Mohammedans;—as if they could have been so 170 years before Mohammed was born, and 222 years before the year of the Hegira! And this is criticism in China.",
          "The Catalogue was ordered by the K’ien-lung emperor in 1722.",
          "Between three and four hundred of the ‘Great Scholars’ of the empire were engaged on it in various departments, and thus egregiously ignorant did they show themselves of all beyond the limits of their own country, and even of the literature of that country itself."
        ]
      },
      {
        "sentences": [
          "Much of what Fâ-hien tells his readers of Buddhist miracles and legends is indeed unreliable and grotesque; but we have from him the truth as to what he saw and heard."
        ]
      },
      {
        "sentences": [
          "3. In concluding this introduction I wish to call attention to some estimates of the number of Buddhists in the world which have become current, believing, as I do, that the smallest of them is much above what is correct."
        ]
      },
      {
        "sentences": [
          "i. In a note on the first page of his work on the Bhilsa Topes (1854), General Cunningham says: ‘The Christians number about 270 millions; the Buddhists about 222 millions, who are distributed as follows:—China 170 millions, Japan 25, Anam 14, Siam 3, Ava 8, Nepál 1, and Ceylon 1; total, 222 millions.’"
        ]
      },
      {
        "sentences": [
          "ii. In his article on M. J. Barthélemy Saint Hilaire’s ‘Le Bouddha et sa Religion,’ republished in his ‘Chips from a German Workshop,’ vol. i. (1868), Professor Max Müller (p. 215) says, ‘The young prince became the founder of a religion which, after more than two thousand years, is still professed by 455 millions of human beings,’ and he appends the following note: ‘Though truth is not settled by majorities, it would be interesting to know which religion counts at the present moment the largest numbers of believers. Berghaus, in his “Physical Atlas,” gives the following division of the human race according to religion:—“Buddhists 31.2 per cent, Christians 30.7, Mohammedans 15.7, Brahmanists 13.4, Heathens 8.7, and Jews 0.3.” As Berghaus does not distinguish the Buddhists in China from the followers of Confucius and Laotse, the first place on the scale belongs really to Christianity. It is difficult in China to say to what religion a man belongs, as the same person may profess two or three. The emperor himself, after sacrificing according to the ritual of Confucius, visits a Tao-ssé temple, and afterwards bows before an image of Fo in a Buddhist chapel. (“Mélanges Asiatiques de St. Pétersbourg,” vol. ii. p. 374.)’"
        ]
      },
      {
        "sentences": [
          "iii. Both these estimates are exceeded by Dr. T. W. Rhys Davids (intimating also the uncertainty of the statements, and that numbers are no evidence of truth) in the introduction to his ‘Manual of Buddhism.’",
          "The Buddhists there appear as amounting in all to 500 millions:—30 millions of Southern Buddhists, in Ceylon, Burma, Siam, Anam, and India (Jains); and 470 millions of Northern Buddhists, of whom nearly 33 millions are assigned to Japan, and 414,686,974 to the eighteen provinces of China proper.",
          "According to him, Christians amount to about 26 per cent of mankind, Hindus to about 13, Mohammedans to about 12½, Buddhists to about 40, and Jews to about ½."
        ]
      },
      {
        "sentences": [
          "In regard to all these estimates, it will be observed that the immense numbers assigned to Buddhism are made out by the multitude of Chinese with which it is credited.",
          "Subtract Cunningham’s 170 millions of Chinese from his total of 222, and there remains only 52 millions of Buddhists.",
          "Subtract Davids’ (say) 414½ millions of Chinese from his total of 500, and there remain only 85½ millions for Buddhism.",
          "Of the numbers assigned to other countries, as well as of their whole populations, I am in considerable doubt, excepting in the cases of Ceylon and India; but the greatness of the estimates turns upon the immense multitudes said to be in China.",
          "I do not know what total population Cunningham allowed for that country, nor on what principle he allotted 170 millions of it to Buddhism;—perhaps he halved his estimate of the whole, whereas Berghaus and Davids allotted to it the highest estimates that have been given of the people."
        ]
      },
      {
        "sentences": [
          "But we have no certain information of the population of China.",
          "At an interview with the former Chinese ambassador, Kwo Sung-tâo, in Paris, in 1878, I begged him to write out for me the amount, with the authority for it, and he assured me that it could not be done.",
          "I have read probably almost everything that has been published on the subject, and endeavoured by methods of my own to arrive at a satisfactory conclusion;—without reaching a result which I can venture to lay before the public.",
          "My impression has been that 400 millions is hardly an exaggeration."
        ]
      },
      {
        "sentences": [
          "But supposing that we had reliable returns of the whole population, how shall we proceed to apportion that among Confucianists, Tâoists, and Buddhists? Confucianism is the orthodoxy of China.",
          "The common name for it is Jû Chiâo, ‘the Doctrines held by the Learned Class,’ entrance into the circle of which is, with a few insignificant exceptions, open to all the people.",
          "The mass of them and the masses under their influence are preponderatingly Confucian; and in the observance of ancestral worship, the most remarkable feature of the religion proper of China from the earliest times, of which Confucius was not the author but the prophet, an overwhelming majority are regular and assiduous."
        ]
      },
      {
        "sentences": [
          "Among ‘the strange principles’ which the emperor of the K’ang-hsî period, in one of his famous Sixteen Precepts, exhorted his people to ‘discountenance and put away, in order to exalt the correct doctrine,’ Buddhism and Tâoism were both included.",
          "If, as stated in the note quoted from Professor Müller, the emperor countenances both the Tâoist worship and the Buddhist, he does so for reasons of state;—to please especially his Buddhistic subjects in Thibet and Mongolia, and not to offend the many whose superstitious fancies incline to Tâoism."
        ]
      },
      {
        "sentences": [
          "When I went out and in as a missionary among the Chinese people for about thirty years, it sometimes occurred to me that only the inmates of their monasteries and the recluses of both systems should be enumerated as Buddhists and Tâoists; but I was in the end constrained to widen that judgment, and to admit a considerable following of both among the people, who have neither received the tonsure nor assumed the yellow top.",
          "Dr. Eitel, in concluding his discussion of this point in his ‘Lecture on Buddhism, an Event in History,’ says: ‘It is not too much to say that most Chinese are theoretically Confucianists, but emotionally Buddhists or Tâoists. But fairness requires us to add that, though the mass of the people are more or less influenced by Buddhist doctrines, yet the people, as a whole, have no respect for the Buddhist church, and habitually sneer at Buddhist priests.’",
          "For the ‘most’ in the former of these two sentences I would substitute ‘nearly all;’ and between my friend’s ‘but’ and ‘emotionally’ I would introduce ‘many are,’ and would not care to contest his conclusion farther.",
          "It does seem to me preposterous to credit Buddhism with the whole of the vast population of China, the great majority of whom are Confucianists.",
          "My own opinion is, that its adherents are not so many as those even of Mohammedanism, and that instead of being the most numerous of the religions (so called) of the world, it is only entitled to occupy the fifth place, ranking below Christianity, Confucianism, Brahmanism, and Mohammedanism, and followed, some distance off, by Tâoism.",
          "To make a table of per-centages of mankind, and assign to each system its proportion, is to seem to be wise where we are deplorably ignorant; and, moreover, if our means of information were much better than they are, our figures would merely show the outward adherence.",
          "A fractional per-centage might tell more for one system than a very large integral one for another."
        ]
      }
    ]
  },
  "footnotes": [
    {
      "paragraphs": [
        {
          "sentences": [
            "龔."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "平陽, 武陽."
          ]
        }
      ]
    },
    {
      "paragraphs": [
        {
          "sentences": [
            "荊州."
          ]
        }
      ]
    }
  ]
}
