{
  "title": "PREFACE.",
  "subtitle": "",
  "content": {
    "paragraphs": [
      {
        "sentences": [
          "SEVERAL times during my long residence in Hong Kong I endeavoured to read through the ‘Narrative of Fâ-hien;’ but though interested with the graphic details of much of the work, its columns bristled so constantly—now with his phonetic representations of Sanskrit words, and now with his substitution for them of their meanings in Chinese characters, and I was, moreover, so much occupied with my own special labours on the Confucian Classics, that my success was far from satisfactory.",
          "When Dr. Eitel’s ‘Handbook for the Student of Chinese Buddhism’ appeared in 1870, the difficulty occasioned by the Sanskrit words and names was removed, but the other difficulty remained; and I was not able to look into the book again for several years.",
          "Nor had I much inducement to do so in the two copies of it which I had been able to procure, on poor paper, and printed from blocks badly cut at first, and so worn with use as to yield books the reverse of attractive in their appearance to the student."
        ]
      },
      {
        "sentences": [
          "In the meantime I kept studying the subject of Buddhism from various sources; and in 1878 began to lecture, here in Oxford, on the Travels with my Davis Chinese scholar, who was at the same time Boden Sanskrit scholar.",
          "As we went on, I wrote out a translation in English for my own satisfaction of nearly half the narrative.",
          "In the beginning of last year I made Fâ-hien again the subject of lecture, wrote out a second translation, independent of the former, and pushed on till I had completed the whole."
        ]
      },
      {
        "sentences": [
          "The want of a good and clear text had been supplied by my friend, Mr. Bunyiu Nanjio, who sent to me from Japan a copy, the text of which is appended to the translation and notes, and of the nature of which some account is given in the Introduction (page 4), and towards the end of this Preface."
        ]
      },
      {
        "sentences": [
          "The present work consists of three parts: the Translation of Fâ-hien’s Narrative of his Travels; copious Notes; and the Chinese Text of my copy from Japan."
        ]
      },
      {
        "sentences": [
          "It is for the Translation that I hold myself more especially responsible.",
          "Portions of it were written out three times, and the whole of it twice.",
          "While preparing my own version I made frequent reference to previous translations:—those of M. Abel Rémusat, ‘Revu, complété, et augmenté d’éclaircissements nouveaux par MM. Klaproth et Landresse’ (Paris, 1836); of the Rev. Samuel Beal (London, 1869), and his revision of it, prefixed to his ‘Buddhist Records of the Western World’ (Trübner’s Oriental Series, 1884); and of Mr. Herbert A. Giles, of H.M.’s Consular Service in China (1877).",
          "To these I have to add a series of articles on ‘Fa-hsien and his English Translators,’ by Mr. T. Watters, British Consul at Î-Chang (China Review, 1879, 1880).",
          "Those articles are of the highest value, displaying accuracy of Chinese scholarship and an extensive knowledge of Buddhism.",
          "I have regretted that Mr. Watters, while reviewing others, did not himself write out and publish a version of the whole of Fâ-hien’s narrative.",
          "If he had done so, I should probably have thought that, on the whole, nothing more remained to be done for the distinguished Chinese pilgrim in the way of translation.",
          "Mr. Watters had to judge of the comparative merits of the versions of Beal and Giles, and pronounce on the many points of contention between them.",
          "I have endeavoured to eschew those matters, and have seldom made remarks of a critical nature in defence of renderings of my own."
        ]
      },
      {
        "sentences": [
          "The Chinese narrative runs on without any break.",
          "It was Klaproth who divided Rémusat’s translation into forty chapters.",
          "The division is helpful to the reader, and I have followed it excepting in three or four instances.",
          "In the reprinted Chinese text the chapters are separated by a circle (O) in the column."
        ]
      },
      {
        "sentences": [
          "In transliterating the names of Chinese characters I have generally followed the spelling of Morrison rather than the Pekinese, which is now in vogue.",
          "We cannot tell exactly what the pronunciation of them was, about fifteen hundred years ago, in the time of Fâ-hien; but the southern mandarin must be a shade nearer to it than that of Peking at the present day.",
          "In transliterating the Indian names I have for the most part followed Dr. Eitel, with such modification as seemed good and in harmony with growing usage."
        ]
      },
      {
        "sentences": [
          "For the Notes I can do little more than claim the merit of selection and condensation.",
          "My first object in them was to explain what in the text required explanation to an English reader.",
          "All Chinese texts, and Buddhist texts especially, are new to foreign students.",
          "One has to do for them what many hundreds of the ablest scholars in Europe have done for the Greek and Latin Classics during several hundred years, and what the thousands of critics and commentators have been doing for our Sacred Scriptures for nearly eighteen centuries.",
          "There are few predecessors in the field of Chinese literature into whose labours translators of the present century can enter.",
          "This will be received, I hope, as a sufficient apology for the minuteness and length of some of the notes.",
          "A second object in them was to teach myself first, and then others, something of the history and doctrines of Buddhism.",
          "I have thought that they might be learned better in connexion with a lively narrative like that of Fâ-hien than by reading didactic descriptions and argumentative books.",
          "Such has been my own experience.",
          "The books which I have consulted for these notes have been many, besides Chinese works.",
          "My principal help has been the full and masterly handbook of Eitel, mentioned already, and often referred to as E. H. Spence Hardy’s ‘Eastern Monachism’ (E. M.) and ‘Manual of Buddhism’ (M. B.) have been constantly in hand, as well as Rhys Davids’ Buddhism, published by the Society for Promoting Christian Knowledge, his Hibbert Lectures, and his Buddhist Suttas in the Sacred Books of the East, and other writings.",
          "I need not mention other authorities, having endeavoured always to specify them where I make use of them.",
          "My proximity and access to the Bodleian Library and the Indian Institute have been of great advantage."
        ]
      },
      {
        "sentences": [
          "I may be allowed to say that, so far as my own study of it has gone, I think there are many things in the vast field of Buddhistic literature which still require to be carefully handled.",
          "How far, for instance, are we entitled to regard the present Sûtras as genuine and sufficiently accurate copies of those which were accepted by the Councils before our Christian era?",
          "Can anything be done to trace the rise of the legends and marvels of Śâkyamuni’s history, which were current so early (as it seems to us) as the time of Fâ-hien, and which startle us so frequently by similarities between them and narratives in our Gospels?",
          "Dr. Hermann Oldenberg, certainly a great authority on Buddhistic subjects, says that ‘a biography of Buddha has not come down to us from ancient times, from the age of the Pâli texts; and, we can safely say, no such biography existed then’ (‘Buddha—His Life, His Doctrine, His Order,’ as translated by Hoey, p. 78).",
          "He has also (in the same work, pp. 99, 416, 417) come to the conclusion that the hitherto unchallenged tradition that the Buddha was ‘a king’s son’ must be given up.",
          "The name, ‘king’s son’ (in Chinese 太子), always used of the Buddha, certainly requires to be understood in the highest sense.",
          "I am content myself to wait for further information on these and other points, as the result of prolonged and careful research."
        ]
      },
      {
        "sentences": [
          "Dr. Rhys Davids has kindly read the proofs of the Translation and Notes, and I most cordially thank him for doing so, for his many valuable corrections in the Notes, and for other suggestions which I have received from him.",
          "I may not always think on various points exactly as he does, but I am not more forward than he is to say with Horace,—"
        ]
      },
      {
        "sentences": [
          "‘Nullius addictus jurare in verba magistri.’"
        ]
      },
      {
        "sentences": [
          "I have referred above, and also in the Introduction, to the Corean text of Fâ-hien's narrative, which I received from Mr. Nanjio.",
          "It is on the whole so much superior to the better-known texts, that I determined to attempt to reproduce it at the end of the little volume, so far as our resources here in Oxford would permit.",
          "To do so has not been an easy task.",
          "The two fonts of Chinese types in the Clarendon Press were prepared primarily for printing the translation of our Sacred Scriptures, and then extended so as to be available for printing also the Confucian Classics; but a Buddhist work necessarily requires many types not found in them, while many other characters in the Corean recension are peculiar in their forms, and some are what Chinese dictionaries denominate ‘vulgar.’",
          "That we have succeeded so well as we have done is owing chiefly to the intelligence, ingenuity, and untiring attention of Mr. J. C. Pembrey, the Oriental Reader."
        ]
      },
      {
        "sentences": [
          "The pictures that have been introduced were taken from a superb edition of a History of Buddha, republished recently at Hang-châu in Cheh-kiang, and profusely illustrated in the best style of Chinese art.",
          "I am indebted for the use of it to the Rev. J. H. Sedgwick, University Chinese Scholar."
        ]
      },
      {
        "sentences": [
          "JAMES LEGGE.\nOXFORD:\nJune, 1886."
        ]
      }
    ]
  },
  "footnotes": []
}
